[{"igdb_id":70099,"name":"1Key Rocket Launcher","summary":"This game is a one-button-game where you have to repeatedly hit the space bar to power up your rocket in order to let it fly into the sky... or crash it nearby.\n\nYou main goal is to hit the button only then when it is over the green part of your control system. The more you are off the center, the more the rockets angle will increase (if you are still in the power-up area) or the rocket is loosing power (if you are beyond the power-up area).\n\nOnce you have enough power (turned the vertical red line green), your rocket will start with the angle you have achieved. Depending on that angle, you rocket will either go to the orbit or fly a 180° into the ground.\n\nThe game has a highscore table that counts the time you needed to get your rocket successfully into space.","genres":["Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1114905600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/oyo76cm0dh1mjihtdse8.jpg","external_ids":[{"category":3,"store":"store_3","uid":"16598","url":"https://www.giantbomb.com/games/3030-16598/"},{"category":14,"store":"playstation","uid":"15213","url":"https://www.twitch.tv/directory/game/1Key%20Rocket%20Launcher"}]},{"igdb_id":83130,"name":"1K Othello","summary":null,"genres":["Card & Board Game"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1230681600,"platforms":["ZX Spectrum"],"cover_url":null,"external_ids":[{"category":null,"store":"store_None","uid":"63897","url":"https://www.giantbomb.com/games/3030-63897/"},{"category":14,"store":"playstation","uid":"501404","url":"https://www.twitch.tv/directory/game/1K%20Othello"}]},{"igdb_id":83131,"name":"1Kanoid","summary":null,"genres":["Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1041292800,"platforms":["ZX Spectrum"],"cover_url":null,"external_ids":[{"category":14,"store":"playstation","uid":"501405","url":"https://www.twitch.tv/directory/game/1Kanoid"},{"category":null,"store":"store_None","uid":"63896","url":"https://www.giantbomb.com/games/3030-63896/"}]},{"igdb_id":93236,"name":"1Key Minigolf","summary":"In this game you play miniature golf just with one button. You aim, set precision and power of the shot only using the space bar at your keyboard.\n\nAfter starting a course, your player is rotating clockwise. Press space to set the direction. Now the precision meter becomes active, press space when the green spot is highlighted. Finally, the power meter becomes active, setting the power of the shot. Once you press space here you release the ball. Repeat this until you put the ball in and the new course will load.\n\nAll in all, there are 18 courses in the game.","genres":["Sport","Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1112313600,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[{"category":null,"store":"store_None","uid":"7722","url":"https://www.twitch.tv/directory/game/1Key%20Minigolf"},{"category":null,"store":"store_None","uid":"8439","url":"https://www.giantbomb.com/games/3030-8439/"}]},{"igdb_id":319533,"name":"1K Games","summary":"1K Games Pack is a collection of 11 games and programs on one tape. The collection consists of:\n\nSlot machine: You have 10p and you play a slot machine for 1p a go trying to get three numbers the same (10p) or the numbers add up to seven (5p).\n\nEtch and Sketch: This a program that allows you to draw pictures and shapes with a cursor.\n\nSlalom: Gates move down the screen and you have to align yourself to go through them without hitting them or missing them altogether.\n\nCatch me if you can: You must move an X to catch a O that moves about the screen.\n\nSpace Pirate: You must attempt to dock your spaceship as it moves down the screen with another ship that moves left and right across the screen.\n\nSpacefire 1: You are on the left of the screen while the computer is on the right, firing bullets at each other attempting to hit the other player.\n\nSpacefire 2: Same as 1 but now the computer moves left across the screen.\n\nCar Crash: You must drive your car down the screen avoiding the other vehicles and the sides of the road.\n\nMan-Eating Budgies: You are on the top of the screen and Budgies move up the screen and you must avoid them while collecting their eggs.\n\nMaze: You are on the top of the screen and a maze moves upwards and you must navigate through it without hitting the walls.\n\nThe Wall: You move right across the screen and you must remove every part of a wall that moves slowly upwards.","genres":[],"developers":["Artic Computing Ltd."],"publishers":["Artic Computing Ltd.","Sinclair Research"],"aggregated_rating":null,"release_date":410140800,"platforms":["Sinclair ZX81"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8xdr.jpg","external_ids":[{"category":null,"store":"store_None","uid":"1299878629","url":"https://www.twitch.tv/directory/game/1K%20Games"}]},{"igdb_id":376935,"name":"1K: Small Room","summary":"A big secret hidden in a small room. \"1K - Small Room -\" is a first-person horror adventure game set in a single apartment room. Explore the confined space and uncover the hidden truth.","genres":["Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coatoj.jpg","external_ids":[]}]