[{"igdb_id":159018,"name":"G-Darius HD","summary":"Take flight in the iconic Silver Hawk and immerse yourself in thrilling gameplay with both modern HD-visuals or authentic retro-arcade graphics. Experience the conflicts between the Amnelia Kingdom and the merciless Thiima Empire that took place before the battle between the people of Darius and Belsar. During this conflict, the series’ iconic Silver Hawks were created to make use of the game’s unique capture ball system that allows you to forge your own strategy and gain an edge over the enemy! G-DARIUS HD is the port of “G-DARIUS” in high resolution – developed by the masters of remastering at M2. The game can also be played in low resolution like in the original arcade version. From the epic boss battles to the memorable soundtrack, G-DARIUS stood out when it first got released in the arcades and up to these days, critics and fans are praising this game as a prime example of how to bring a 2D game series properly to 3D.","genres":["Shooter","Adventure","Arcade"],"developers":[],"publishers":[],"aggregated_rating":79.5,"release_date":1632700800,"platforms":["PlayStation 4","PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3gg8.jpg","external_ids":[]},{"igdb_id":39691,"name":"G-Darius","summary":"G-Darius is a shoot'em up arcade game, released by Taito in 1997. It is the fourth arcade installment of the Darius series and the first in the entire series to feature three-dimensional polygonal graphics. Much like previous installments in the Darius series, G-Darius is a two-dimensional horizontally scrolling shoot'em up set in a fictional future.","genres":["Shooter"],"developers":["Taito"],"publishers":["Taito","THQ","MediaKite","Sourcenext","Square Enix","CyberFront"],"aggregated_rating":null,"release_date":867801600,"platforms":["Arcade","PlayStation 3","PC (Microsoft Windows)","PlayStation","PlayStation Portable"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coaa5v.jpg","external_ids":[]},{"igdb_id":145879,"name":"G-Darius Ver.2","summary":"A second version of G-Darius was released in the arcades in 1999, with the following changes:\n- Increased difficulty.\n- Default play cost is increased to 2 coins per credit from 1 coin per credit.\n- Added Beginner Mode; in this mode, the game ends after completing only 3 zones.\n- Standard auto-fire button.\n- When using a Capture Ball, the player is no longer invulnerable.\n- With the super shield, the player is vulnerable to obstacles; with the hyper shield, the player can take a single hit from obstacles.\n- All stages include mid-bosses; moreover, they all fire the spiral laser from First Captain at the player.\n- Boss battles include a timer - three minutes for normal bosses, seven minutes for the final boss - with 10000 bonus points added to the player's score for each remaining second upon destroying the boss.\n- The high score table records high scores for each zone.\n- After continuing, the player is given one of each Missile, Bomb, Arm and Capture Ball power-ups, instead of a single item that provides the first three.","genres":["Shooter","Arcade"],"developers":["Taito"],"publishers":["Taito"],"aggregated_rating":null,"release_date":946598400,"platforms":["Arcade"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2y1h.jpg","external_ids":[]},{"igdb_id":38020,"name":"Gdleen","summary":"Gdleen is a Role-Playing game, developed by Jorudan and published by Seta Corporation, which was released in Japan in 1991.","genres":["Role-playing (RPG)"],"developers":["Jorudan"],"publishers":["SETA"],"aggregated_rating":null,"release_date":675388800,"platforms":["Super Famicom"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8ntc.jpg","external_ids":[]},{"igdb_id":101630,"name":"G-Dino's Jungle Adventure","summary":"The green dinosaur Dino once again landed in an adventure. This time, he had to find himself in the wild jungle..","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5dld.jpg","external_ids":[]},{"igdb_id":180016,"name":"GDO Masters","summary":"GDO Masters is a 3D fighting game with mutually assured fun! Pick one from 8 characters and fight for the title of GDO Master!","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1635984000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co47to.jpg","external_ids":[]}]