[{"igdb_id":736,"name":"GT Legends","summary":"The golden age of motor sports has returned. Experience one of the world’s most exciting racing series in GT.","genres":["Racing","Simulator","Sport"],"developers":["SimBin"],"publishers":["10tacle Studios","Atari, Inc."],"aggregated_rating":85.0,"release_date":1128556800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co86cd.jpg","external_ids":[]},{"igdb_id":737,"name":"GTR 2: FIA GT Racing Game","summary":"The successor to the international award-winning racing simulation GTR accurately represents the challenges of Motorsport racing. The detailed, photo-realistic depiction of these powerful cars and beautiful circuits, thanks to the graphics technology, and the enhanced driving model will make your adrenaline rise in one of more than one hundred HP-beasts.\n\nBeginners can start with the driving school where they are taught the basics of race driving by a professional instructor. Thanks to dynamic day, night and weather changes and an impressive damage system, the races of the exciting FIA GT series become a thrilling gaming experience.\n\nSince the release of GTR2 in September 2006, the game has received widespread acclaim. GTR2 simulates the 2003 and 2004 FIA GT Championship racing series.","genres":["Racing","Simulator","Sport"],"developers":["Blimey! Games"],"publishers":["Atari, Inc."],"aggregated_rating":89.66666666666667,"release_date":1159488000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co86ce.jpg","external_ids":[]},{"igdb_id":738,"name":"GTR: FIA GT Racing Game","summary":"Experience the 2003 season of the FIA GT Championship first-hand as you test your skills on all the legendary race tracks the FIA GT.","genres":["Racing","Simulator","Sport"],"developers":["SimBin"],"publishers":["10tacle Studios","Atari, Inc."],"aggregated_rating":85.0,"release_date":1115078400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/baui8m1pt4x1c64uklte.jpg","external_ids":[]},{"igdb_id":3375,"name":"GT 64: Championship Edition","summary":"GT 64: Championship Edition \"Grand Tour 64\" is a racing video game for the Nintendo 64. Hence its title, it was an official licensed game to All-Japan GT Championship, featuring cars and drivers of the 1997 season. GT and Grand Tour our references to long distance traveling such as in the traditional version of the Grand Tour. It was first released on Super Famicom as Zen-Nippon GT Senshuken. It was also the final game ever published by Ocean Software.","genres":["Racing"],"developers":["Imagineer"],"publishers":["Imagineer","Infogrames","Ocean"],"aggregated_rating":null,"release_date":892512000,"platforms":["Nintendo 64"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co47qf.jpg","external_ids":[]},{"igdb_id":3938,"name":"GT Cube","summary":"GT Cube is a Racing game, published by MTO, which was released in Japan in 2003.","genres":["Racing"],"developers":["MTO"],"publishers":["MTO"],"aggregated_rating":null,"release_date":1056067200,"platforms":["Nintendo GameCube"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6uds.jpg","external_ids":[]},{"igdb_id":4899,"name":"GT Pro Series","summary":"GT Pro Series features eighty Japanese cars from various companies, including Honda, Subaru, Toyota, and Nissan. The tracks are in the same vein as those found in the Gran Turismo series of games, but are of a less overall quality.\n\nThe game features cel-shaded cars driving in more realistic settings.","genres":["Racing"],"developers":["MTO"],"publishers":["Ubisoft Japan"],"aggregated_rating":33.33333333333334,"release_date":1163894400,"platforms":["Wii"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6ga7.jpg","external_ids":[]},{"igdb_id":6424,"name":"GT Advance Championship Racing","summary":"Install your car kits, head to the track, start your engines and get ready to challenge the most competitive racers on the circuit! Choose from over 45 authentic cars and race for championship gold on an amazing 32 different tracks. Upgrade your car's performance using 9 categories of upgradeable parts including the engine, suspension, aerodynamics and more.","genres":["Racing"],"developers":["MTO"],"publishers":["THQ","Gradiente"],"aggregated_rating":70.0,"release_date":985132800,"platforms":["Game Boy Advance"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9bnm.jpg","external_ids":[{"category":null,"store":"store_None","uid":"14360","url":"https://www.giantbomb.com/games/3030-14360/"},{"category":null,"store":"store_None","uid":"13177","url":"https://www.twitch.tv/directory/game/GT%20Advance%3A%20Championship%20Racing"}]},{"igdb_id":6425,"name":"GT Advance 2: Rally Racing","summary":"A rally racing game released for Game Boy Advance.","genres":["Racing","Sport"],"developers":["MTO"],"publishers":["THQ"],"aggregated_rating":null,"release_date":1007683200,"platforms":["Game Boy Advance"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9bnn.jpg","external_ids":[{"category":3,"store":"store_3","uid":"12194","url":"https://www.giantbomb.com/games/3030-12194/"},{"category":null,"store":"store_None","uid":"11206","url":"https://www.twitch.tv/directory/game/GT Advance 2: Rally Racing"}]},{"igdb_id":6426,"name":"GT Advance 3: Pro Concept Racing","summary":"Get behind the wheel of the world's top rally cars as you span the globe in quest of a championship. Listen to your navigator as he helps you through more than 40 unique tracks spanning different weather and terrain through 14 grueling stages. Fly over jumps or skid around obstacles on your way to the top of the rally racing circut. Link up with a friend using the GBA link cable for amazing head-to-head competition or watch the action again using the replay mode.","genres":["Racing"],"developers":["MTO"],"publishers":["THQ"],"aggregated_rating":null,"release_date":1019779200,"platforms":["Game Boy Advance"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9c04.jpg","external_ids":[{"category":3,"store":"store_3","uid":"13599","url":"https://www.giantbomb.com/games/3030-13599/"},{"category":null,"store":"store_None","uid":"12478","url":"https://www.twitch.tv/directory/game/GT Advance 3: Pro Concept Racing"}]},{"igdb_id":10381,"name":"GTR Evolution","summary":"The most beautiful GT’s. Extreme versions of the already spectacular World Touring Cars. Exclusive road cars from prestigious brands.\n\nYou will find that and much more in GTR Evolution, including the legendary Nürburgring Nordschleife, the fabled 22,8km long racetrack in Germany.\n\nThis is a racedrivers heaven…and a true evolution in virtual racing.\n\nGTR Evolution is a game from SimBin Studios, based on the award winning release RACE 07.","genres":["Racing","Simulator"],"developers":["SimBin"],"publishers":["SimBin","Viva Media","Atari, Inc."],"aggregated_rating":80.0,"release_date":1220227200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1u89.jpg","external_ids":[]},{"igdb_id":14804,"name":"GTI Racing","summary":"GTI Racing uniquely blends a realistic and highly detailed car physics simulation with the pure fun of driving in a very dynamic way. Grab the wheel, push the pedal to the metal and gather the sensation for the incredible sense of speed and the power of all the real world cars.\n\nRealistic driving model: Lifelike car physics reflect the pure enjoyment of dynamic car driving using some of the best dynamic physics around. Detailed handling model with carefully adjusted parameters give you full control of the car and an incredible ease of driving whilst still being very fun to drive.\n\nCars: GTI Racing gives you the biggest collection of the legendary European Volkswagen Golf series cars. Choose one of the 15 GOLF models, representing all five generations from its original heritage through to the current day. Try out the GTI, G60 and the outstanding R32! Check out Volkswagens hottest concept cars and classics - along with the original Beetle and T1 \"Samba\" transporter.\n\nTuning: GTI Racing introduces you to the professional car customization world, thanks to the impressive and wide array of original visual and performance modding and tuning parts. Spoilers, xenon lights, wide body kits, exhausts and rims - everything you would ever need or desire for the visual aspect of tuning your car. Turbo's, nitro`s, sports transmissions, performance brake kits and wide tires - unlimited performance tuning possibilities.\n\nCareer: Over 70 races in 6 unique settings and scenarios against challenging AI opponents will keep the heat on. Time trial, Drift competition and Drag racing, wild Baja and new Legal Race modes. Finish all 25 Championships located in Germany, France, Italy, UK and USA, earn money and spend it on your ride.\n\nDynamic race surroundings: GTI Racing introduces a new level of intensity into the world of racing thanks to fully physics simulated hundreds of objects on the tracks. Use fully interactive objects to create your advantage - slow down your opponents or disable their cars completely.\n\nDemanding AI: drivers make full use of the driving and collision physics model. They will cut you off, run you off the road, use shortcuts to get to the finish line first, so be on your guard and watch out for them.\n\nDetailed car damage: every contact you make with and object or form of racing collision will leave a dent on your vehicle! Based on Xpand Rally experiences highly detailed damage and mechanical car part stress models this has ben used to great effect to enhance the experience with a very rich flavour.\n\nOnline drive: Race through LAN or on the Internet. Extremely playable Baja mode, closed circuits, highways, drift driving competitions and drag racing championship which will give the multi player racer something to shout about. Intense 4 player racing and action in each race.","genres":["Racing","Simulator"],"developers":["Techland"],"publishers":["Techland"],"aggregated_rating":null,"release_date":1151971200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9bkx.jpg","external_ids":[]},{"igdb_id":25287,"name":"GT-R 400","summary":"As soon as you get behind the wheel of one of the licensed GT cars, including the stunning Ascari KZ1 and the pulsating Mosler MT900, you will feel the discernable leap in class in every aspect of the game - look, feel and gameplay.","genres":["Racing","Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1259020800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/kdyxmd5x7azzwc32ebia.jpg","external_ids":[]},{"igdb_id":28392,"name":"GTI Club: Rally Côte d'Azur","summary":"GTI Club: Rally Côte d'Azur is a racing game originally released for the arcades in 1996 by Konami, based on PowerPC-based hardware; the player raced around the Côte d'Azur and could choose from 5 rally cars including a Mini Cooper and Renault 5 Alpine Turbo. The game allowed moderate free-roaming of the environment, which was revolutionary for the time, and contained several semi-hidden shortcuts that could be used to reduce lap times. A handbrake is provided which the player is encouraged to use to perform handbrake turns round sharp corners.","genres":["Racing","Sport","Arcade"],"developers":["Konami"],"publishers":["Konami"],"aggregated_rating":null,"release_date":844041600,"platforms":["Arcade"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/d0ps3j9hbspdivilfhgl.jpg","external_ids":[]},{"igdb_id":36646,"name":"GTFO","summary":"GTFO is a 4 player action/horror cooperative game for those looking for a real challenge. Players get to play as a team of scavengers, forced to explore and extract valuable artifacts from a vast underground complex that has been overrun by horrifying monsters. Gather weapons, tools and resources to help you survive - and work to unearth the answers about your past and how to escape.","genres":["Shooter","Adventure"],"developers":["10 Chambers Collective"],"publishers":["10 Chambers Collective"],"aggregated_rating":80.0,"release_date":1639008000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4cnq.jpg","external_ids":[{"category":null,"store":"store_None","uid":"493520","url":"https://store.steampowered.com/app/493520"},{"category":null,"store":"store_None","uid":"500627","url":"https://www.twitch.tv/directory/game/GTFO"},{"category":null,"store":"store_None","uid":"63121","url":"https://www.giantbomb.com/games/3030-63121/"}]},{"igdb_id":38939,"name":"GT Racing 2: The Real Car Experience","summary":"GT Racing 2: The Real Car Experience is a true-to-life automotive journey featuring the most prestigious cars in the world! \nThe best-selling franchise is back for free and it's designed to offer an unprecedented level of driving enjoyment, whether playing solo or multiplayer. \n \nLEADERSHIP: POSSIBLY THE BEST HANDHELD RACING SIMULATION \n• The richest handheld racing simulation game this year: 71 licensed cars on 13 tracks, including the real Mazda Raceway Laguna Seca. \n• A superb collection of real cars from over 30 manufacturers: Mercedes-Benz, Ferrari, Dodge, Nissan, Audi, Ford, and more. \n• Test your driving skills by completing 1,400 events, including Classic Races, Duels, Knockouts and Overtakes. \n• 28 new challenges each week: improve your driving skills & maybe win a new car for free! \n \nAUTHENTICITY: A DEEPER DRIVING SENSATION \n• The new physics model offers the most realistic car dynamics ever offered in a handheld game. \n• The sun is not always shining in GT Racing 2: Our tracks have different times of day and weather conditions. \n• Race your way by choosing from among 4 different cameras, including a breathtaking interior view, and feast your eyes on real car designs! \n• No repair times or repair costs! We won't make you wait or pay to race in an event again. \n \nEXPERIENCE: ENJOY THE RIDE SOLO OR IN MULTIPLAYER \n• Compete with your friends or with real players from all over the world. Earn the fastest time on each race in multiplayer! \n• Join teams to play with other drivers and accomplish common goals. \n• New racer? Turn on Steering & Braking Assistance to get up to speed in a flash! \n• Veteran driver? Tweak your performance in the garage with tons of custom options!","genres":["Racing","Sport","Arcade"],"developers":["Gameloft"],"publishers":["Gameloft"],"aggregated_rating":null,"release_date":1384300800,"platforms":["Android","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2f7j.jpg","external_ids":[{"category":null,"store":"store_None","uid":"9WZDNCRDF4NP","url":"https://www.microsoft.com/en-us/p/-1-/9WZDNCRDF4NP"},{"category":14,"store":"playstation","uid":"113121769","url":"https://www.twitch.tv/directory/game/GT%20Racing%202%3A%20The%20Real%20Car%20Experience"}]},{"igdb_id":43598,"name":"GTC: Africa","summary":"GTC: Africa combines the endurance of rally-style driving with the rush of competitive circuit racing. Journey through the most exotic locations on the African continent in officially licensed vehicles from Ford, Mitsubishi, Subaru, and Pontiac. The game features 19 different circuits in locales ranging from safari treks and lagoons to countryside vistas and jungles. In both single-player and multiplayer modes, you must powerslide through rugged terrain, climb towering hills, and improve your track times to achieve victory.","genres":["Racing"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1026604800,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6q0z.jpg","external_ids":[]},{"igdb_id":44432,"name":"GT Racing","summary":"GT Racing is a Super Famicom racing video game where the player gets to drive a Gran Turismo car in either championship or practice mode. The game is based on the 1996 Super GT racing season using the horsepower standards and rules of the era.\n\nDuring championship mode, the player is asked enter a number, his or her driver's name, and the team name that he or she will use during the championship. The driver's name and team can be entered using either English or Japanese letters. When a player beats a record, he or she is asked to insert his or her number, name or initials (up to four characters and two digits for the number). Championship mode can last for multiple seasons. Playing ninety-nine seasons in a single racing career is theoretically possible due to the double-digit nature of the season information. There are eight different tracks, including the Suzuka Circuit that has been shown in video games since Pole Position II and Fuji Speedway (complete with a virtually photorealistic Mount Fuji in the background).\n\nVersus mode is for two human players only and the record options allows the players to look at his or her previous records. In a race, there are up to fifteen opponents to race against. The player gets rewarded with an opportunity to upgrade his or her equipment after a top five finish on any race course. Bonus equipment includes a faster engine, better tires, and a special dose of nitrous oxide created specifically for Gran Turismo vehicles. All of the bonus automobile parts are automatically installed in the appropriate parts for supercharging the vehicle. Once all the special parts are earned, the automobile is considered to be fully upgraded. The ultimate goal is to win the Gran Turismo championship for his or her team in addition for him/herself.\n\nThe \"free practice\" is essentially a time trial mode where the player races by him/herself for up to ten laps. Acquiring damage is still possible either crashing into walls or through normal wear and tear. The fastest lap time gets captured for the record book just like in the other modes of the game. Before being able to practice freely, the player can also choose the weather condition and the setup of his vehicle","genres":["Racing"],"developers":["Imagineer"],"publishers":["Imagineer"],"aggregated_rating":null,"release_date":828057600,"platforms":["Super Famicom"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4xqd.jpg","external_ids":[{"category":null,"store":"store_None","uid":"34167","url":"https://www.twitch.tv/directory/game/GT Racing"},{"category":3,"store":"store_3","uid":"38077","url":"https://www.giantbomb.com/games/3030-38077/"}]},{"igdb_id":50961,"name":"GTI Club Supermini Festa!","summary":"GTI Club Supermini Festa! is based on the latest arcade iteration of the long-running series, and charges the player with racing a series of compact cars around a series of citiscapes across France, the UK, Italy, the US, and Japan. Everything about the game is geared towards searing speed and intuitive handling, with players tussling with CPU-controlled cars or their friends through busy streets as they attempt to be the first past the winning line.","genres":["Racing"],"developers":["Konami"],"publishers":["Konami"],"aggregated_rating":null,"release_date":1271376000,"platforms":["Wii","PlayStation Portable"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6p1u.jpg","external_ids":[{"category":3,"store":"store_3","uid":"27889","url":"https://www.giantbomb.com/games/3030-27889/"},{"category":null,"store":"store_None","uid":"25147","url":"https://www.twitch.tv/directory/game/GTI%20Club%20Supermini%20Festa!"}]},{"igdb_id":56269,"name":"GTR3","summary":"Assume the mantle of a professional GT racing driver in this latest installment of the GTR FIA Racing series.","genres":["Racing"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":57817,"name":"GT Kai: All Japan Grand Touring Car Championship","summary":"An isometric racing game released in Japan in 1996 officially licensed by the All Japan Touring Car Championship.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/s4ymcvgk9lhmapvaeprl.jpg","external_ids":[]},{"igdb_id":64222,"name":"GT Racers","summary":"GT Racers is a Racing game, developed by Aqua Pacific and published by Oxygen Interactive, which was released in Europe in 2004","genres":["Racing"],"developers":["Aqua Pacific"],"publishers":["Oxygen Interactive Software"],"aggregated_rating":null,"release_date":1099612800,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/ktpznbinlovgytzgvlvt.jpg","external_ids":[]},{"igdb_id":79014,"name":"GT Racing Challenge","summary":"Acclaim's racing game for GBA was shown at E3 2001, but was never released.","genres":["Racing"],"developers":[],"publishers":["Acclaim"],"aggregated_rating":null,"release_date":null,"platforms":["Game Boy Advance"],"cover_url":null,"external_ids":[]},{"igdb_id":84212,"name":"GT Racing 97","summary":"GT style racing features in this racer, which tends more towards arcade than simulation. Cars include the Predator and the Hurricane, each with their own strengths and weaknesses. The action can be viewed from inside or outside the car.\n\nWhen starting the game for the first time you can take part in a training or start in a championship. The practice will be done on one of the two initially available tracks. The other tracks are closed. To gain access to those tracks you must first complete one of the championships. Championships consists of a number of races in different countries, taking in road and asphalt settings.","genres":["Racing"],"developers":["Blue Sphere"],"publishers":["Ocean Software Ltd."],"aggregated_rating":null,"release_date":883526400,"platforms":["DOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4kur.jpg","external_ids":[]},{"igdb_id":95781,"name":"GTR Drift Simulator","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[{"category":15,"store":"xbox","uid":"com.xsasoftware.nissan.gtr.car.driftsimulator","url":"https://play.google.com/store/apps/details?id=com.xsasoftware.nissan.gtr.car.driftsimulator"},{"category":null,"store":"store_None","uid":"1221155750","url":"https://www.twitch.tv/directory/game/GTR%20Drift%20Simulator"}]},{"igdb_id":97105,"name":"GTI Club+: Rally Côte d'Azur","summary":"GTI Club+: Rally Côte d'Azur is the PlayStation 3 remake of the original GTI Club released in 1996.","genres":["Racing"],"developers":["Sumo Digital"],"publishers":["Konami"],"aggregated_rating":null,"release_date":1228348800,"platforms":["PlayStation 3"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co25jq.jpg","external_ids":[]},{"igdb_id":100902,"name":"GTR Traffic Rivals","summary":"Infinity arcade racing! How long can you hold out?","genres":["Racing"],"developers":["Azur Interactive Games Limited"],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["Android"],"cover_url":null,"external_ids":[]},{"igdb_id":108221,"name":"GT Drift: Max Race Car","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":121176,"name":"GTA: La Heist","summary":"A fan game with the motif of GTA.","genres":["Shooter","Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6mgh.jpg","external_ids":[]},{"igdb_id":134818,"name":"GTTOD: Get to the Orange Door","summary":"GTTOD is a fast paced FPS rogue-like with a heavy focus on fluidity of movement and high octane combat. Casting its net of inspirations wide, GTTOD captures both the feel of modern day movement shooters as well as the chaotic intensity of the best FPS games in the '90s.","genres":["Shooter","Adventure","Indie","Arcade"],"developers":["Andrew Smith"],"publishers":["Hitcents"],"aggregated_rating":null,"release_date":1559174400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co29py.jpg","external_ids":[{"category":null,"store":"store_None","uid":"2244","url":"https://api.utomik.com/v1/applications/2244"},{"category":null,"store":"store_None","uid":"1775694272","url":"https://www.gog.com/en/game/gttod_get_to_the_orange_door"},{"category":null,"store":"store_None","uid":"541200","url":"https://store.steampowered.com/app/541200"},{"category":null,"store":"store_None","uid":"62349","url":"https://www.giantbomb.com/games/3030-62349/"},{"category":null,"store":"store_None","uid":"2096608940","url":"https://www.twitch.tv/directory/game/GTTOD:%20Get%20to%20the%20Orange%20Door"}]},{"igdb_id":141611,"name":"GT and the Evil Factory","summary":"GT and the Evil Factory takes place in a factory where robots are enslaved by the cruel Lord Foreman to monotonous and grueling tasks. One day, a robot named GT decides its about time to start a revolution and destroy the wicked establishment of robotic slavery.","genres":["Arcade"],"developers":["Runouw"],"publishers":[],"aggregated_rating":null,"release_date":1250294400,"platforms":["Web browser"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3z5h.jpg","external_ids":[{"category":14,"store":"playstation","uid":"554062064","url":"https://www.twitch.tv/directory/game/GT and the Evil Factory"}]},{"igdb_id":197317,"name":"GT Manager","summary":"Manage your team from the pit wall to learn and master the art of racing.\nScout sponsors and drivers, invest in your factory to research and build performance parts.\n\nScore championship points and climb rankings to move up Leagues.\nNo driving skills are required, instruct your drivers from the pit!\n\nCollect official Porsche, Mercedes, McLaren, Nissan, Audi, Corvette and other manufacturer cars, earn championship points to progress through the leagues, improve the performance of your cars, the statistics of your drivers and many more.\n\nRace on 16 different tracks in Sprint, Endurance, Daily and Seasonal races, adapt your strategy to tracks and racing days conditions.\n\nReady to manage your team? Download GT Manager now!","genres":["Racing","Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4no0.jpg","external_ids":[]},{"igdb_id":203646,"name":"gToons","summary":"gToons was an online card battle game available on the Cartoon Orbit website. The cards were themed after Cartoon Network shows and the game received five expansion packs. After a duration of lapsed management, Cartoon Orbit shut down, taking gToons down with it.","genres":["Strategy","Card & Board Game"],"developers":[],"publishers":["Cartoon Network"],"aggregated_rating":null,"release_date":1034553600,"platforms":["Web browser"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4tw7.jpg","external_ids":[{"category":14,"store":"playstation","uid":"1150130564","url":"https://www.twitch.tv/directory/game/gToons"}]},{"igdb_id":204699,"name":"GT New Horizons","summary":"You are looking at a big progressive kitchensink pack for Minecraft 1.7.10 balanced around the mod GregTech.\nOver 3 years of developement (and still going) have formed a balance and refinement that only a handful of packs can keep up with. We are talking about thousands of recipe tweaks, a massive questbook with custom reward system, unique world generation, custom mods coded for the pack, custom Thauminomicon pages, and many more.\n\nThe main intentions of the pack are a long lasting experience and tying mods together in a progressive fashion, making it feel more like a single game than a compilation of mods thrown together.\nTo reach this goal GT New Horizons is using the tiers (basically ages of technology) from GregTech and allocates content of other mods to a fitting point within the progression.\nStarting in the stone age you will barely be able to survive until you get your first steam machines and eventually reach electricity. Later on you will have to visit other planets and dimensions to gather important ressources and fight mighty bosses to channel their magical power.\n\nIf you are fan of expert mode packs and want to take it to the next level this pack will be your friend!","genres":["Simulator","Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1476921600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4v5h.jpg","external_ids":[]},{"igdb_id":207528,"name":"GTTOD: Lost in Reflection","summary":"Lost in Reflection is the free new GTTOD prologue featuring brand new, exclusive content and the same intense FPS action. Learn where you came from, how you ended up in the chasm, and why all those chads gotta be thwacked.","genres":["Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5dw3.jpg","external_ids":[]},{"igdb_id":210726,"name":"GT 24","summary":null,"genres":["Racing"],"developers":["Natsume Inc."],"publishers":[],"aggregated_rating":null,"release_date":896313600,"platforms":["Sega Saturn"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6df5.jpg","external_ids":[{"category":14,"store":"playstation","uid":"1768339776","url":"https://www.twitch.tv/directory/game/GT%2024"}]},{"igdb_id":232412,"name":"GT-R Touring","summary":"GT-R Touring is an arcade racing game featuring 36 cars, 28 circuits and head-to-head splitscreen multiplayer.\n\nDeveloped by Kuju Entertainment and published by Midas Interactive Entertainment, released in Europe in 2006.","genres":["Racing","Arcade"],"developers":["Kuju Entertainment"],"publishers":["Midas Interactive Entertainment"],"aggregated_rating":null,"release_date":1160524800,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co60xe.jpg","external_ids":[{"category":null,"store":"store_None","uid":"1039108424","url":"https://www.twitch.tv/directory/game/GT-R%20Touring"}]},{"igdb_id":233749,"name":"GT Ride","summary":"The Kia pro_cee'd GT presents GT RIDE. The racing app like no other.\nCreate tracks by moving your mobile device through the air. Race them and challenge your friends!\nTo create unique tracks of your own download the GT RIDE app to your smartphone or tablet. Start creating tracks by simply moving your mobile device around through the air. The in-built sensors will track your movements and turn them into 3D tracks with curves and loops that you'll never have experienced before!\nFind out who's more skilled at racing – you or your friends?\nShare your tracks and challenge them. Race theirs to break their record and get ahead of them in the highscore.","genres":["Racing"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[{"category":14,"store":"playstation","uid":"742076329","url":"https://www.twitch.tv/directory/game/GT%20Ride"}]},{"igdb_id":241496,"name":"G-Type","summary":"G-Type is a freeware shooter game created by CnC Darkside for Windows 9x. It is a fusion of R-Type and Gradius with a little Darius thrown in.","genres":["Shooter","Arcade"],"developers":["CnC Darkside"],"publishers":["CnC Darkside"],"aggregated_rating":null,"release_date":1041292800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7dfd.jpg","external_ids":[]},{"igdb_id":254184,"name":"Gt-r Car Simulator","summary":null,"genres":["Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":271259,"name":"GTRevival","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]},{"igdb_id":277872,"name":"GTA Turk City","summary":"GTA Turk City (also known as GTA Türk) is a mod of GTA Vice City","genres":["Shooter","Adventure","Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1116028800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co92ww.jpg","external_ids":[]},{"igdb_id":279648,"name":"GTFO: The Final Chapter","summary":"Bringing the story of the four prisoners to an end in the most GTFO way possible. This time is different/same. The right/wrong place with the wrong/right people. How low/high will you/they go before you start/stop following orders? This is the end/beginning.","genres":["Shooter"],"developers":["10 Chambers Collective"],"publishers":["10 Chambers Collective"],"aggregated_rating":null,"release_date":1701907200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7has.jpg","external_ids":[]},{"igdb_id":283598,"name":"GT Manager","summary":"Take charge as the ultimate racing manager, leading your GT racing team to victory. Build your team, improve your car, and deploy winning race strategies across 5 official GT leagues, including the pinnacle of endurance racing: the hypercar category! Are you ready to dominate the world of GT racing?","genres":["Racing","Simulator","Sport","Strategy"],"developers":["The Tiny Digital Factory"],"publishers":["The Tiny Digital Factory"],"aggregated_rating":null,"release_date":1748822400,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co89nx.jpg","external_ids":[{"category":null,"store":"store_None","uid":"1026795551","url":"https://www.twitch.tv/directory/game/GT%20Manager"},{"category":null,"store":"store_None","uid":"2457030","url":"https://store.steampowered.com/app/2457030"},{"category":null,"store":"store_None","uid":"1401244717","url":"https://www.gog.com/en/game/gt_manager"}]},{"igdb_id":285486,"name":"GTH 3033: Grand Theft Hunter 3033","summary":"Top down shooter game. About a robot monster hunter.","genres":["Racing","Role-playing (RPG)","Simulator","Sport","Strategy","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1704240000,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7q3d.jpg","external_ids":[{"category":null,"store":"store_None","uid":"2703270","url":"https://store.steampowered.com/app/2703270"},{"category":null,"store":"store_None","uid":"1509830277","url":"https://www.twitch.tv/directory/game/GTH%203033:%20Grand%20Theft%20Hunter%203033"}]},{"igdb_id":295856,"name":"GT and the Evil Factory","summary":"Discover the Evil Factory’s secrets and fight for the freedom and dignity of robot-kind. Explore the factory, inside and out, dodge security drones, and stop the robot foreman’s evil plans.","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co81cl.jpg","external_ids":[]},{"igdb_id":300459,"name":"GT Racers","summary":null,"genres":["Racing"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1154044800,"platforms":["Game Boy Advance"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co86bn.jpg","external_ids":[]},{"igdb_id":309592,"name":"GTA Long Night","summary":"GTA: Long Night is an arcade horror modification for Vice City, developed by The Fighting Hellfish. After over a year of development, this mod transforms the familiar setting of Vice City into a city besieged by hordes of the undead. The storyline focuses on multiple survivors making their way to the last human stronghold, sharing tales of zombie chaos through over twenty original missions and cutscenes. The mod features new radio stations, particle effects, animations, and more than half a dozen playable characters.","genres":["Shooter","Adventure","Arcade"],"developers":["The Fighting Hellfish"],"publishers":[],"aggregated_rating":null,"release_date":1120867200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8jt7.jpg","external_ids":[]},{"igdb_id":322025,"name":"GtaGuessr","summary":"Gtaguessr - Like geoguessr but in GTA. Based in the world of Los Santos figure out where Franklin is taking selfies in Grand Theft Auto 5's world.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["Web browser"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co91fl.jpg","external_ids":[{"category":null,"store":"store_None","uid":"43109191","url":"https://www.twitch.tv/directory/game/GTAGuessr"}]},{"igdb_id":349123,"name":"GTL Schedule","summary":"In a post-apocalyptic world where food has become contraband and hope is on the brink of extinction, you quietly ignite a revolution to warm the world with a spatula and love.","genres":["Role-playing (RPG)","Simulator","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1790726400,"platforms":["Linux","PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9z00.jpg","external_ids":[]},{"igdb_id":367228,"name":"GTR: Garage Town Racing","summary":"Build, Manage, and Race in the World of GTR - Garage Town Racing\n\nTake the wheel and control your own garage in GTR - Garage Town Racing, where you’re more than just a driver! This management and racing game lets you customize and enhance every detail of your workshop and cars. Collect exclusive vehicles, build models from scratch, and challenge friends in thrilling PvP races!\n\nGTR - Garage Town Racing combines the adrenaline of racing with management strategy, offering players the chance to transform a small garage into the biggest hub in a city full of automotive enthusiasts.","genres":["Racing","Simulator"],"developers":["Messier Games"],"publishers":[],"aggregated_rating":null,"release_date":1749686400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coagws.jpg","external_ids":[{"category":null,"store":"store_None","uid":"3034980","url":"https://store.steampowered.com/app/3034980"},{"category":null,"store":"store_None","uid":"1516970843","url":"https://www.twitch.tv/directory/game/GTR:%20Garage%20Town%20Racing"}]},{"igdb_id":371885,"name":"GT Racing 1980","summary":"Take a journey back to the 80's and race some of the greatest cars ever made, in a retro arcade style racing experience. Race against some of the most iconic racers, build rivalries and unlock special rewards.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1732492800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coamqo.jpg","external_ids":[]}]