[{"igdb_id":6188,"name":"H1Z1","summary":"Offering a total sandbox experience, H1Z1 is a zombie survival MMO set in a post-apocalyptic world where thousands of players must strategically align with friends and against enemies in order to survive the worldwide infection.\n\nDaybreak Games announced in early 2016 that H1Z1 has been split into two games: H1Z1: King of the Kill & H1Z1: Just Survive.","genres":["Shooter","Adventure"],"developers":["Sony Online Entertainment"],"publishers":["Sony Online Entertainment"],"aggregated_rating":65.0,"release_date":1421280000,"platforms":["PlayStation 4","PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/dbbk2orfn55d5xnd6yxo.jpg","external_ids":[]},{"igdb_id":223562,"name":"H1.Jack","summary":"Start from the very bottom and spend your money and fame in gaining new techniques and exploits to fight the increasingly stronger enemies. Stories and skill sets are inspired by real life events. Heartbleed or Shellshock won’t be enough!","genres":["Adventure","Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1666224000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5q2k.jpg","external_ids":[]},{"igdb_id":313565,"name":"H1-Mod","summary":"H1-Mod is a modded client for Call of Duty: Modern Warfare Remastered. This client aims to provide a better-than-vanilla experience, with many quality-of-life features which are designed with gameplay enhancements in mind. The original game on Steam did not have a huge player base and is considered a forgotten Call of Duty. Also, the original game has so many game-breaking features that it is hard to play the original experience without facing a issue every so often.\n\nWith H1-Mod, new features include, but are not limited to: unlocked field of view adjustment, HUD safe area adjustment, detailed sensitivity adjustment, multiple fullbright modes, disabling of broken shader caching, unlocking all cosmetics, stat changing, uncapped max FPS, and a dedicated server browser.","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1656028800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8oi1.jpg","external_ids":[]}]