[{"igdb_id":262403,"name":"H2O: High speed Boat Racing","summary":"Get ready to race the waves in H2O, a thrilling new genre of watercraft racing games! Immerse yourself in the realistic, high-speed world of aquatic racing, complete with meticulously designed physics and dynamics to simulate the real-life feel of water navigation.\n\nJump into your virtual watercraft and feel the adrenaline rush as you zoom across lakes, rivers, oceans, and even fantastical settings like futuristic water cities. Whether you're a fan of boats, jet skis, or other aquatic vehicles, H2O has something for everyone.\n\nJoin the exhilarating world of H2O today. Embrace the thrill of high-speed racing combined with the unique challenges of water navigation.\n\nIt's time to make a splash with H2O: High-Speed Water Racing Game!!","genres":["Racing","Sport"],"developers":["Fabwelt Studios"],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["Android","PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6yva.jpg","external_ids":[]},{"igdb_id":228036,"name":"H2H-Xmas","summary":"H2H-Xmas is a Christmas-themed megawad for Doom II that was released in December 1995. The PWAD includes new music track which are based on Christmas songs, as well as many new graphics which have Christmas themes, and a new HUD. H2H-Xmas was included in the list of the top ten 1995 WADs in Doomworld's Top 100 WADs of All Time feature. It is the sequel to Xmas Doom, a small 1994 Christmas-themed minisode.","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":817776000,"platforms":["PC (Microsoft Windows)","DOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5uhc.jpg","external_ids":[]},{"igdb_id":92411,"name":"H2Overdrive","summary":"H2Overdrive delivers stunning “in-your-face” Next-Gen graphics with its 42” Hi-Def LCD panel. Players are directly immersed in action with force feedback steering, a beefed-up throttle and a powerful seat subwoofer. There are plenty of jumps and secret paths to explore while cruising 7 watery tracks from around the world. Choose from 9 different powerful boats and collect boosters and super boosters to enhance performance. H2Overdrive promotes replay and higher earning capacity with the option to create profiles and save players’ accomplishments for future play. H2Overdrive is powered by a Dell Computer with a 1-year warranty, and can link up to 8 cabinets for the ultimate tournament experience!","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1262217600,"platforms":["Arcade"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4a4q.jpg","external_ids":[]},{"igdb_id":72719,"name":"H2O: Footprints in the Sand","summary":"H2O's story revolves around Takuma Hirose, a blind young male junior-high school student, though the cause for his blindness is undetermined. After his mother died an unexpected death, it left a deep emotional scar on him, which caused him to become very lonely and reserved. Due to this, Takuma and his uncle move from the city out into a rural area and Takuma is enrolled into a new junior-high school. At his new school, he meets several new girls, though three of whom he gets to know the most out of anyone else. They are, the firm and obstinate Hayami Kohinata, the kind and obliging Hinata Kagura, and the cheerful and mysterious Otoha. As Takuma interacts with these girls, his medical condition gradually begins to heal.","genres":["Visual Novel"],"developers":["Makura"],"publishers":["Regista","Makura"],"aggregated_rating":null,"release_date":1151020800,"platforms":["PC (Microsoft Windows)","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7225.jpg","external_ids":[]},{"igdb_id":299541,"name":"H2O Root After and Another Complete Story Edition","summary":"Bundle of H2O: Footprints in the Sand and Root After and Another, for the complete experience in just one game.","genres":["Visual Novel"],"developers":["Makura"],"publishers":["Makura"],"aggregated_rating":null,"release_date":1248998400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co851s.jpg","external_ids":[]},{"igdb_id":14473,"name":"H2O: A Diabolic Game","summary":"A puzzle game in which the player must manipulate and destroy an environment to allow as many pixelated droplets of water to flow to a given point as possible.","genres":["Puzzle"],"developers":["Webfoot Technologies"],"publishers":["Webfoot Technologies"],"aggregated_rating":null,"release_date":851990400,"platforms":["DOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4v3r.jpg","external_ids":[]},{"igdb_id":313561,"name":"H2 Multiplayer Mod","summary":"H2 Multiplayer Mod was a mod for Call of Duty: Modern Warfare Remastered (H1) that aimed to recreate the original Modern Warfare 2 Multiplayer experience with new twists. The mod featured a wide variety of maps, new progression, unique camos, remastered weapons, custom attachments, and more. The original MW2 killstreaks made a return as well, completely changing the way Modern Warfare Remastered feels and plays.\n\nOn August 15th, 2024, just one day before the mod was set to release, Activision Publishing, Inc. sent a cease-and-desist letter to the members of the H2M-Mod team, effectively rendering the mod defunct. While the mod team ceased all activity on the project, a playtester leaked a build of the mod, making it available to the public.","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8ohw.jpg","external_ids":[]},{"igdb_id":99114,"name":"H2O","summary":"When a Mage who has powers over water, transported from a different era, comes into our nowadays world, he meets real challenge in form of a water rationing system from a modern city.","genres":["Visual Novel"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1430092800,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]}]