[{"igdb_id":133083,"name":"Hnefatafl","summary":"Hnefatafl is an ancient Scandinavian board game whose variants were played all over medieval Europe before chess was even invented. In those so called Tafl games two different sized armies fight each other. The invading black army tries to capture the white king, while the defending white army tries to protect their king and help him escape. \n \nOften also called the Game of the Vikings Hnefatafl tells many stories, like the Moskowites invasion of Sweden or the Viking hordes pillaging Britain. But no matter what the story is one thing always stays the same: The hunt for the king. \n \nEven though the rules aren't complicated the game offers fascinating strategies and rewards tactical play. Try to surround the enemy pieces, plan ahead, lay traps and force your opponent into surrender. Will you capture the king for gold and glory? Can the loyal guards hold back the invading forces and secure the flight of their king? \n \nYou can even create your own custom variants -- with over 200,000 different variants possible -- for online or offline play!","genres":["Strategy","Indie","Card & Board Game"],"developers":["Philippe Schober"],"publishers":["Philippe Schober"],"aggregated_rating":null,"release_date":1456876800,"platforms":["Linux","Android","PC (Microsoft Windows)","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2hr5.jpg","external_ids":[]},{"igdb_id":291399,"name":"Hnefatafl Online","summary":"Reviving an Ancient Board Game Cherished by Vikings a Millennium Ago - Now Available for Local and Real-Time Online Multi-Platform Competition! Dive into a Game of Deep Strategy and Online Battles.","genres":["Simulator","Strategy","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1750896000,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7w7q.jpg","external_ids":[{"category":null,"store":"store_None","uid":"2881280","url":"https://store.steampowered.com/app/2881280"},{"category":14,"store":"playstation","uid":"587055642","url":"https://www.twitch.tv/directory/game/Hnefatafl%20Online"}]}]