[{"igdb_id":148083,"name":"0 Degrees","summary":"A snow-covered wonderland of platforming action awaits in 0 Degrees, a chill puzzle experience for players of any age or skill level! Take control of a bundled-up pixel art climber as they make their way across icefields, up frosted peaks, through dark caves and over treacherous pitfalls! Help them survive mysterious hazards and overcome brain-teasing obstacles that span 40 unique levels.","genres":["Platform","Puzzle"],"developers":["Eastasiasoft","Nerd Games","Kiddo Dev"],"publishers":["Eastasiasoft"],"aggregated_rating":null,"release_date":1621296000,"platforms":["PlayStation 4","PlayStation 5","Xbox One","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co30kc.jpg","external_ids":[]},{"igdb_id":6173,"name":"0D Beat Drop","summary":"0-D Beat Drop is a 2009 rhythm-puzzle video game developed by Cyclone Zero and published by Aksys Games and Arc System Works. With elements of Puyo Puyo and Lumines, the game has players organizing colored shapes onto a playing field in order to match three pieces and clear them using the game's titular Beat Drop, which requires the player to listen to the techno soundtrack.","genres":["Music","Puzzle","Arcade"],"developers":["Cyclone Zero"],"publishers":["Arc System Works"],"aggregated_rating":73.0,"release_date":1257897600,"platforms":["Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/tgixvlkngjp3fmwxnnqd.jpg","external_ids":[]},{"igdb_id":30555,"name":"0 Day","summary":"Fight for control of the city against terrorists, the infected, and more! Use your jet pack, touch pad, or teleport and kill them all! Help shape the game and give us feedback in the early stages of development as the game evolves.","genres":["Strategy","Adventure","Indie"],"developers":["Zero Day Games"],"publishers":["Zero Day Games"],"aggregated_rating":null,"release_date":1479168000,"platforms":["SteamVR"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/f0xfbmmkayzjcqpo1nou.jpg","external_ids":[]},{"igdb_id":6172,"name":"0 Day Attack on Earth","summary":"Earth is under attack by massive creatures from outer space. With a huge arsenal of heavy-power artillery at your disposal, climb into your fighter jet and wage fierce battles against these gruesome aggressors. 0 Day Attack on Earth gives you full range of motion and attack while you engage in air strikes over real-world cities, such as Tokyo, New York and Paris. Team up with, or battle against players from around the world in online co-op. Only you can save Earth from complete annihilation.","genres":["Shooter"],"developers":["GULTI Co., Ltd."],"publishers":["Square Enix"],"aggregated_rating":null,"release_date":1261526400,"platforms":["Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/juuj4pmqpxyhl51fj7gv.jpg","external_ids":[]}]