[{"igdb_id":334940,"name":"1.96.9 All Update","summary":"The game is simple to play, with players using the mouse to search for hidden NPCs. The game allows players to save while playing, and there is no \"game over\" for players, making it easy to play. Some NPCs like to hide, so we recommend exploring the map thoroughly.","genres":["Simulator","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1736035200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9ilx.jpg","external_ids":[]},{"igdb_id":28642,"name":"1914: Prelude to Chaos","summary":"Enter the year 1914, which will mark the beginning of the Great War. This Indie adventure RPG will show you the glory of dying empires, death, despair and chaos that hasshaken the world and finally put an end to the ancient European monarchies.","genres":["Role-playing (RPG)","Adventure"],"developers":["Amaterasu Software"],"publishers":["Amaterasu Software"],"aggregated_rating":null,"release_date":1494201600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co28aq.jpg","external_ids":[]},{"igdb_id":367492,"name":"1999 Christmas Eve","summary":"A freeware sound novel created in the Kirikiri engine about a couple whose car breaks down on Christmas Eve night after they heard strange voices coming from the radio, forcing them to take refuge in a nearby church.","genres":["Visual Novel"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":977875200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coagyh.jpg","external_ids":[]},{"igdb_id":101450,"name":"1943 Deadly Desert","summary":"North Africa 1943. Lead your forces to victory in the most intense WW2 battle!","genres":["Strategy","Indie"],"developers":["HandyGames"],"publishers":["HandyGames"],"aggregated_rating":null,"release_date":1481068800,"platforms":["Android","PC (Microsoft Windows)","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co26wr.jpg","external_ids":[]},{"igdb_id":120395,"name":"1912 Titanic Mystery","summary":"A thrilling Hidden Object Adventure on board of the most famous ship in the world! A bomb was hidden aboard the Titanic II, a replica of the famous cruise ship! You are the sole person who can find the bomb and save the passengers.","genres":["Puzzle","Adventure"],"developers":["Mad Data","Ocean Media"],"publishers":["HH-Games","Ocean Media"],"aggregated_rating":null,"release_date":1563321600,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3kqx.jpg","external_ids":[]},{"igdb_id":151197,"name":"1917: The Prologue","summary":"1917: The Prologue is a psychological horror game with elements of an escape room. All events in the game are occuring during the October Revolution in 1917 in Russia. The game is based on memories of those who survived in this dark time.","genres":["Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1604620800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3kqy.jpg","external_ids":[]},{"igdb_id":376924,"name":"1964 Operation Velvet Twins","summary":"A retro-style action-platformer that blends the stealth shootouts of Rolling Thunder with the raw brawling of Double Dragon. The result? A thrilling 2D spy adventure set in the 1960s — packed with fists, bullets, and classic arcade energy!!","genres":["Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1770595200,"platforms":["Linux","PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coato9.jpg","external_ids":[]},{"igdb_id":6076,"name":"1943: The Battle of Midway","summary":"The game is set in the Pacific theater of World War II, off the coast of the Midway Atoll. The goal is to attack the Japanese Air Fleet that bombed the players' American Aircraft Carrier, pursue all Japanese Air and Sea forces, fly through the 16 levels of play, make their way to the Japanese battleship Yamato and destroy her. 11 Levels consist of an Air-to-Sea battle (with a huge battleship or an aircraft carrier as an End-Level Boss), while 5 levels consist of an all-aerial battle against a squadron of Japanese Bombers and a Mother Bomber that needs to be destroyed.\n\nAs in 1942, players pilot a P-38. Two buttons are used: one for regular attacks (with several weapons) and one for special actions that executes either a loop like in 1942 or one of three special attacks that damage the plane. Unlike 1942, the player only has one life, with one refillable energy meter. Destroying a complete formation of red enemy planes will result in a power-up, such as a health boost or a temporary special weapons which replaces the default twin gun.","genres":["Shooter","Arcade"],"developers":["Capcom"],"publishers":["GO!","Capcom"],"aggregated_rating":null,"release_date":549504000,"platforms":["Arcade","Commodore C64/128/MAX","ZX Spectrum","Atari ST/STE","Amiga","Amstrad CPC"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2oz6.jpg","external_ids":[]},{"igdb_id":148608,"name":"1980","summary":"Welcome to the 1980s! This is a city which just started to develop, and you're in charge of this small urban village. How will the city's future be tied to this place? Manage your land, construct new buildings, explore the stories, and find out the ultimate fate of this urban village!","genres":["Strategy","Indie"],"developers":["Merxon22"],"publishers":["Merxon22"],"aggregated_rating":null,"release_date":1598832000,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3kr0.jpg","external_ids":[]},{"igdb_id":22428,"name":"1991 Du Ma Racing","summary":"1991 Du Ma Racing is an unlicensed horse racing game for the NES that was developed by Idea-Tek and published by Super Mega. The game offers two game modes.\n\nIn race mode, two players can compete in a race. By pressing a button at the right time, they can build up their horse's power, then press another button to release it and give their horse an edge in the race. The player who does this faster and more accurately will have a better chance of winning the race.\n\nIn gamble mode, 1 to 6 players start out with 500 credits to place bets on 5 horses. The race will be simulated without any player interaction, and at the end of each race event players will get their respective prize money. The goal is to earn more money this way than any other player.","genres":["Puzzle","Racing","Sport","Adventure"],"developers":["Idea-Tek"],"publishers":["Super Mega"],"aggregated_rating":null,"release_date":694137600,"platforms":["Family Computer"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6nrp.jpg","external_ids":[]},{"igdb_id":168708,"name":"1976: Back to Midway","summary":"Are you ready to travel back in time to 1943 and relive the excitement of classic arcade dogfights? Now, thanks to Virtual Reality, you’re about to discover a new level of immersion and spectacularity, while retaining the original essence and fun.","genres":["Simulator","Indie","Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1607558400,"platforms":["PlayStation VR","PC (Microsoft Windows)","SteamVR"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5caq.jpg","external_ids":[]},{"igdb_id":61500,"name":"1945 I & II: The Arcade Games","summary":"The first two Striker 1945 games are compiled onto one PlayStation 2 collection.","genres":[],"developers":[],"publishers":["Play It Games"],"aggregated_rating":null,"release_date":1089936000,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/n51fhev5gqk1nxoest4g.jpg","external_ids":[]},{"igdb_id":14360,"name":"1979 Revolution: Black Friday","summary":"1979 Revolution, the action/adventure game, immerses players into the gritty, euphoric streets of revolution – where the choices you make may betray you. Set in the actual events of 1979 Iran.\n\n1979 Revolution’s story is told through the main character Reza, a young photojournalist in Tehran, during the electrifying early days of the revolution in 1978. Without political or religious motivation, Reza begins his heart of darkness journey into social upheaval. Surrounded by a group of impassioned key figures involved in overthrowing the regime – Reza’s engagement becomes a high stakes chess match of decision making – whereby everything is at risk.","genres":["Adventure","Indie"],"developers":["N-Fusion Interactive","iNK Stories"],"publishers":["Digerati Distribution","iNK Stories"],"aggregated_rating":70.75,"release_date":1459728000,"platforms":["PlayStation 4","Android","PC (Microsoft Windows)","iOS","Mac","Xbox One","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2839.jpg","external_ids":[]},{"igdb_id":337613,"name":"19th Century Printing Press Experience VR","summary":"A hands-on educational experience that guides you through the process of printing on a 19th-century printing press.","genres":["Simulator","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1739923200,"platforms":["SteamVR"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9lpo.jpg","external_ids":[]},{"igdb_id":19390,"name":"1993 Space Machine","summary":"Space shooters never die. 1993 is a testament to that. 1993 is a classic shoot em up celebrating games like Gradius, R-Type and Life Force.","genres":["Shooter","Indie"],"developers":["Limit Break"],"publishers":["Limit Break"],"aggregated_rating":null,"release_date":1459123200,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3kr2.jpg","external_ids":[]},{"igdb_id":35602,"name":"199X","summary":"In 199X, you control Clara. That's the problem.","genres":["Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1425945600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6a1n.jpg","external_ids":[]},{"igdb_id":110705,"name":"1943 Berlin Blitz","summary":"Join a Lancaster bomber crew during a raid over Berlin in World War Two.","genres":["Indie"],"developers":["BBC Media Applications Technologies Limited"],"publishers":["BBC Media Applications Technologies Limited"],"aggregated_rating":null,"release_date":1538524800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3dc7.jpg","external_ids":[]},{"igdb_id":48607,"name":"1999: Hore, Mita Koto ka! Seikimatsu","summary":"1999: Hore, Mita Koto ka! Seikimatsu is a Family Computer video game that takes place in the late twentieth century right up through the year 1999.\n\nThis game is similar to a crossover between Monopoly and The Game of Life. Aliens arrive to tell the players to live their lives to the fullest before it's too late because of some event that will occur at the end of 1999.Cards are used instead of dice and the players might be involved in automobile accidents, jobs, investing in the stock market, falling in love with a woman, or a single round at the slot machines","genres":["Simulator","Strategy","Card & Board Game"],"developers":["Coconuts Japan"],"publishers":["Coconuts Japan"],"aggregated_rating":null,"release_date":716774400,"platforms":["Family Computer"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9382.jpg","external_ids":[]},{"igdb_id":83716,"name":"1984: A Game of Government Management","summary":"84: A Game of Government Management is a financial management game which gives you the chance to be the Chancellor of the Exchequer for the United Kingdom in the 1980s. Starting in 1984 with the real economy figures from 1982/83, you must try to survive in office for as long as possible trying to keep the books balanced and making more money for the country without upsetting too many people.\n\nYour first screen shows you the Government Balance Sheet with the figures balanced and over the next year you will attempt to keep it balanced. As you play over your first year you will be presented with various screens and these either show the stats for various sectors or ask you various questions about adjusting figures like the Minimum Lending Rate or the percentage in wage increases for various sectors. Other sectors or departments you will have to juggle the figures for include investments, Industrial Levy, funding, foreign aid and Industrial Grants. You will also have a cabinet meeting that asks you a question on various incidents that are happening at the time.\n\nOnce you have completed your first year, you will be shown various graphs and given a performance rating. Then it's on to 1985 and hopefully many years after that.","genres":["Simulator","Strategy"],"developers":[],"publishers":["Incentive Software"],"aggregated_rating":null,"release_date":465350400,"platforms":["BBC Microcomputer System","ZX Spectrum"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8g6t.jpg","external_ids":[]},{"igdb_id":247611,"name":"1984","summary":"1984 is a first-person survival adventure set in Orwell's timeless dystopia. As Winston Smith you must carefully plot your secret rebellion against Big Brother, while avoiding the suspicions of the Thought Police. Adaptation by the Narrative Designer of Subnautica, Talos Principle and FTL.","genres":["Simulator","Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6flt.jpg","external_ids":[]},{"igdb_id":135357,"name":"19XX: Tournament Edition","summary":"19XXTE (19XX Tournament Edition) is a ROM hack/mod of Super Smash Bros. (Nintendo 64). It is the first notable mod for the game, with development having started in May of 2015. 19XXTE is based on 20XX Tournament Edition; that is, the purpose of the mod is to assist in running tournaments, help players learn the game, and add other cosmetic changes instead of exclusively modifying characters or stages. 19XXTE has seen tournament use, being notably used at GENESIS 3 and Super Smash Con 2016; its most important feature is the ability to add a timer to a stock match like in later games, saving tournament organizers from the trouble of keeping track of match time externally.\n\nIt has a more complete version, 19XXCE (19XX Complete Edition), meant for more casual gameplay.","genres":["Fighting"],"developers":["Cyjorg"],"publishers":["Cyjorg"],"aggregated_rating":null,"release_date":1431216000,"platforms":["Nintendo 64"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3hci.jpg","external_ids":[]},{"igdb_id":323012,"name":"1989 After the War","summary":"An atomic war has reduced the world to a heap of ruins. However, there are still those who refuse to give up and seek to bring justice even in this chaos. Use your blade, granades and shotgun to fight your way through this post-apocalyptic scrolling action-platformer in pure 80s arcade style.","genres":["Shooter","Platform","Adventure","Indie","Arcade"],"developers":[],"publishers":["Ratalaika Games"],"aggregated_rating":null,"release_date":1738540800,"platforms":["PlayStation 4","Linux","PC (Microsoft Windows)","PlayStation 5","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co92pc.jpg","external_ids":[]},{"igdb_id":141731,"name":"1968","summary":"You are a boy whose mother has locked herself in her room. Talk to her.","genres":["Role-playing (RPG)","Adventure"],"developers":["Cuttlefresh"],"publishers":[],"aggregated_rating":null,"release_date":1597968000,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7qbd.jpg","external_ids":[]},{"igdb_id":136611,"name":"1999: Megallennium 6-in-1 Mega Cart","summary":"Megallennium 6-in-1 Mega Cart is a PC port of a lost NES multi-cart developed in 1989. Featured within are 6.5 brilliant and surreal games now available for the first time ever.\n\nDr. Moonlight's Happyworld: Fight for your life against vampire fairies and Frankenstein's monsters in the world's most bloodthirsty game show!\n\nOwlbears: All Pibi wants to do is eat apples. Instead he must shoot endless waves of oozers, gremlins, and (of course) owlbears in a desperate struggle for survival.\n\nPicOHRoss: Use computer-like logic to conquer fiendish puzzles! Can your soft human brain handle it? Probably not.\n\nXoo: Xeno Xafari: Enjoy a vacation on scenic Xoo Island. Wear super cute clothes! Hunt super cute aliens! Live a super cute life!\n\nUltra Frontier QQYYZZ: Explore psycho space with your family of clones while dodging obstacles at mach speeds. This game is basically impossible.\n\nStar Dartle 2000: Lord Shiptaur beckons you to destroy them all. This scrolling shooter challenges your reflexes and counting abilities.\n\nPlus other sweet surprises!","genres":["Arcade"],"developers":["Willy Elektrix"],"publishers":[],"aggregated_rating":null,"release_date":1496534400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ewk.jpg","external_ids":[]},{"igdb_id":332592,"name":"1917: The Alien Invasion DX Remastered","summary":"You are in the role of Dr. Brunhild Stahlmüller, an acomplished weapon scientist who upgrades a WW1 triplane with superior alien technology to attack the invaders. You will avenge mankind and take the battle into the darkness of space until you reach an ancient alien world.","genres":["Shooter","Indie","Arcade"],"developers":["Andrade Games"],"publishers":["Red Art Games"],"aggregated_rating":null,"release_date":1740700800,"platforms":["PlayStation 5"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9fn7.jpg","external_ids":[]},{"igdb_id":325294,"name":"198BREW: The Age of Orpheus","summary":"198X.\n\nLong after Adin's discovery. After the Night of the Comets. Sometime after she went away. Three days after you buried the cat.\n\nYou stand in your kitchen. And you find yourself out of coffee.\n\nStep into the blizzard. Go through this strange world of talking animals, immortals, fanatics, robots -- and find that shot of caffeine","genres":["Visual Novel"],"developers":["DWaM"],"publishers":["DWaM"],"aggregated_rating":null,"release_date":1725148800,"platforms":["Web browser"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co954x.jpg","external_ids":[]},{"igdb_id":379250,"name":"1999Tokoyo Building","summary":"1999. The protagonist, a boy named Akira, finds himself lost in the TOKOYO Building—an indoor amusement park filled with secrets and eerie rumors. There, he begins living and working alongside its peculiar staff, but... Did you know? People disappear in the TOKOYO Building.","genres":["Adventure","Indie"],"developers":[],"publishers":["KODANSHA"],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coawlu.jpg","external_ids":[]},{"igdb_id":376923,"name":"1960 e tal","summary":"A puzzle game and a coming-of-age story, told on the same day each year as António packs his bags for summer vacation. Overcome challenging packing puzzles, as this dream-chasing story unravels, in a time of poverty and hard work.","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":376922,"name":"1931-1945: Their Childhood - Tunnel Warfare","summary":"1931-1945,the chinese Tunnel Warfare. Customizable map WWII RTS simulation with player-designed tunnels, dynamic difficulty, and enemy AI. Base strategies and tech choices shape unique combat styles. Experience authentic WWII tactics, not fantasy.","genres":["Simulator","Strategy"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1758585600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coato6.jpg","external_ids":[]},{"igdb_id":359670,"name":"1992: Rasputie","summary":"Take a place of a politician in the post-Soviet space and immerse yourself in the struggle for power amid the ruins of the former empire. Your decisions will determine the path of the young state's development.","genres":["Role-playing (RPG)","Simulator","Strategy","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coa8dg.jpg","external_ids":[]},{"igdb_id":26150,"name":"1985: The Day After","summary":"1984: Escape from Big Brother is a space exploration game set in a post-totalitarian world. Players navigate a spacecraft through underground caverns on four planets, searching for energy pods left behind by the fallen regime. The game features precise rotational controls for maneuvering through tight spaces, and players must use their ship's tractor beam to collect the crucial energy pods. This challenging adventure combines elements of sci-fi and retrofuturism as humanity rebuilds after liberation from oppressive control.","genres":["Arcade"],"developers":["Severn Software"],"publishers":["Mastertronic"],"aggregated_rating":null,"release_date":504835200,"platforms":["Commodore C64/128/MAX","ZX Spectrum"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co91hz.jpg","external_ids":[]},{"igdb_id":124919,"name":"1971 Project Helios","summary":"1971 Project Heliosis a turn-based strategy game which combines modern warfare military tactics and close combat. Firearms and vehicles are scarce, conflicts and hostilities have no end, and the terrible freezing cold annihilates friends and foes in its path.","genres":["Role-playing (RPG)","Strategy","Turn-based strategy (TBS)","Indie"],"developers":["Recotechnology"],"publishers":["Recotechnology"],"aggregated_rating":null,"release_date":1591660800,"platforms":["PlayStation 4","PC (Microsoft Windows)","Xbox One","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co229g.jpg","external_ids":[]},{"igdb_id":32692,"name":"1917: The Alien Invasion DX","summary":"1917 - The Alien Invasions is a bullet hell memorization shooter. Dr. Brunhild Stahlmüller upgrades an WW1 Triplane with superior alien technology to attack the invaders. She will avenge mankind and take the battle into the darkness of space until she reach an ancient alien world.","genres":["Shooter","Indie","Arcade"],"developers":["Andrade Games"],"publishers":["OtakuMaker.com Studio","KORION"],"aggregated_rating":53.0,"release_date":1465516800,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1rzu.jpg","external_ids":[]},{"igdb_id":343429,"name":"1998: The Toll Keeper Story","summary":"A narrative simulation game where you play as a mother-to-be working as a toll keeper in the fictional country of Janapa, a nation on the brink of chaos. Navigate daily challenges and make difficult moral choices to survive—all for the sake of your unborn child.","genres":["Simulator","Indie"],"developers":["GameChanger Studio"],"publishers":[],"aggregated_rating":null,"release_date":1761609600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coaqxb.jpg","external_ids":[]},{"igdb_id":6077,"name":"1941: Counter Attack","summary":"The year: 1941. The place: 20,000 feet in the air over the North Atlantic. Lightning flashes across the skies of war-torn Europe. Your mission: beat back the imperial forces before they can use their new weapon!\n\nIn 1941: Counter Attack, the goal is to shoot down enemy airplanes and collect weapon power-ups. It is the prequel to 1942, and the third game in the 19XX series.","genres":["Shooter","Arcade"],"developers":["Capcom"],"publishers":["Hudson Soft","Capcom","Electrocoin"],"aggregated_rating":null,"release_date":633830400,"platforms":["Arcade","PC Engine SuperGrafx"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2kqr.jpg","external_ids":[]},{"igdb_id":325869,"name":"1-900-Gary","summary":"A short 'n' sweet adventure horror made for Asylum Gamejam 2013\n\n1-900-Gary from the rpgmaker.net archives","genres":["Role-playing (RPG)","Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1388448000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co95u0.jpg","external_ids":[]},{"igdb_id":376925,"name":"1985","summary":"1985 is a dystopian multiplayer social deduction game where players must complete tasks, collect money, and expose traitors hiding among them while also identifying the opposing organizations.","genres":["Strategy","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coatoa.jpg","external_ids":[]},{"igdb_id":6075,"name":"1942","summary":"1942 is a vertically scrolling shoot 'em up made by Capcom that was released for the arcade in 1984. The goal is to reach Tokyo and destroy the entire Japanese air fleet. The player pilots a plane dubbed the \"Super Ace\" . The player has to shoot down enemy planes; to avoid enemy fire, the player can perform a roll or \"loop-the-loop\". During the game the player may collect a series of power-ups, one of them allowing the plane to be escorted by two other smaller fighters in a Tip Tow formation.","genres":["Shooter","Arcade"],"developers":["Capcom"],"publishers":["Elite Systems","ASCII Corporation","Capcom"],"aggregated_rating":80.0,"release_date":470620800,"platforms":["Arcade","PC-8800 Series","PlayStation 3","Commodore C64/128/MAX","ZX Spectrum","Sharp X1","Wii","FM-7","Amstrad CPC","MSX"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1w4l.jpg","external_ids":[]},{"igdb_id":357750,"name":"1938","summary":"1938 \"is a turn based chess and simulation game with the theme of the War of Resistance Against Japan and the main storyline of the 129th Division of the Eighth Route Army advancing into the southern Hebei region to establish an anti Japanese base behind enemy lines.","genres":["Role-playing (RPG)","Simulator","Strategy","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":9771,"name":"1953: KGB Unleashed","summary":"“1953 – KGB Unleashed” is based on real projects conducted by the Ministry of State Security of the USSR (the former KGB). During that time they pushed the limits of human endurance, testing for the possibility of telepathy, as well as researching the psychological impact of fear on the human brain. The photo-realistic visual style of “1953 – KGB Unleashed” recreates the USSR of the fifties: the underground shelter’s interior is constructed using real Soviet military plans, and the materials found there are based on historically valid documents.\n\nExplore a hidden laboratory where such experiments were conducted in order to learn the truth behind the terrifying events that led to the closure of the project and the liquidation of its staff. An atmosphere of isolation and suspense pervades throughout, bringing you face to face with your own fears, while the voice of invisible “observer” broadcasts over the internal communications system. Is this observer a friend, or an enemy? Your exploration of this perfectly-preserved complex may uncover what these experiments unlocked deep within the human psyche — but will you survive these revelations intact?","genres":["Point-and-click","Adventure"],"developers":["Phantomery Interactive"],"publishers":["United Independent Entertainment GmbH","Libredia"],"aggregated_rating":null,"release_date":1267660800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/mneora4ugo9dm1azg5xj.jpg","external_ids":[]},{"igdb_id":207473,"name":"1997","summary":"Detective visual novel about mysteries of rural Russian town in 90-s, anime style.","genres":["Adventure","Indie"],"developers":["RUzura Interactive"],"publishers":[],"aggregated_rating":null,"release_date":1680134400,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5cas.jpg","external_ids":[]},{"igdb_id":259288,"name":"1989 QianShanMen","summary":"In a distant realm, there lies a mysterious and beautiful country known as the Winter Country. Currently, Winter Country is under the control of a political party called the \"Dongshan Party\"... And on Winter Calendar June 4th, 1989, an event unfolded at the QianShanMen Square...","genres":["Role-playing (RPG)","Strategy","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1690848000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6x4r.jpg","external_ids":[]},{"igdb_id":100562,"name":"198X","summary":"198X is not just a beat ’em up, a shoot ’em up, a racing game, a ninja game and an RPG. This is a love letter to the golden age of arcade games – yet with a scope that was never possible in the actual 1980s. It’s a story about finding yourself – and your self-confidence – in the world of video games. A coming-of-age story told through multiple game genres, worlds and characters. Feel the sensation of fighting, shooting, driving, jumping and role-playing – combined with emotional, cinematic storytelling.\n\nAnd what happens when the line between reality and game starts to blur…?","genres":["Shooter","Racing","Role-playing (RPG)","Hack and slash/Beat 'em up","Adventure","Indie","Arcade"],"developers":["Hi-Bit Studios"],"publishers":["Hi-Bit Studios","8-4"],"aggregated_rating":70.0,"release_date":1560988800,"platforms":["PlayStation 4","PC (Microsoft Windows)","Xbox One","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1m2h.jpg","external_ids":[]},{"igdb_id":7169,"name":"1954 Alcatraz","summary":"In this interactive Point & Click adventure by Daedalic Entertainment and Irresponsible Games - the team of Gene Mocsy - Joe and his wife Christine will be playable characters. Players will decide between love, treachery, life and death: will Christine assist Joe during his prison break? Will they recover the fortune together? Or will they succumb to greed? Will Christine deceive her husband, taking revenge for all the disappointments and a marriage that brought her nothing but hardship? Will she just turn her back on Joe and hit the road with his former accomplices? Or will Joe gain everything in the end?\n\n1954: Alcatraz offers all what makes a great adventure: challenging puzzles, a mature crime story with a dynamic plot and various possible outcomes, and a whole bunch of shady characters: brutal felons, making life on The Rock even harder for Joe, while outside not only his partners-in-crime but also snoops and cops are after the money and Christine. The cinematic San Francisco of the 1950s, caught in a gritty comic style is a harsh place. But it's also a place where 1954: Alcatraz can also pay homage to history and zeitgeist, in form of the Beatnik culture and other contemporary themes.\n\nKey Features\n\nTwo playable characters: the gangster couple Joe and Christine\nMore than 20 additional 3D animated characters\nMore than 60 hand drawn backdrops, based on original footage of San Francisco, North Beach and Alcatraz\nChallenging puzzles and exciting dialogues by Gene Mocsy, co-writer of Ghost Pirates of Vooju Island\nAtmospheric Beat and Jazz soundtrack by Pedro Macedo Camacho (Fairytale Fights, Ghost Pirates of Vooju Island, A Vampyre Story, Audiosurf)\nIn-game decisions extensively influence the plot and lead to various endings","genres":["Point-and-click","Adventure","Indie"],"developers":["Irresponsible Games","Daedalic Entertainment"],"publishers":["Daedalic Entertainment"],"aggregated_rating":60.0,"release_date":1394582400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3kqz.jpg","external_ids":[]},{"igdb_id":88622,"name":"1945 Air Strike Classic","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":205802,"name":"1912 Titanic w/ Neptunia","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co77nf.jpg","external_ids":[]},{"igdb_id":218334,"name":"1943: The Battle of Midway","summary":null,"genres":[],"developers":["Acclaim"],"publishers":["Acclaim"],"aggregated_rating":null,"release_date":631065600,"platforms":["Handheld Electronic LCD"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5b94.jpg","external_ids":[]},{"igdb_id":253249,"name":"1900","summary":"Fresh and unique numbers merged gameplay.\nNot only 1900, but more than 2048! Kidding...This is harder...Very more harder...\nCan you merge number bigger than 2048? Or bigger than 1900?Or bigger than 1010?\nNope...Merge number bigger than 190 can be genius in 1900!","genres":["Puzzle"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["Android"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9vyw.jpg","external_ids":[]},{"igdb_id":21346,"name":"1942: Joint Strike","summary":"1942: Joint Strike takes inspiration and influence from the 194X series of Capcom vertical shooters. The art, sound and gameplay give the players hints of the classic historical shoot-em-up franchise, but this entry stands out as its own entry in the franchise and utilizes a full 3D engine along the traditional 2D top-down perspective.\n\nThe action takes place during an alternate timeline of World War II. Locales, vehicles and weapons have the same look and feel of the classic battleships and planes, but the battles over the Pacific were never this hot or this insane -- your single fighter will turn the tides of history, but only if you survive!","genres":["Shooter"],"developers":["Backbone Entertainment"],"publishers":["Capcom"],"aggregated_rating":65.83333333333333,"release_date":1216771200,"platforms":["PlayStation 3","Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8yv5.jpg","external_ids":[]},{"igdb_id":2375,"name":"1994Pool+","summary":null,"genres":["Sport"],"developers":["Ninano Software"],"publishers":["Ninano Software"],"aggregated_rating":null,"release_date":788832000,"platforms":["DOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/up50wpbptw0tv35mfgjt.jpg","external_ids":[{"category":14,"store":null,"uid":"1518358858","url":"https://www.twitch.tv/directory/game/1994Pool%2B"}]},{"igdb_id":124213,"name":"1942: The Henan Famine","summary":null,"genres":["Strategy","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1570406400,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]},{"igdb_id":140088,"name":"19 Line","summary":"Horror visual novel made for inkJam 2020.","genres":["Indie","Visual Novel"],"developers":["Nico Saraintaris"],"publishers":["Nico Saraintaris"],"aggregated_rating":null,"release_date":1596412800,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2p0s.jpg","external_ids":[]},{"igdb_id":83108,"name":"1994 Locospotter","summary":null,"genres":["Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":788832000,"platforms":["ZX Spectrum"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/edoxbu4hnklpfqfwi5oh.jpg","external_ids":[]},{"igdb_id":38854,"name":"1990: Die 1993'er Edition","summary":"1990: Die 1993'er Edition is an expanded re-release of 1990. The changes are mostly technical, e.g. many drawn graphics were replaced with digitized photographs and there is in-game music. There are no significant changes regarding gameplay and user interface.","genres":["Strategy"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":750124800,"platforms":["Amiga"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/vu4x7zmrgmgnog94dtxz.jpg","external_ids":[]},{"igdb_id":223811,"name":"1940","summary":null,"genres":["Puzzle","Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1636588800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7g8r.jpg","external_ids":[]},{"igdb_id":42079,"name":"1943: Kai","summary":"Developed and released alongside the Family Computer version, 1943 Kai: Midway Kaisen is an arcade game, an \"alternate\" version of the original 1943, released in 1987[3] only in Japan. Most of the graphics and sounds have been reworked, and the game has been made more \"extreme\" (laser-firing WWII planes and ships that run on ground). Further, the trademark P-38 has been replaced with a Boeing Stearman E75 N68828.\n\nIn 1991, this version was converted to the PC Engine as simply 1943 Kai, again Japan-only; this version itself contains many additional levels and original music.\n\nThe game is set in the Pacific theater of World War II, off the coast of the Midway Atoll. The goal is to attack the Japanese air fleet that bombed the American aircraft carrier, pursue all Japanese air and sea forces, fly through the 16 stages of play, and make their way to the Japanese battleship Yamato and destroy her. 11 of these stages consist of an air-to-sea battle (with a huge battleship or an aircraft carrier as the stage boss), while 5 stages consist of an all-aerial battle against a squadron of Japanese bombers with a mother bomber at the end.\n\nAs in 1942, players pilot a P-38 Lightning. Controls are also similar: button 1 fires main weapons, and button two performs two special actions: a loop maneuver like in 1942, or one of three special attacks in exchange for some of the player's fuel. Indeed, players now have only one life, in the form of a large \"fuel\" meter; constantly depleting, but refillable by collecting various powerups (chiefly \"Pow\" icons). In 2-player mode, when both players overlap their planes on screen, the energy bar can be transferred from the player with more fuel to the player with less. Destroying a complete formation of red enemy planes will result in a power-up, such as a health boost or a new main weapon.\n\nThere are cheat codes, different for every stage, ranging from holding down a fire button or pointing the joystick in certain direction, player(s) are rewarded with fully upgraded weapons.","genres":["Shooter"],"developers":["Capcom"],"publishers":["Naxat Soft"],"aggregated_rating":null,"release_date":694137600,"platforms":["TurboGrafx-16/PC Engine"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6xc4.jpg","external_ids":[]},{"igdb_id":220562,"name":"1942 Mobile","summary":"Have you got what it takes to be a WW II fighter ace? 1942 will put your flying skills to the ultimate test! The Second World War: The tank of your airplane is filled up with kerosene and our machine guns are fully-loaded! But be careful: Your opponents are numerous and well armed. Sometimes a few loopings help in order to free yourself from a situation offering no other prospects. As reward after endured attack waves you will receive power ups, which boast your attack and defence capabilities. A classical and well known game that guarantees no boredom.","genres":["Shooter","Arcade"],"developers":[],"publishers":["Capcom"],"aggregated_rating":null,"release_date":1294531200,"platforms":["Android","Legacy Mobile Device"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co95y8.jpg","external_ids":[]},{"igdb_id":216296,"name":"195 Hours in the Cold","summary":"Your long journey through the icy wastes is finally at its end. You hope. Your eyes are heavy, but sleep does not come... there is a faint, distant memory of fire and bloodshed...\n\nPass through the empty, echoing halls to learn what has transpired in your long, long absence.\n\nMade for the Haunted PS1 Madvent Calendar 2020.","genres":["Adventure","Indie"],"developers":["BanzaiBonsai"],"publishers":["BanzaiBonsai"],"aggregated_rating":null,"release_date":1606262400,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]},{"igdb_id":36136,"name":"1931: Scheherazade at the Library of Pergamum","summary":"1931: Scheherazade at the Library of Pergamum is the latest story-driven RPG from Black Chicken Studios, inc., spinning tales of pulp adventure, exotic locations, occult horror, and romance that'll require well-honed skills.","genres":["Role-playing (RPG)","Simulator","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1427328000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co20s3.jpg","external_ids":[]},{"igdb_id":314699,"name":"1986 Scary Mr. Chainsaw Escape","summary":"Solve the puzzles & use the tools. Get away from Psychopath butcher. He is mad!","genres":["Puzzle","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1692835200,"platforms":["Android","PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9tsb.jpg","external_ids":[]},{"igdb_id":52359,"name":"1914 Shells of Fury","summary":"Set in WWI, “1914 Shells of Fury” is the first WWI submarine simulation to be released. Players have command of their very own WWI Submarine from the German Emperor’s fleet.\n\nPrepare to participate in exciting underwater missions from WWI, and work out detailed strategies using powerful weapons. Take command and control of the various missions given, while roaming across the ocean. Players must use tactical skills in order to survive and move ahead of the opponent.","genres":["Simulator"],"developers":[],"publishers":["Strategy First"],"aggregated_rating":null,"release_date":1187049600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/updffyqukdwnoxoeiqku.jpg","external_ids":[]},{"igdb_id":295238,"name":"1995Card+","summary":null,"genres":["Card & Board Game"],"developers":["Ninano Software"],"publishers":[],"aggregated_rating":null,"release_date":788832000,"platforms":["DOS"],"cover_url":null,"external_ids":[]},{"igdb_id":65553,"name":"1950s Lawn Mower Kids","summary":"Zordix takes you back to the '50s with 1950s Lawn Mower Kids.","genres":["Real Time Strategy (RTS)","Strategy"],"developers":[],"publishers":["Zordix"],"aggregated_rating":null,"release_date":1314835200,"platforms":["Nintendo DSi"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3zfi.jpg","external_ids":[]},{"igdb_id":256213,"name":"1948 Dawn of Future","summary":"It's 1948 and it's the dawn of a new era.\nThe two leading super powers started a top secret war to control alien technology found on earth.\nTechnology that if mastered will give human race a chance against a mysterious alien that threatens our freedom.","genres":["Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1353888000,"platforms":["iOS"],"cover_url":null,"external_ids":[]},{"igdb_id":300045,"name":"1942","summary":null,"genres":["Shooter"],"developers":["Capcom"],"publishers":["Capcom"],"aggregated_rating":null,"release_date":958953600,"platforms":["Game Boy Color"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co95y7.jpg","external_ids":[]},{"igdb_id":19749,"name":"1917: The Alien Invasion","summary":"You are in the role of Dr. Brunhield Stahlmüller, an accomplished weapon scientist who upgrades a WW1 triplane with superior alien technology to attack the invaders. You will avenge mankind and take the battle into the darkness of space until you reach an ancient alien world.","genres":["Shooter","Strategy","Adventure","Indie","Arcade"],"developers":["Andrade Games"],"publishers":["OtakuMaker.com Studio"],"aggregated_rating":null,"release_date":1465516800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/x8zkgzllwqskvxd561k5.jpg","external_ids":[]},{"igdb_id":187087,"name":"1930 Langman Tan","summary":"1930 Romance Tan\" is a female-oriented mobile game that combines \"historical elements\" & \"original plot\". In the game, the player will play the role of a college student who has accidentally traveled to 1930s Taipei city. In order to return home, the player must assist an amnesiac book spirit to retrieve memories until they can recall the coordinates to return home.","genres":["Visual Novel"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1586908800,"platforms":["Android"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4ckc.jpg","external_ids":[]},{"igdb_id":137172,"name":"1979: The Game","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":216434,"name":"1958: Dancing with Fear","summary":"\"Dancing with Fear\" (1958, directed by Víctor Ojuel). In this forgotten classic of Golden Age Hollywood, a vedette fallen on hard times (Salomé Vélez) finds herself enmeshed in a tangle of political intrigue, romance and betrayal in a Caribbean republic. Torn between her love for a smuggler, the lust of a corrupt policeman and the machinations of a Soviet intelligence operative, the protagonist navigates the dangers of a high-society party on the eve of revolution. As she tries to survive through that fateful night, the memories of her past will come to haunt her. Controversial at the time for its depiction of Cold War politics and morally ambiguous protagonist. (120 minutes, Technicolor, in-game hint system).","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1506816000,"platforms":["Web browser","Linux","PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5uvg.jpg","external_ids":[]},{"igdb_id":135358,"name":"19XX: Complete Edition","summary":"19XXCE (Complete Edition) is a casual version of 19XXTE (Tournament Edition) and is a Super Smash Bros. ROM hack/mod made for casual players, with more new features (like enhanced training mode) and stages not present in the vanilla Super Smash Bros.","genres":["Fighting"],"developers":["Cyjorg"],"publishers":["Cyjorg"],"aggregated_rating":null,"release_date":1535760000,"platforms":["Nintendo 64"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3hce.jpg","external_ids":[]},{"igdb_id":67896,"name":"1944 D-Day","summary":"1944 D-Day by Big Head Games","genres":[],"developers":["Big Head Games"],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/h5uzc2yqlxwsnmzkdu3d.jpg","external_ids":[]},{"igdb_id":39865,"name":"1943 Kai: Midway Kaisen","summary":"This updated version was released exactly one year after the original game's debut. 1943 Kai is an enhanced, \"wild\" version of 1943 that was made only available in Japan under the name 1943 Kai: Midway Kaisen (or 1943改: ミッドウェイ海戦). Most of the graphics and sounds have been reworked, the weapons have been made more extreme and some fairly strange things (laser-firing WWII planes and ships that run on ground) have been added. The trademark P-38 has been replaced with a biplane, the Boeing-Stearman Model 75.","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":583718400,"platforms":["Arcade"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6boo.jpg","external_ids":[]},{"igdb_id":99980,"name":"1942: Joint Strike Elefunk","summary":"Get 1942: Joint Strike Elefunk™, Shooter game for PS3 console from the official PlayStation® website. Know more about 1942: Joint Strike Elefunk™ Game.","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":219506,"name":"1990","summary":"1990 is a fun, casual RPG with turn-based combat.","genres":["Platform","Role-playing (RPG)"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1664755200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7ghg.jpg","external_ids":[]},{"igdb_id":29876,"name":"1979 Invasion Earth","summary":"1979 Invasion Earth is a Casual Arcade Shooter based on the classic retro games from the days of yore (long time ago now)","genres":["Strategy","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1484784000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co29d3.jpg","external_ids":[]},{"igdb_id":178550,"name":"1998","summary":"As Audrey enters her year of high school, she swirls into a crisis as she realizes that her bitterness and contempt has prevented her from having an enjoyable childhood, and there’s not much of it left to fix that. Her cynical outlook starts to change, however, when she meets Jun, a boy who just moved into her town.","genres":["Role-playing (RPG)"],"developers":["averageavacado"],"publishers":[],"aggregated_rating":null,"release_date":1513468800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7my2.jpg","external_ids":[]},{"igdb_id":41342,"name":"19: Neunzehn","summary":"A strategy war game for the Famicom Disk System, released by Soft Pro International. It was never released outside of Japan.\n\nThe title of 19 is based on the Greek pantheon of Gods, of which there are nineteen. \"Neunzehn\" is simply the number 19 in German. The player controls one of four heirs with an equal claim to the throne of the Greek hero Achilles. The latter sends the four to procure a magical stone that confers omnipotence to the user, originally left behind by the Greek gods. Through warfare, the player-chosen hero must defeat the armies of their three rivals and claim it for themselves.","genres":["Strategy"],"developers":["Soft Pro International"],"publishers":["Soft Pro International"],"aggregated_rating":null,"release_date":573436800,"platforms":["Family Computer Disk System"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co97xl.jpg","external_ids":[]},{"igdb_id":242118,"name":"1-900-Cult","summary":"Under the neon shadows of Miami, a mysterious cult searches for a way to bring about an end to life- and death- as we know it. Who will stop their horrific summons?","genres":["Shooter","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co69vk.jpg","external_ids":[]},{"igdb_id":123940,"name":"1984 Rewired","summary":"Year 1984, the society is controlled by the Great Warden. You must hack your way through the Cyber Reality to expose the truth behind his power. Run, jump, and avoid traps before the security system detects you.","genres":["Platform","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1570492800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3kr1.jpg","external_ids":[]},{"igdb_id":180729,"name":"1921: Shadow of the Old World","summary":"A spiritual successor to the 3D game called \"Old World\", set in Russian Civil War (1917-1922).","genres":["Shooter","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]},{"igdb_id":13931,"name":"1942 Mission","summary":"A 1980s World War II text adventure.","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":512611200,"platforms":["ZX Spectrum"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8pvo.jpg","external_ids":[]},{"igdb_id":189015,"name":"1919","summary":"1919. Saboteurs organised an insolent provocation in revolutionary Novgorod. So called «miracle-making» relics of Saint Lukian were stolen right on the eve of being exposed and debunked in public. Our paper «The Red Case» is following the investigation.","genres":["Point-and-click","Adventure","Indie","Visual Novel"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5cb5.jpg","external_ids":[]},{"igdb_id":112064,"name":"1941 Frozen Front","summary":"Lead German forces on the rise towards the East or defend mother Russia on the Soviet side. Choose the right tactic of warfare and earn your stripes as an ingenious Commander at the FROZEN FRONT!","genres":["Strategy"],"developers":["HandyGames"],"publishers":[],"aggregated_rating":null,"release_date":1372377600,"platforms":["Android","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co84bm.jpg","external_ids":[]},{"igdb_id":33580,"name":"1943 Megami Strike","summary":"Fight Shooting Game with Pretty Girls","genres":["Indie"],"developers":["GameUS Inc"],"publishers":["GameUS Inc"],"aggregated_rating":null,"release_date":1456272000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co22eo.jpg","external_ids":[]},{"igdb_id":76464,"name":"1945 Air Strike","summary":"A popular Shoot-Em-Up for iOS.","genres":["Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/assnszpgsv1nkvgfsd9p.jpg","external_ids":[]},{"igdb_id":77214,"name":"1990","summary":"A German political simulation of the 1990 reunification process, developed by Neudelsoft in 1990.","genres":["Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":248877,"name":"1940's Mafia Shootout","summary":"Mafia Shootout is the best gangster shooting game you will ever play!\nForce your way through the streets of 1940's New York, blasting any rivals that get in your way as you smuggle your wares across the city.\nWith countless upgrades, add-ons, extensions and power ups, you can make your mafia car near indestructible!","genres":["Racing","Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1347926400,"platforms":["iOS"],"cover_url":null,"external_ids":[]},{"igdb_id":136006,"name":"1971 Project Helios: Collector's Edition","summary":"This edition includes the following:\n\n- Cardboard Cover\n- 4 Character Cards\n- Fulgor Sticker\n- Digital Soundtrack Code","genres":["Turn-based strategy (TBS)"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":283080,"name":"1991","summary":"\"1991\" is an exciting game set in the USSR in 1991. Your main character, Leshka, has recently turned ten. He made a bet with his friend that he can spend a whole hour in an abandoned building. But things don't go as he expected...","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7n9h.jpg","external_ids":[]},{"igdb_id":247290,"name":"1990 Super Bros. 4","summary":"1990 Super Bros. 4 is a hack of the Japanese Super Mario Bros. 2 (a.k.a. The Lost Levels).\n\nThe game is largely identical to the Japanese version of Super Mario Bros. 2. Aside from an edited title screen, some of the graphics were changed; the graphics were reused from Super Mario Bros. 3, although some sprites are custom. Some of the power-ups have a different use: a Super Mushroom turns Mario into Fire Mario, and a Starman allows Mario to swim in the air.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":725760000,"platforms":["Nintendo Entertainment System"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coaq2c.jpg","external_ids":[]},{"igdb_id":6078,"name":"19XX: The War Against Destiny","summary":"19XX: The War Against Destiny is a vertical scrolling shooter arcade game made by Capcom in 1995 (copyrighted in 1996). The game is the 4th of a series of World War II vertical shooters made by Capcom. The story takes place before a fictional war (Hence, the 19XX) as a lone pilot tries to defeat an entire army/evil organization from starting another World War, which soon escalates to a nuclear apocalypse.","genres":["Shooter","Arcade"],"developers":["Capcom"],"publishers":["Capcom"],"aggregated_rating":null,"release_date":820454400,"platforms":["Arcade"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cob4cm.jpg","external_ids":[{"category":null,"store":null,"uid":"18966","url":"https://www.twitch.tv/directory/game/19XX: The War Against Destiny"},{"category":null,"store":null,"uid":"20755","url":"https://www.giantbomb.com/games/3030-20755/"}]},{"igdb_id":94288,"name":"1993Tris","summary":"In 1993tris the players goal is to destroy a certain number of flies. Flies drop down into the play field in blocks of 2x2. The flies are colored, and can be killed by matching three or more of the same color together.\n\nThere are also weapons that will fall down that the player can use by pressing the space bar or enter key.","genres":["Puzzle"],"developers":["Young Chung"],"publishers":[],"aggregated_rating":null,"release_date":757296000,"platforms":["DOS"],"cover_url":null,"external_ids":[]},{"igdb_id":2374,"name":"1942: The Pacific Air War","summary":"From December of 1941 through the end of the World War, the combined forces of Japan fought the armed forces of the United States of America over a broad stretch of ocean peppered with islands. This was the Pacific campaign, one of the bloodiest, toughest-fought campaigns in all of recorded history. Though all of the forces involved were essential parts of the eventual outcome, naval aviation played a special part. The carrier forces of both sides proved their worth time and again.\n\nThe idea behind 1942: The Pacific Air War is to re-create some of the adventure of that time and place and give you a chance to take part in it. To succeed, you have to avoid that oil- and blood-soaked, fire-on-water grave long enough to be of service to your country or your Emperor. As a commanding admiral of the navy, a crack fighter pilot, or just an anonymous Joe tail gunner, you are going to fight for recognition and just plain survival. The Japanese are moving south and east like a steamroller, trying to take control of the Pacific. The Americans are fighting back, desperately hoping to drain the strength from the Japanese juggernaut.","genres":["Simulator","Strategy"],"developers":["MPS Labs"],"publishers":["MicroProse Software, Inc.","Nightdive Studios","Retroism"],"aggregated_rating":null,"release_date":788832000,"platforms":["Linux","PC (Microsoft Windows)","Mac","DOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/va1fizgepckhvj1qzntp.jpg","external_ids":[{"category":null,"store":null,"uid":"347230","url":"https://store.steampowered.com/app/347230"},{"category":null,"store":null,"uid":"8116","url":"https://www.twitch.tv/directory/game/1942%3A%20The%20Pacific%20Air%20War"},{"category":null,"store":null,"uid":"8861","url":"https://www.giantbomb.com/games/3030-8861/"}]},{"igdb_id":43126,"name":"1982","summary":"1982 is a FREE retro inspired blasta-thon that will test your gaming skills to the max.","genres":["Indie"],"developers":["Binary Zoo"],"publishers":[],"aggregated_rating":null,"release_date":1498608000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co293u.jpg","external_ids":[]},{"igdb_id":109016,"name":"1942 Pacific Front","summary":"1942. World War 2. You and your troops are on duty near the Pacific – and there can only be one winner… The battle continues after 1941 Frozen Front – and this time, it’s all about naval warfare! Join the navy and fight to win the battle of your life! Own the battlefield and send your soldiers to the frontline. Military combat at its best! Choose the right tactics and use your commando to defeat the enemy! Lead the U.S. Army on their campaign or command the Japanese forces on their mission! Take out enemy alliances with infantry, artillery, tanks, warplanes, battleships and submarines and earn your stripes as an ingenious commander at the PACIFIC FRONT","genres":["Strategy"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1423094400,"platforms":["Android"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6bwm.jpg","external_ids":[]},{"igdb_id":17886,"name":"1953: NATO vs Warsaw Pact","summary":"1953: NATO vs Warsaw Pact is a strategic game about potential Cold War conflict just after the Stalin’s death. When the cruel tyrant has gone, Soviet warmongers has been finally able to start war with rotten West. With the nuclear power in the hands of both sides there is a huge possibility to end the world as we know it. How this ends, depend only on the action taken by both sides.","genres":["Strategy","Turn-based strategy (TBS)"],"developers":["Wastelands Interactive"],"publishers":["Wastelands Interactive"],"aggregated_rating":null,"release_date":1415664000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2kll.jpg","external_ids":[]},{"igdb_id":13932,"name":"1999","summary":"1999 is a side view horizontal scrolling shooter where the screen scrolls constantly from left to right and you have to destroy or avoid any spacecraft that fly towards you.","genres":["Shooter"],"developers":["Ice Cool Coders"],"publishers":["Summit Software"],"aggregated_rating":null,"release_date":567907200,"platforms":["ZX Spectrum"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6ean.jpg","external_ids":[]},{"igdb_id":310970,"name":"1944: Return to Midway","summary":null,"genres":["Shooter"],"developers":["filmote"],"publishers":["Arduboy"],"aggregated_rating":null,"release_date":1506297600,"platforms":["Arduboy"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8vd4.jpg","external_ids":[]},{"igdb_id":265966,"name":"1939","summary":"1939 is a 2D turn-based strategy game with elements of the strategy board games, similar to the Panzer General series. It represents all the major battles of the September Campaign against Poland, referring directly to historical events that launched World War II. The game contains 7 historical and 5 fictional scenarios. The army units are represented by tanks, motorcycles, infantry, cavalry, artillery, reconnaissance aircraft and bombers. The game features numerous historical pictures and allows up to two players to play and choose the Polish or German side.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":859766400,"platforms":["DOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co726k.jpg","external_ids":[]},{"igdb_id":301032,"name":"1986 A Long Five Days","summary":"A top down adventure and mystery-themed game in which the story takes place in 1986, after the Chernobyl nuclear disaster. Key controls: wasd to move Interactions: E to collect items","genres":["Role-playing (RPG)","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co87eh.jpg","external_ids":[]},{"igdb_id":6733,"name":"1945k III","summary":"1945kIII is a scrolling shooter arcade video game. It was developed and published by the Korean developer Oriental Software in 2000.\n\nIn this game, the player controls a fighter and has to shoot as many enemy fighters as possible while the stage is moving forward. There are many bonuses and new weapons available. The gameplay is reminiscent of several 1980s scrolling shooter arcade video games, and is therefore considered a retro game.","genres":["Shooter","Arcade"],"developers":["Oriental Software"],"publishers":["Oriental Software"],"aggregated_rating":null,"release_date":978220800,"platforms":["Arcade"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6hvz.jpg","external_ids":[{"category":null,"store":null,"uid":"1911823308","url":"https://www.twitch.tv/directory/game/1945k%20III"}]},{"igdb_id":83110,"name":"1984 Locospotter","summary":null,"genres":["Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":473299200,"platforms":["ZX Spectrum"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/hz5kaxfhqpyomufoyzx0.jpg","external_ids":[]},{"igdb_id":235717,"name":"1941: Operation Barbarossa","summary":"PC conversion of a turn-based hex-strategy board war game.","genres":["Strategy"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1672963200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7ghf.jpg","external_ids":[]},{"igdb_id":80075,"name":"1955: The Secret Mission","summary":"1955 - The Secret Mission is a top down shooter. The player is the last remaining allied pilot and is given a secret mission to destroy \"The Iron Cannon\".\n\nAs the game is java based the graphics are not advanced. There are various enemies to engage including multiple bosses. Powerups and extra lives can be found within the game and there are two levels of difficulty.","genres":["Platform"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1132272000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6c4x.jpg","external_ids":[]},{"igdb_id":110956,"name":"1971: Indian Naval Front","summary":"Learn about the biggest naval conflict since WWII. Third-person vehicular combat game based on 1971 India-Pakistan war. Conduct missions based on actual events. Control naval units including aircraft carriers, warships, jets and choppers. Crack morse coded messages and progress through levels.","genres":["Shooter","Indie"],"developers":["Neosphere Interactive Studios"],"publishers":["Neosphere Interactive Studios"],"aggregated_rating":null,"release_date":1680652800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5rdt.jpg","external_ids":[]},{"igdb_id":112552,"name":"19:03 Ueno Hatsu Yakou Ressha","summary":"19-03 Ueno Hatsu Yakou Ressha is a third person adventure game that tells the story of Tsupei Akai a freelance photographer or of Miyuki Hatakeyama a middle school teacher. Both of them take the night train that goes from Toyo's Ueno to Sapporo but what started as a normal train travel soon will start to be a little more complicated since they will be involved into murders, assassins and other dangerous situations.\n\nThe player can choose at the beginning of the game which story he wants to play and the situations and reactions of each character are different, so there is 2 adventures in the same game. The game is played in a first person perspective and is like an interactive movie and depending of the player choices his character will or not survive the travel. There are different endings and different death scenes.","genres":["Visual Novel"],"developers":["Visit"],"publishers":["Visit"],"aggregated_rating":null,"release_date":920505600,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6svb.jpg","external_ids":[]},{"igdb_id":135236,"name":"1977: Radio Aut","summary":"A short interactive story about Peppino Impastato and his life-long fight against Sicilian Mafia.","genres":["Simulator","Visual Novel"],"developers":["Alex Camilleri"],"publishers":["Alex Camilleri"],"aggregated_rating":null,"release_date":1517616000,"platforms":["Web browser","PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2cmj.jpg","external_ids":[]},{"igdb_id":272545,"name":"1943: The Battle of Midway","summary":null,"genres":["Shooter"],"developers":["Capcom"],"publishers":["Capcom"],"aggregated_rating":null,"release_date":582768000,"platforms":["Family Computer","Nintendo Entertainment System"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8d4e.jpg","external_ids":[]},{"igdb_id":272544,"name":"1942","summary":"The NES port of 1942 includes a \"looping\" mechanic where players begin and end each level on an aircraft carrier.","genres":["Shooter"],"developers":["Capcom"],"publishers":["Capcom"],"aggregated_rating":null,"release_date":503107200,"platforms":["Family Computer","Nintendo Entertainment System"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coa1c3.jpg","external_ids":[]},{"igdb_id":159403,"name":"1942 Wing Baron","summary":"Jump on board of the famous red biplane and destroy everything you come across! If you enjoy classic aviation arcade games in which your screen fills up with chaos and destruction you’ll love 1942 Wing Baron. Progress through 15 levels with different landscapes and lots of enemies who will make your life a misery: planes, ships, tanks, helicopters, etc. Pick up arms, avoid enemy bursts of machine-gun fire and confront the most dangerous final bosses!","genres":["Shooter"],"developers":["Sherwood Media"],"publishers":[],"aggregated_rating":null,"release_date":1072828800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3hk8.jpg","external_ids":[]},{"igdb_id":70295,"name":"1994 (Ten Years After)","summary":"A videogame \"sequel\" to George Orwell's speculative novel \"1984\". 1994 consists of basic platforming gameplay and chronologically takes place ten years after the events of the book.","genres":["Platform","Arcade"],"developers":["Kevin J. Bezant"],"publishers":["Visions Software Factory"],"aggregated_rating":null,"release_date":473299200,"platforms":["Commodore C64/128/MAX"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/vxkvwtjagudlhemfarzu.jpg","external_ids":[]},{"igdb_id":56464,"name":"1944 Burning Bridges","summary":"Join the war for Europe and relive the greatest military invasion of WW2: D-Day! Duty calls: Experience an exciting strategy gameplay and master challenging military missions! Storm the beaches of Normandy with the Allied troops or take command of the Axis and defend the Atlantic Wall. History depends on you!","genres":["Strategy"],"developers":["HandyGames"],"publishers":[],"aggregated_rating":null,"release_date":1448496000,"platforms":["Android"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co84bn.jpg","external_ids":[]},{"igdb_id":6079,"name":"1944: The Loop Master","summary":"The game takes place in the heated battles of 1944 during the Second World War as a super ace pilot attempts to defeat an entire army. The game operates and plays like most standard shooters. The objective of every level is to shoot enemy planes, tanks, trains, turrets, battleships, and defeat the boss after each level. Unlike its predecessor, 19XX: The War Against Destiny, the game plays more like the early games in the series.","genres":["Shooter","Arcade"],"developers":["8ing","Raizing"],"publishers":["Capcom"],"aggregated_rating":null,"release_date":961459200,"platforms":["Arcade"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2kqq.jpg","external_ids":[]},{"igdb_id":191285,"name":"1942 Delta","summary":"Are you a fan of vertical scrolling shooters? Then you will definitely love 1942. The game will keep you busy and entertained for hours. The year 1942 is widely adopted in video games, considering that it is the middle year of the World War II timeline.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1503619200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4gj1.jpg","external_ids":[]},{"igdb_id":92397,"name":"1916: Der Unbekannte Krieg","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1302307200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2li3.jpg","external_ids":[]},{"igdb_id":308212,"name":"1987: Rescue in Berlin","summary":"Will you be able to find the floppy disk and return safely?","genres":["Point-and-click","Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1694822400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8htz.jpg","external_ids":[]},{"igdb_id":41010,"name":"19 Part One: Boot Camp","summary":"19 Part One: Boot Camp is a visceral simulation that immerses players in the experience of a young American draftee during the escalation of the Vietnam War in 1965. The game begins by contrasting the comfortable civilian life of a 19-year-old with the jarring reality of conscription. Players are thrust into the grueling world of basic training, where they must navigate the physical and psychological challenges of military preparation. Through a series of intense exercises, the game tests the player's coordination, stamina, and morale, offering a realistic portrayal of the transformation from civilian to soldier. Boot Camp serves as a powerful introduction to the broader Vietnam War experience, setting the stage for the dramatic personal and historical events to follow.","genres":["Fighting","Shooter","Racing"],"developers":[],"publishers":["Cascade Games, Ltd."],"aggregated_rating":null,"release_date":592185600,"platforms":["Commodore C64/128/MAX","ZX Spectrum"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co93xe.jpg","external_ids":[]},{"igdb_id":326910,"name":"1994 Tune-up Community Project","summary":"The 1994 Tune-up Community Project is a 2011, 32-level Boom-compatible megawad created by members of the Doomworld community. It is a collection of remakes of levels from 1994 (and, occasionally, 1995) aiming to revise them to modern standards. It was started in 2008 by Snarboo, and coordinated by Travers Dunne (traversd) and GreyGhost.","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1313798400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co97ke.jpg","external_ids":[]},{"igdb_id":83109,"name":"1960s Locospotter","summary":null,"genres":["Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":473299200,"platforms":["ZX Spectrum"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/rkmmh4s2x4phuhrirjvm.jpg","external_ids":[]},{"igdb_id":47006,"name":"1942: Pacific Air War","summary":"1942: The Pacific Air War is a flight simulation set in World War II, more specific the Pacific War between Japan and the United States.\nThe focus is on the realistic simulation of the ten aircraft, this means for instance that there is no indicator for ammo. The game features several missions which can be either played independently from each other or in two campaigns for the United States or Japan. The goals are mostly to liberate an area, to defend an area or to destroy a specific target.","genres":["Simulator","Strategy"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":773452800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coa43i.jpg","external_ids":[]},{"igdb_id":145414,"name":"1943: One Year After","summary":"1943: One Year After is a vertical-scrolling shooter heavily inspired by 1942 (even a carrier take-off sequence is included). The player flies a Lockheed P-38 Lightning over the island-dotted Pacific during the World War 2, fighting against Japanese aircraft. You may collect powerups and perform defensive loop maneuver to avoid enemy fire (up to 3 times) - you have only three lives left. Player's progress is tracked on a map (left side of the screen).","genres":["Shooter","Arcade"],"developers":["Greve Graphics"],"publishers":["American Action AB"],"aggregated_rating":null,"release_date":533779200,"platforms":["Commodore C64/128/MAX"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co95bm.jpg","external_ids":[]},{"igdb_id":137426,"name":"1993 Shenandoah","summary":"Space shooters never die.\n\nTowards the end of the Interstellar Wars, chaos spread and one band of elite mercenaries acted more like pirates and looters than actual soldiers. The leader of this group was the notorious and infamous Colonel Nestor.\n\nWithout a doubt the biggest prize of their looting was the Shenandoah, a device designed to terraform barren planets. With this device Nestor and his men started to build an army that now poses a great threat to the known star systems.\n\nYour mission: Take down Nestor and bring back the Shenandoah.","genres":["Shooter","Indie","Arcade"],"developers":["Aurora Punks"],"publishers":["Aurora Punks"],"aggregated_rating":null,"release_date":1594252800,"platforms":["PlayStation 4","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2j2b.jpg","external_ids":[]}]