[{"igdb_id":51056,"name":"3-2-1, Rattle Battle!","summary":"Rattle to rack up points in crazy mini-games! Battle your friends to see who’s the best rattler!\n\n3-2-1, Rattle Battle! is a party game packed with exciting mini-games. Intuitive controls mean that anyone can enjoy playing - just grab the Wii Remote and shake it to “rattle”. Great fun for single players, but the party really gets started when you register high scores on Nintendo Wi-Fi Connection to see how you measure up against players from around the globe!\n\n■Mini-Games:\n\nRattle In Time: Use split-second timing to rattle at exactly the right moment!\n\nRattle Reflex: Test your powers of concentration!\n\nRattle With Caution: Rattle to move forward when the bad guy's back is turned!\n\nTight Rope Rattle: Rattle to move across the high wire while dodging the arrows!\n\nRattle-a-Kiss: Gauge the correct rattle speed to give that shy guy a push so he flies in for a smooch.\n\nRattle Blast: An intense duel where you need to get your rattling strength just right!\n\n*With a total of 12 mini-games, you and your friends are in for a rattling good time!","genres":["Arcade"],"developers":["Tecmo"],"publishers":["Tecmo Koei Games"],"aggregated_rating":null,"release_date":1238457600,"platforms":["Wii"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9pns.jpg","external_ids":[]},{"igdb_id":348227,"name":"32, Dandelion Drift","summary":"Discover the secrets held within the old House on 32, Dandelion Drift. In this classic Visual Novel you'll find joy, hope, but also remorse and terror.","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9yg4.jpg","external_ids":[]},{"igdb_id":376942,"name":"321Rocket","summary":"Drill Rocket mining Action Game! Avoid approaching obstacles and aim for the goal! Get lots of ores and buy power-up items at the shop! /// Various mechanisms that will confuse your brain appear!! And, the tricky mechanisms are randomly combined, sure to cause chaos!!!","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1758067200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coatoo.jpg","external_ids":[]},{"igdb_id":315168,"name":"32in24-14: How the Hamburglar Stole Christmas","summary":"32in24-14: How the Hamburglar Stole Christmas is the fourteenth edition of the 32in24 series of PWADs, where a 24-hour mapping session is held with the aim of creating a full megawad of usually multiplayer maps - however this time, the maps were designed for single player, making it the first single player 32in24 since Diet, and the first attempt at a full single player megawad since the failed second session. Wary of the increased challenges of creating a single player map over a deathmatch one, mappers were allowed to reuse architecture from previous 32in24 maps to assist them in creating theirs.\n\nContinuing the food and holiday themes introduced by the thirteenth edition, this session was held on 21 December, 2014, and so the maps generally carried a Christmas theme, complete with map titles that mostly referenced either Christmas or food. The subtitle of the session itself refers to a Christmas story by Dr. Seuss As with the previous few sessions, a week was allowed after the session for minor polishing of the maps based on feedback.","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1421539200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8r3m.jpg","external_ids":[]},{"igdb_id":148335,"name":"32 Secs","summary":"Race through traffic in a futuristic city’s highway with your cyber motorcycle, completing various trials and challenges! Take the city at extreme velocity! Hop your motorcycle and complete various races, time trials and other challenges in a sci-fi metropolis with high-speed! Hit the asphalt hard, zig-zag between bikes and racing cars on vibrant neon lit streets. Hack, boost and maneuver with different futuristic bikes on endless highways! Tune up your vehicle with system updates and hardware upgrades - be the fastest racer in this rapid rush! Improve your racing skills and reflexes, dodge enemy bikes, beat the other racers and try to become the master of the asphalt! Get higher speed and exact handling, use boosts and hacking tactically to leave your foes behind. Compete for the best trial time with other real riders. Discover the glowing, futuristic streets, find every boost, beat every boss and collect as many coins as you can to upgrade your vehicle reaching extreme high speed! Unlock new vehicles, customize your bikes, make them faster, harder, stronger! 32Secs takes you on a real futuristic high-speed experience. Rush and take your best chance to overcome your racing opponents but be careful and don’t crash your bike into cars or any obstacles on the asphalt!","genres":["Racing","Adventure","Indie","Arcade"],"developers":["isTom Games"],"publishers":["isTom Games"],"aggregated_rating":40.0,"release_date":1464134400,"platforms":["Android","PC (Microsoft Windows)","iOS","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3izk.jpg","external_ids":[]},{"igdb_id":261062,"name":"3,2,1...WordsUp!","summary":null,"genres":[],"developers":[],"publishers":["GameOn"],"aggregated_rating":null,"release_date":1341446400,"platforms":["Nintendo DSi"],"cover_url":null,"external_ids":[]},{"igdb_id":84583,"name":"3, 2, 1... Words Up!","summary":"Show your command of the language in 3, 2, 1... Words Up!","genres":[],"developers":[],"publishers":["EnjoyUp Games"],"aggregated_rating":null,"release_date":1341446400,"platforms":["Nintendo DSi"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9qh4.jpg","external_ids":[]},{"igdb_id":262166,"name":"32 Inch Nails","summary":"32 Inch Nails is a seven-map PWAD for Doom II and limit-removing ports created by Alexander S. (Eternal), released on September 28, 2008. It split off the Grid 32 community project and is built in a similar fashion, as the maps were created with a 32x32 grid in the map editor for all linedefs and vertexes, giving them a rather unique look, although this does not extend to thing placement.","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1222560000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6yfh.jpg","external_ids":[]},{"igdb_id":40593,"name":"32 in 1","summary":"32 games in 1 cartridge was 1988 released and is highly common in Europe. Popular Atari 2600 games of the sports- and shootergenre was put into one cartridge. This was a cart that was released in PAL format in Europe, Australia and New Zealand. Most were the pack in game with the Atari 2600 in the UK and Atari 7800 in Australia and New Zealand but it was also released as a boxed separate game for the Atari 2600. A different game was selected every time the Atari 2600 or Atari 7800 was turned on.","genres":["Fighting","Shooter","Puzzle","Racing","Simulator","Sport","Strategy"],"developers":[],"publishers":["Atari"],"aggregated_rating":null,"release_date":570672000,"platforms":["Atari 7800","Atari 2600"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7mc4.jpg","external_ids":[]},{"igdb_id":260786,"name":"32 Piece Cliptucky Fried Chicken Special","summary":"This megawad has 538 monsters across 32 maps! The map # = the monster count: Map 1, 1 monster, map 2, 2 monsters etc. A series of random fun little maps that explore small adventures with wacky random gimmicks etc","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1625788800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6ws6.jpg","external_ids":[]},{"igdb_id":215861,"name":"3:28am","summary":"A Bitsy game about sleep and wanting to not wake up.","genres":["Indie","Visual Novel"],"developers":["tobin_ez"],"publishers":["tobin_ez"],"aggregated_rating":null,"release_date":1662163200,"platforms":["Web browser"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co56gn.jpg","external_ids":[]},{"igdb_id":328167,"name":"3.2m2","summary":"Don't try to find achievement in this game. Don't try to make something of your life. You are very nothing. if you only know the room you can use and the duties you have, you can clear this game . . . even your ego","genres":["Simulator","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1732579200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9a19.jpg","external_ids":[]},{"igdb_id":254711,"name":"326","summary":"Build a chain of as many tiles as the number shown on the tile to explode the chain and get the score. Make a longer chain and get a higher score! Rotate the tiles for extra possibilities!","genres":["Puzzle"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":72609,"name":"32nd America's Cup: The Game","summary":"Considered to be the ultimate in nautical simulations, Virtual Skipper is back with a new edition which will delight all sailing fans and which highlights a magnificent campaign dedicated to the 32nd America’s Cup.","genres":["Simulator","Sport"],"developers":["Nadeo"],"publishers":["Focus Entertainment"],"aggregated_rating":null,"release_date":1177027200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6umn.jpg","external_ids":[]},{"igdb_id":219508,"name":"32 in 1 Game Special","summary":"A tribute to those less then stellar computer shareware and multicart games of the past, 32 in 1 features many different game genres, some with a odd sense of humor. Games mainly lean on point scores ,speed runs and survival, all to give you the player a sense of pride and accomplishment!","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1665619200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7ghr.jpg","external_ids":[]},{"igdb_id":102387,"name":"3, 2, 1, Survive!","summary":"A simple game with an hard difficulty!","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1527897600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co22fm.jpg","external_ids":[]},{"igdb_id":42786,"name":"3, 2, 1...SuperCrash!","summary":"Get on your unicycle and attempt to pass through human-shaped spaces in walls that appear on your path. Jump and dodge all the obstacles that get in your way to reach the goal in snow, the woods and a town. Try your hand at five different race types in Endless Mode.","genres":["Puzzle"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1289260800,"platforms":["PlayStation Portable"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co70ov.jpg","external_ids":[]},{"igdb_id":247015,"name":"32-in-1 Games","summary":"A cartridge for the InterAct plug & play system.","genres":[],"developers":[],"publishers":["Intec"],"aggregated_rating":null,"release_date":null,"platforms":["Plug & Play"],"cover_url":null,"external_ids":[]},{"igdb_id":227533,"name":"32 Secs: Traffic Rider 2","summary":"Take the city at extreme velocity! Hop on your motorcycle and complete various missions, time trials and other challenges in a sci-fi metropolis with high-speed! Hit the asphalt hard, zig-zag between bikes and racing cars on vibrant neon lit streets.","genres":["Racing"],"developers":["isTom Games"],"publishers":["isTom Games"],"aggregated_rating":null,"release_date":1481846400,"platforms":["Android"],"cover_url":null,"external_ids":[]},{"igdb_id":45321,"name":"3 2 1 Quiz Game","summary":"3-2-1 was a popular quiz show in the UK during the 1980’s. The game was only available via mail-order from a company called Micro Computer Incorporated, and gave you the chance to win lots of prizes just the like real thing. The star prize being a week’s holiday in Spain.","genres":["Quiz/Trivia"],"developers":[],"publishers":["Micro Computers"],"aggregated_rating":null,"release_date":473299200,"platforms":["ZX Spectrum"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1i8s.jpg","external_ids":[]},{"igdb_id":32004,"name":"3..2..1..Grenades!","summary":"3..2..1..Grenades! is a snowball fight with high explosives. Help save Grenades Co from the terrible monster it's unleashed by yourself or with up to 4 people!","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1498003200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co29db.jpg","external_ids":[]}]