[{"igdb_id":9933,"name":"3 Stars of Destiny","summary":"3 Stars of Destiny is a fantastic 2D RPG by the makers of the Millennium series and The Book of Legends. In this extensive adventure, explore countless uniques places, defeat tons of enemies and complete richly developed quests. The game features addictive gameplay and an experience worth tens of hours of playtime.","genres":["Role-playing (RPG)","Adventure","Indie"],"developers":["Aldorlea Games"],"publishers":["Degica Games"],"aggregated_rating":null,"release_date":1395964800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2xes.jpg","external_ids":[]},{"igdb_id":365045,"name":"3 Seconds Remaining","summary":"3 SECONDS REMAINING is a simple top-down shooter made by tiny.ROM,","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1756080000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coae5c.jpg","external_ids":[]},{"igdb_id":254035,"name":"3 Scary Games","summary":"Three different first-person horror experiences, each with unique enemies to overcome: a Man, your Mind, and a Monster. You'll need to tackle these challenges using different tactics, like stealth, puzzle solving, and parkour, respectively. Can you survive the trinity and unravel the mystery?","genres":["Indie"],"developers":["Magic Dragon"],"publishers":["Magic Dragon"],"aggregated_rating":null,"release_date":1698019200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co759c.jpg","external_ids":[]},{"igdb_id":9934,"name":"3SwitcheD","summary":"3SwitcheD combines classical Gameplay with fascinating new technologies. Find yourself in a new World arcade gaming. The brand-new 3D- and 3D-ET-Technology lifts the whole Game really in a new Dimension. Using the 3D-ET-technology 3SwitcheD not only gives you fantastic real 3D looks, it works 3D. Using any connected camera the game will scan your face and you will be able to turn the view only by looking in the direction you want it to! This brand new Technology will give you a Gaming experience never imagined!\n\nFor all Players not using this feature the Game still provides fantastic looks and a bunch of challenges! A bunch of challenges is waiting for you, are you ready? Six highly addictive, vastly different and challenging modes set in an innovative 3D environment. Clear clusters and even shift gravity to rearrange gems for an all-new experience in puzzle and strategy gaming. Boost your high scores out of orbit with vertical, horizontal and even diagonal moves to blast those brilliant gems and gain access to the bonus levels!","genres":["Puzzle","Indie"],"developers":["Reality Pump"],"publishers":["TopWare Interactive"],"aggregated_rating":null,"release_date":1332979200,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3ksf.jpg","external_ids":[]},{"igdb_id":252715,"name":"3 Shapes","summary":"Bored of old fashioned matching games that put you to sleep? Then you'll love playing 3 Shapes!","genres":["Puzzle"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":294243,"name":"3 Shots Left","summary":"A slow burn retro horror game set in the English countryside. In the apocalypse ammo is scarce and you only have 3 shots left. Make them count!","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7zrj.jpg","external_ids":[]},{"igdb_id":132105,"name":"3 Slices","summary":"A simple yet challenging puzzle game where you must remove as much red as possible using only 3 slic…","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1322006400,"platforms":["Web browser"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co22w7.jpg","external_ids":[]},{"igdb_id":26407,"name":"3Souls","summary":"With 3Souls, you will discover the world of Mustland, a place full of rules and secrets... and its own people, the Ánimas, who are mysterious characters wearing a mask with them own soul floating around them.","genres":["Platform","Puzzle","Adventure"],"developers":["Red Column"],"publishers":["Red Column"],"aggregated_rating":74.0,"release_date":1469664000,"platforms":["Wii U"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/vvcywdhwmpgckhgmysyz.jpg","external_ids":[]},{"igdb_id":228798,"name":"3Scapes","summary":"3Scapes is a text-based multi-user dungeon. Communication across the dimensions is easily handled, as is the ability to retain your character identity (i.e. name) across all existence, but beyond that, everything else is unique.\n\nSince opening in 2009, 3Scapes has grown to become a virtual community of over 800 characters with new guilds, new areas, new quests, and new functionality. With its own cast of players, administrators, and its own unique feel, 3Scapes is a vibrant virtual world ready for you to visit, explore, and enjoy!","genres":["Role-playing (RPG)"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1262217600,"platforms":["Linux","Android","PC (Microsoft Windows)","iOS","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5w0l.jpg","external_ids":[]},{"igdb_id":295779,"name":"3Souls: Parallel Edition","summary":"In the world of Mustland, each Ánima has a different soul, and they will see, feel, hear and play the world in a different way!","genres":["Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1712275200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co81a7.jpg","external_ids":[]},{"igdb_id":2204,"name":"3 Skulls of the Toltecs","summary":"The game begins in 1866 Arizona when the game's hero, a cowboy named Fenimore Fillmore, tries to rescue an old peddler from a band of attacking rustlers. The dying peddler gives Fenimore a golden skull and tells him the legend of a fabulous treasure that can be found by collecting two other golden skulls. To reach his goal, Fenimore Fillmore must battle the evil Friar Anselmo and the perfidious Colonel Leconte (who also seek the treasure), fight fierce Apaches (whose Chief's son's tepee boasts a sheepskin from Harvard), engage sleepy Mexican revolutionaries (whose leader is amnesic), outwit witty French soldiers (federated with Emperor Maximilian of México), and suffer the insufferable alcohol-prohibition-ladies league. Solving the puzzles involves fabricating bootleg whiskey, blowing up a bank's safe, escaping from prison, rescuing a pianist from a well, locating and flying a balloon, and turning a devout monk into a gallant rebel general. The game elements emulate Spaghetti Westerns and caricature American Wild West themes","genres":["Point-and-click","Puzzle","Adventure"],"developers":["Revistronic"],"publishers":["WB Games"],"aggregated_rating":null,"release_date":851990400,"platforms":["DOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2tmx.jpg","external_ids":[]},{"igdb_id":221208,"name":"3 Seasons","summary":"A slice of life, romance and fantasy dating sim featuring 3 love interests, romance/friendship routes and an original soundtrack.","genres":["Visual Novel"],"developers":["Hamilton Hour"],"publishers":[],"aggregated_rating":null,"release_date":1656547200,"platforms":["Linux","Android","PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5gg7.jpg","external_ids":[]}]