[{"igdb_id":106394,"name":"70 Seconds Survival","summary":"70 Seconds Survival is an arcade style race project, which doesn't contain realistic physics. The players mission is to find and reach the finish line under 70 seconds. The player also has to avoid damageable obstacles like spikes and bombs. There are also several AI police cars which the player also needs avoid. Police cars will start to chase the player immediately when map starts \nThe player can choose from 4 different cars, which all have their own tracks. The player can choose from the following cars: Formula 1 car, Crosskart car, Rally car and GT race car. \nThe player has a health system and colliding with spikes and bombs recudes health. Hitting to police car will immediately end the game. \nSo be fast and avoid damage inducing objects. For now the game contains 23 tracks.","genres":["Racing","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1533686400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co22gv.jpg","external_ids":[]},{"igdb_id":79588,"name":"70's Robot Anime Geppy-X","summary":"Side scrolling shooter with lots of tips on a parody of 1970s-style robot anime. Giant robot \"blech P-X \" puppet, fight to protect the planet from the invading army of aggression led by Bin Day Space Beast Satan. Each stage is complete proceed to talk like a TV cartoon, is full of a variety of scenarios and events","genres":["Shooter"],"developers":["Aroma"],"publishers":["Aroma"],"aggregated_rating":null,"release_date":927763200,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5wmv.jpg","external_ids":[]},{"igdb_id":121777,"name":"70 Seconds! Adventure","summary":"70 Seconds! Adventure - a game where you have to wander around the locations in search of a way out of here. You will have to overcome the intricate locations filled with aggressive monsters and various bosses. Choose your weapon and arm yourself with it and go to a dangerous world. Destroy aggressive bosses, find funny references and Easter eggs, meet different achivki and find new weapons. Go through an adventure that you will remember forever.\nAs you progress through the game you will find a variety of weapons:\nUpcoming for the destruction of monsters and bosses, using a variety of ordnance and tactics are not ogranichivayutsya opportunities\nAlso, you will not pass the game without meeting on the way aggressive monsters:\nMonsters in the game can meet differently, some will look like small and harmless animals, and others, on the contrary, will do everything that would destroy you.\n\nAs well as the passage of the game you will meet the Bosses:\nThis is a separate type of Monsters that have a large amount of health and special abilities. Because of the good protection and a large number of health to win them is not so easy, but with the proper skill and desire, everything is possible.","genres":["Role-playing (RPG)","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1567123200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co22hz.jpg","external_ids":[]},{"igdb_id":79223,"name":"700,000 Games","summary":"Compilation","genres":[],"developers":["Viva Media"],"publishers":["SelectSoft Publishing"],"aggregated_rating":null,"release_date":1385596800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/r3imiknnqbi0pflzuqow.jpg","external_ids":[]}]