[{"igdb_id":171799,"name":"G1deon: Towards God","summary":"G1Deon: Towards God is an adventure game with elements of quest. The game consists of 2 storylines. At first you have to play for Alan Sparks, the historian from America, who is looking for a fabulous City of Rain. The action takes place in 1979. The second you're playing for the G1Deon, painted character from the diary of Sparks, who travels to places of stories about the City of Rain.","genres":["Adventure"],"developers":["PolStan Studios"],"publishers":["Miedia Khauz"],"aggregated_rating":null,"release_date":1300060800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3uqw.jpg","external_ids":[]},{"igdb_id":21455,"name":"G1 Jockey Wii 2008","summary":"A revolutionary horse racing experience that brings you closer to the real thing than ever before. Work your way up from novice status to become a renowned horse racing legend throughout a full, in depth career.","genres":[],"developers":[],"publishers":["Koei"],"aggregated_rating":70.0,"release_date":1222387200,"platforms":["Wii"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co74l9.jpg","external_ids":[]},{"igdb_id":55171,"name":"G1 Jockey 2000","summary":"The sophomore effort in Koei's G1 Jockey franchise.","genres":["Racing","Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":949536000,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/mkfrh9vhyqsyvgtxtlmi.jpg","external_ids":[]},{"igdb_id":21440,"name":"G1 Jockey Wii","summary":"As well as giving gamers the opportunity to whip themselves into shape while striving to be the king of the final furlong, G1 Jockey Wii also contains an incredibly deep career mode where players get the chance to work their way from rookie status to horse racing legend.","genres":[],"developers":[],"publishers":["Koei"],"aggregated_rating":80.0,"release_date":1173916800,"platforms":["Wii"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/yrwstzovqupgurwpoy8g.jpg","external_ids":[]},{"igdb_id":55170,"name":"G1 Jockey 2","summary":"G1 Jockey moves to the PlayStation 2 with its first numbered sequel.","genres":["Racing","Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":973123200,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xuf.jpg","external_ids":[]},{"igdb_id":93614,"name":"G1 Jockey 4 2008","summary":"Horse racing simulators are geared towards an incredibly narrow niche market. Aspiring jockeys who also have a passion for console gaming are a rare breed, so Koei’s biggest challenge with G1 Jockey 4 2008 is convincing the wider audience to saddle up. Skipping those tedious tutorials and diving straight in is always tempting, but in this case inadvisable. The training section is reasonably comprehensive and essential to anyone actually wanting to progress with this one. Care is taken to introduce the player to every aspect of the game, but there is great deal of information to absorb both on an off the track. Constant reference to that instruction manual is inevitable when you start off on the long arduous journey that is story mode.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PlayStation 3"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7548.jpg","external_ids":[]},{"igdb_id":23713,"name":"G1 Jockey 3","summary":"Fancy hats, oval turf tracks and people waving tiny bits of paper on the stands. Welcome to the world of horse racing. While most other racing games have the player controlling a motorized vehicle (such as a car or a powerboat), or using physics to move closer to the goal (skiing, sailing and so on), in G1 Jockey the player is controlling an animal, which makes it slightly different from other racing games in the market. \n \nThe player has to balance four things - the overall speed of the horse, the stamina, horse motivation, and the potential, which affects for how long the horse can keep the speed high after all stamina was lost - crucial for the last stretch sprint. It's impossible to raise all four at once, so players must have a well defined strategy to succeed. \n \nDepending on their abilities, each horse might be better suited for a particular strategy or type of race, and each must be treated differently to achieve the best possible result. The game features a large roster of horses, and many tracks to choose from, including flat track and steeplechase races. Game modes include race training, a tutorial, two player mode, and the career mode, where the player starts as a rookie jockey, and must complete races and training sessions to attract the attention of better stables.","genres":["Simulator","Sport"],"developers":[],"publishers":[],"aggregated_rating":62.0,"release_date":1056758400,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/roy4xoonsbpyusii3c0e.jpg","external_ids":[]},{"igdb_id":80864,"name":"G1 Jockey 2 2001","summary":"The first G1 Jockey game released outside of Japan. Known as G1 Jockey 2 2001 in its native homeland.","genres":["Racing","Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/bzrjoxbdpdnjm84eljnb.jpg","external_ids":[]},{"igdb_id":44695,"name":"G1 Jockey","summary":"Race to become the leading jockey--vie for the rookie of the year award as an apprentice, gain wins, collect G1 trophies, and earn money on your way to the Triple Crown. Compete with 65 computer jockeys each season, choose from over 2000 unique racehorses to ride, and negotiate with the trainers to ride the top horses each week. The game also includes exciting 2-player head-to-head action, including steeplechase courses.","genres":["Racing","Simulator","Sport"],"developers":[],"publishers":["Koei"],"aggregated_rating":null,"release_date":921110400,"platforms":["PlayStation","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/blpba7hjadehnt2zytci.jpg","external_ids":[]},{"igdb_id":44155,"name":"G1 Jockey Sense","summary":"A VR arcade cabinet game being developed for Japanese game centers, \nIt will likely be released later for PlayStation VR as the arcade cabinets use PlayStation VR hardware along with features to stimulate the senses such as a multipurpose 3D seat, scent, touch, wind, warmth, coolness, and mist.","genres":["Sport","Arcade"],"developers":["Koei Tecmo Wave"],"publishers":["Koei Tecmo Wave"],"aggregated_rating":null,"release_date":null,"platforms":["Arcade"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/axxsfnwvlyqxog3hpd4v.jpg","external_ids":[]},{"igdb_id":4878,"name":"G1 Jockey 4","summary":"G1 Jockey 4 lets players take the reins and experience the feeling of being a top racehorse jockey. This fourth game in the hugely popular series introduces a new ranking system and abilities, as well a revolutionary analogue control system.","genres":["Racing","Simulator","Sport"],"developers":["Koei"],"publishers":["Koei","THQ"],"aggregated_rating":20.0,"release_date":1135209600,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/ov9pokvvcmazyfufn32s.jpg","external_ids":[{"category":3,"store":null,"uid":"43893","url":"https://www.giantbomb.com/games/3030-43893/"},{"category":14,"store":null,"uid":"458053","url":"https://www.twitch.tv/directory/game/G1%20Jockey%204"}]}]