[{"igdb_id":222150,"name":"G-Mode Archives+: Idol Janshi Suchie-Pai - Milky no Yabou","summary":"Even if you cheat, if you win you're in the right! If you lose you have to strip! Have a dreamy time exchanging tiles with beautiful girls.\n\nThis work, which was previously released on feature phones, is a side story of Jaleco's beautiful girl competition mahjong game \"Idol Janshi Suchie-Pai\" series.\n\nMilky Pie, an alien in the form of a rabbit's ``Chikyu-Seifuku Project'' begins in earnest!\nSeifuku... Seifuku... That means everyone's \"uniform\" is in danger! ?\n\nIdol mahjong player Suchie-Pai, a self-proclaimed righteous heroine, stands up to face the shameless crisis of the earth! !\n\nMake full use of \"loading (cheating)\" by consuming points and \"Suchie Stick\" to draw Tsumo, win the mahjong match with beautiful girls, and steal everyone's \"uniform\" before Milky Pie. ! !\n\nEnjoy two-player mahjong with reward CG, online rankings, and anything goes.","genres":["Card & Board Game"],"developers":["Jaleco"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1640217600,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co84ug.jpg","external_ids":[]},{"igdb_id":280075,"name":"G-Mode Archives 53: Daienkai Buchou","summary":"Aim to be the biggest banquet manager in Japan!! Let's liven up the banquet with partitions and care!\n\n\"Daienkai Buchou\" is a collection of mini-games based on the motif of Japanese salaryman culture \"Banquet\".\n\nLet's play unique and varied mini-games to liven up various banquets such as year-end parties, New Year's parties, cherry blossom viewing, barbecues, etc., and improve the skills of the secretary!\nIn addition to \"Drinkers\" who pour beer into the mug, \"Sashi-turning\" to help with entertainment, etc., all 9 types of mini-games full of seasonal feeling such as \"Cherry Blossom Viewing\", \"Nagashi Somen\" and \"Fireworks Festival\".\n\nAlso, let's collect bingo prizes with bingo tickets that you can get when you get a high score.\nDepending on the degree of collection of prizes and the score of the game, the title of banquet manager will be increased! Please aim for the ultimate title!","genres":["Arcade"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1701907200,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7y7g.jpg","external_ids":[]},{"igdb_id":147145,"name":"G-Mode Archives 29: Zanac","summary":"Zanac is a classic shooting game that made a name for itself in the gaming industry in 1986. This mobile app version of the game recreates the original game, including hidden elements. The game system has been rearranged to make it easier to play. In addition, this title has been improved with the G-Mode archives. The \"Arrange\" mode allows you to fly through the air more intensely and smoothly. The game includes two modes: \"Arrange\" mode, which is more intense and smoother, and \"Original\" mode, where you can enjoy the nostalgic graphics of the time. There are eight types of special weapons. Each weapon has its own unique characteristics, and the power of each weapon increases with successive attacks. The thrill comes from the large number of bullets that the enemy attacks with. Use the special attacks to your advantage to defeat the final boss!","genres":["Shooter"],"developers":["G-MODE"],"publishers":["G-MODE"],"aggregated_rating":null,"release_date":1611792000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5awd.jpg","external_ids":[]},{"igdb_id":353943,"name":"G-Mode Archives+: Spica Adventure","summary":"Glide with your umbrella or use it as a boat to cross the sea, allowing you to perform a variety of actions. Run through all 32 stages while searching for hidden items and bonuses in the stage!","genres":["Platform"],"developers":["G-MODE Corporation"],"publishers":[],"aggregated_rating":null,"release_date":1733356800,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coa3uu.jpg","external_ids":[]},{"igdb_id":340309,"name":"G-Mode Archives+: Tantei Kibukawa Ryousuke Jiken-tan Vol. 16 - Awayuki ha Hi no Kanashimi","summary":"Izuna and Ikurumi were cleaning the Detective Agency. As they were cleaning, they uncovered hidden documents. The documents revealed a tragic event from the past, long kept hidden...","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1737936000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9ojd.jpg","external_ids":[]},{"igdb_id":340668,"name":"G-Mode Archives+: Shin Megami Tensei - Tokyo Requiem","summary":null,"genres":[],"developers":["G-MODE Corporation"],"publishers":["Sega"],"aggregated_rating":null,"release_date":1756425600,"platforms":["Nintendo Switch 2","PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9p8x.jpg","external_ids":[]},{"igdb_id":222136,"name":"G-Mode Archives+: Tantei Kibukawa Ryousuke Jiken-tan Vol. 3 - Shisha no Rakuen","summary":"Shangri-La, an amusement park named after an ideal world In a paradise overflowing with smiles, a banquet in the name of judgment begins.\n\nA few months have passed since the nightmare of the previous work, \"The Kairoukan Murder Case.\" Running out of material, Ikuo visits his friend, Kibukawa.\n\nWhen he returns to the office for the first time in a while, he is approached by Haruna Kikukawa, a beautiful secretary working at the much talked about amusement park, \"Shangri-La.\"\n\nThe request is to provide security and investigate the cult-like threatening letters and creepy pranks that have been sent to the amusement park.\n\nHowever, the president, Hiroshi Kimijima, asks that the matter be handled confidentially and without telling the police.\n\nThough harboring doubts, Ikuo and Izuna decide to head to \"Shangri-La.\"\n\nAn invitation from paradise brought by the beautiful secretary. A banquet called \"judgment\" begins from there.\n\nAre the cheers echoing through the amusement park, named after a utopia, shouts of joy? Or...?","genres":["Adventure","Visual Novel"],"developers":["Genki Co. Ltd."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1620259200,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co68k0.jpg","external_ids":[]},{"igdb_id":222133,"name":"G-Mode Archives+: Megami Tensei Gaiden - Shinyaku Last Bible II - Hajimari no Fukuin","summary":"Boy, be the light that illuminates the world. The gospel of the beginning rings out in the land covered with despair.","genres":["Role-playing (RPG)"],"developers":["Atlus"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1664409600,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9swr.jpg","external_ids":[]},{"igdb_id":222153,"name":"G-Mode Archives 41: Izumi Jiken File Vol. 1 - Shiosai-hen","summary":"The mystery adventure \"Izumi Jiken File\" series is a mystery adventure game that \"deduces the culprit\" based on the situation at the crime scene and the information collected by interviewing.\n\nThe main character, \"Izumi Kido\", is a female editor in charge of the popular novelist \"Kagamitsuki Masamune\".\nAfter chasing Kagamizuki, who abandoned the manuscript and went on a journey, Izumi arrived in Shonan, the western part of Kanagawa Prefecture.\nWhen Izumi finds Kagamizuki and comes on him, Kagamizuki tells with a mysterious face. \" Actually, there was a murder case.\"\n\nThe victim was a 54-year-old company officer, the scene of the incident was under the breakwater of the port, and the cause of death was a head laceration due to a fall.\nFrom the situation at the scene, it looks like an unfortunate accident, but Kagamizuki seems to be convinced that it is a murder.\n\nTaizumi, who took the manuscript, went to the city of Shonan to unravel the truth of the incident.","genres":["Visual Novel"],"developers":["ScriptArts"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1643846400,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7wyx.jpg","external_ids":[]},{"igdb_id":222129,"name":"G-Mode Archives+: Momoko 1200%","summary":"Your heart will race as you watch Momoko grow! Moe & exciting shooting action!\n\n\"Momoko 1200%\" is a remake of Jaleco's action game \"Momoko 120%\", which was previously released for feature phones.\n\nThe main character is Momoko, a 12-year-old girl who falls in love with the Martian prince \"The Greatest Fire Dancer\".\n\nUse light-hearted action to tear and throw the Martians who have come to invade Earth! Tear and throw!\n\nAim for the exit somewhere in the field! Clear the stage by entering the exit or defeating a certain number of enemies!\n\nAs the game progresses, Momoko will grow into a \"15-year-old (high school student)\" or \"18-year-old (working adult)\". Depending on how you behave in the game, the schools and occupations you can go to, and even the special moves you can use will change. What kind of appearance will your Momoko show you?\n\nPay attention to the Mars Prince's preferred type.\nThe closer you get to the type, the more heated the final battle will be, and the greater the bonus score upon clearing. The type changes each time you play, so you can play under various conditions.\n\nUse special moves to destroy obstacles.\nAttack not only enemies but also walls and lockers to gain an advantage in the game! By destroying walls and lockers, you may be able to find a shortcut to the exit or items necessary for Momoko's growth.\n\nMomoko grows according to how you play. Let's grow Momoko by adjusting the number of enemies defeated, the number of items acquired, etc. If you defeat too much or acquire too much, you may become an unintended type...","genres":["Platform","Arcade"],"developers":["Jaleco"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1634774400,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co839e.jpg","external_ids":[]},{"igdb_id":222161,"name":"G-Mode Archives 33: Tetris Diamond","summary":"When talking about feature phone apps, you can never leave out the G-MODE version of \"TETRIS\".\n\nThe \"TETRIS DIAMOND\" version, one of the most popular versions of TETRIS, is back as a G-MODE archive!\n\nThere are 4 types of game modes included.\n\nStarting with the normal \"TETRIS mode\", \"DIAMOND mode\" where you can get a bonus score by erasing the line with \"Diamond Tetrimino\", and \"PUZZLE mode\" that erases all lines using limited blocks. There are various rules.\n\nIn addition to familiar techniques such as \"TETRISTM line erasing\" and \"T-SPIN\", let's aim for a high score by making full use of the new technique \"DIAMOND\" using \"Diamond Tetrimino\"!\n\nPlease enjoy the glittering world of \"TETRIS\" that still does not fade.","genres":["Puzzle"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1617235200,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9krs.jpg","external_ids":[]},{"igdb_id":137769,"name":"G-Mode Archives 01: Flyhight Cloudia","summary":"A JRPG whose story takes place in the sky!\n\nSet in the empty world \"Cloudia\", an orthodox RPG that emphasizes the scenario.\n\nThe story begins when Reinas, the knight of the great power, Kaisersult, marches to the neighboring island \"Badersen\".\n\nIn the world of Claudia, which controls airships and travels between floating islands scattered in the sea of clouds, a dramatic scenario with a variety of events will be developed.\n\nWith a unique combat system (multiweight battle) that can be easily operated, it reproduces speed and exhilarating action at the same time. You can enjoy powerful battle scenes with magic and special moves full of effects.","genres":["Role-playing (RPG)"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1586995200,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5dpg.jpg","external_ids":[]},{"igdb_id":222135,"name":"G-Mode Archives+: Tantei Kibukawa Ryousuke Jiken-tan Vol. 1 - Kamen Gensou Satsujin Jiken","summary":"Online RPG \"Takrimakus\" that dies when you play. Uncover the secret hidden in the game, the truth.\n\nHello, everyone. My name is Ikurumi, a game scenario writer.\n\nThis is the first mobile phone game series that introduces the activities of my friend detective \"Ryosuke Kibukawa\".\n\nThis incident started with an investigation of a rumor of an online game that you will die if you play it. At first, I thought it was a simple request, but really one after another...\n\nChoose an action (command) and enjoy the many mysteries woven by complex human patterns.","genres":["Adventure","Visual Novel"],"developers":["Genki Co. Ltd."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1616025600,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co846n.jpg","external_ids":[]},{"igdb_id":222146,"name":"G-Mode Archives+: Danmaku Kentei Shiken - DaiOuJou-hen","summary":"Dear Danmaku believers, it's time for a deadly trial. Prove your strength in front of your ever-growing opponent.\n\nCave's shooting games are all about danmaku.\nBut how good am I really? A work that answers that question has finally appeared.\n\nThis work, \"Danmaku Kentai Shikan\" is a shooting game that diagnoses your ability to respond to barrage by continuing to fight against opponents who become stronger each time you defeat them.\n\nIn this work, which is called ``DaiOuJou-hen'', the brutal bosses of ``DoDonPachi DaiOuJou'' will block your challenge.\n\nIn addition to the in-game class evaluation, this game also supports online rankings, so you can further hone your skills by competing with users from all over the world.\n\nThose who are not afraid of death, aim for the top of the barrage.","genres":["Shooter","Arcade"],"developers":["CAVE Interactive CO"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1625702400,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7gb0.jpg","external_ids":[]},{"igdb_id":222142,"name":"G-Mode Archives+: Tantei Kibukawa Ryousuke Jiken-tan Vol. 4 - Shirasagi ni Aka no Hane","summary":"This year, red leaves are dancing in the hearts of the white herons left behind. The story of assistant detective Shirasagisu Itsuna and her unknown past.\n\n“I… where was I trying to go? ”\n\nThis story begins with the protagonist, who has lost her memory, waking up in a mountain forest filled with autumn leaves.\n\nThe protagonist is rescued by a high school girl who calls herself ``Taihouin Izuna'' and learns that this is Momoshiro Village, a small village deep in the mountains of A Prefecture.\n\nWho am I? Why did you come to such a remote village? Why did I lose my memory?\n\nAs the protagonist works with Ituna to unravel her memories, she becomes embroiled in the inheritance issues swirling around the village.\n\nThis is a sad and heartbreaking incident that leads her to pursue her career as a detective. In this work, you can enjoy the first and second parts of \"Crimson Feathers on the White Heron\".","genres":["Adventure","Visual Novel"],"developers":["Genki Co. Ltd."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1624492800,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co68k2.jpg","external_ids":[]},{"igdb_id":350578,"name":"G-Mode Archives+: Armored Core Mobile 2","summary":"Build it. Master it. Win with pure will.\nForge the ultimate ARMORED CORE with your own hands.\n\nARMORED CORE MOBILE 2 is a port of the classic title originally released in 2005 for feature phones, part of FromSoftware acclaimed 3D mech action series, ARMORED CORE.","genres":["Simulator"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1750204800,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coa0rs.jpg","external_ids":[]},{"igdb_id":222304,"name":"G-man Invasion","summary":"The G-Men are everywhere! They're invading out dear planet are trying to kill you, kill me, kill everyone! It's your job to stop them!","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1146182400,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5l08.jpg","external_ids":[]},{"igdb_id":222173,"name":"G-Mode Archives 16: Beach Volleyball Girl Shizuku 2: Hishou-hen","summary":"Beach fairies fly to the world!\nTake the victory against the world's powerhouses!\n\nThe second easy-to-use beach volleyball game in which a cheerful high school girl, Shizuku Asagiri, is active.\n\nOne year after the previous work, the \"Cinderella Cup\" that determines the No.1 in the country...\nShizuku and his partner Haruna will go on a world expedition and challenge powerful players from various countries.\nLet's win a hot rally that unfolds with famous places around the world in the background and seize the victory!\n\nIn addition to unique characters and gorgeous swimsuits, this work introduces a \"tanning system\"!\nDepending on the swimsuit you are wearing, you will leave healthy sunburn marks on the water.\nYou can enjoy the combination of swimsuit collection and sunburn marks.","genres":[],"developers":["Mobile & Game Studio, Inc."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1600300800,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co79tg.jpg","external_ids":[]},{"igdb_id":222139,"name":"G-Mode Archives+: Burari Sekai Untei","summary":"Because there is untei!\nTravel around the world on an endless ride.\n\n\"Burari Sekai Untei\" is an endless one-touch action game where you simply advance through the untei surrounding the earth.\n\nThe basic operation is just to press the button and move forward.\n\nHowever, on the way, the Untei's bar may come off, or someone walking on it may step on it, so hold down the button to extend your arm, and use the 1st and 2nd jumps to avoid it.\n\nAs the stage progresses, the scenery changes and the screen scrolling speed increases.\nMy first goal is to circumnavigate the globe. However, you can continue the Untei journey even after completing it until you make a mistake.\n\nLet's challenge the limits of our physical strength to see how many times we can go around the earth!","genres":["Arcade"],"developers":["Happymeal Inc."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1622678400,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co81fh.jpg","external_ids":[]},{"igdb_id":342805,"name":"G-Mode Archives+: Armored Core Mobile Mission","summary":"Gear up, customize your mech, and take on high-stakes missions! Simple yet deep—experience the thrill of mech action on the battlefield!","genres":["Simulator"],"developers":["G-MODE Corporation","FromSoftware"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1745971200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9rv8.jpg","external_ids":[]},{"igdb_id":222159,"name":"G-Mode Archives 35: Magical Fantasista II","summary":"Lost and in search of \"Akashic Records\" ...\nThe second magic synthetic RPG that fights by making use of magic and individuality!\n\nThe second installment of the magical synthetic RPG \"Magical Fantasista\" series.\nThe three honor students of the Imperial Academy of Magic, Kamui, Mercurius, and Yuturna, were involved in a big incident during the final assignment at the end of the school year and decided to go on an adventure to solve it.\n\nThe three of them are good at attribute magic, sword magic, and star magic, each of which has different characteristics, and while synthesizing the magic obtained as a trophy and taking an exam at the dojo, while raising the magic level, they face the crisis of the Nebula country. I'll go.\n\nDungeons where the terrain changes every time you enter, and the ability equipment system where you can enjoy a wide variety of training are also alive and well.\n\nEnjoy the magnificent world of Magical Fantasista, where many powerful enemies are waiting!","genres":[],"developers":["Matrix Software"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1625097600,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7wx4.jpg","external_ids":[]},{"igdb_id":222144,"name":"G-Mode Archives+: Tondemo Nishibuuki 2 - Paris Boutard Rally","summary":"Let's go to a retro world with a bubble-era feel! An unusual journey covering a total length of 10,000 miles between Paris and Boutard.\n\nTondemo Nishibouki 2 Paris-Boutaes Rally is one of the works of the Choicego Computer series, and is a racing action game created in the style of game software released for 8-bit hardware in 1991.\n\nChoha-chan, the main character, has arrived at the western capital, TENJICK, and obtained money and fame. Although he has climbed the ladder of victory at the speed of light, his days are unstimulating. He felt something was missing.\n\nOne day, Hacchan is recognized for his driving skills and is entrusted with something by a racer. It was the right to participate in the world's No.1 phantom race, \"Paris-Boutard Rally\"...!\n\nUse jumps and turbos to step on enemies, climb over cliffs, defeat unique bosses, and aim for victory! Don't miss the story full of bubbly tidbits and the retro-style instruction manual that can be viewed in-game.\n\nThe G-Mode website includes instructions to learn how to make 3D glasses that give a 3D view of the screen.","genres":["Racing"],"developers":["Happymeal Inc."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1629331200,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co827z.jpg","external_ids":[]},{"igdb_id":251464,"name":"G-Mode Archives 45: Chura-umi Monogatari","summary":"A time of peace spun by the gentle sea breeze. An Okinawa life experience for those who are tired of modern times.\n\nChura-umi Monogatari\" is a sequel to the game \"Chura-jima Kurashi\" that simulates life on the southern island.\n\nThe stage of this work is a small island \"Kotsubu Island\" floating in the beautiful sea. The main character, who is tired of living in the city, decided to move after seeing an article on \"Recruitment of Administrators of Kotsubu Island\" on the Internet.\n\nYou will spend a five-day trial period on this island where calm time flows.\n\nAt \"Kotsubu Island\", you can deepen friendship by deepening exchanges with residents, fall in love, and enjoy various leisure (mini-games) such as \"Eisa\", \"Yashi Fruit\" and \"Snorkeling\".\nWhen you finish 5 days, the ending will change depending on the favorability of the residents and the degree of achievement such as mini-games.\n\nA time of peace spun by the gentle sea breeze. Please enjoy your own southern island life.","genres":["Simulator"],"developers":["Seekz"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1678924800,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7x3p.jpg","external_ids":[]},{"igdb_id":260681,"name":"G-Mode Archives+: Saiko Mystery Series Vol.3 - Sin","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":315678,"name":"G-Mode Archives+: Story of Seasons Mobile - Life & Love","summary":"Story of Seasons Mobile - Life & Love has all the core features from the series: farming, ranching, mining, gardening, getting married, and exploring your local village. It was originally available on Docomo phones in Japan before being ported to Steam in September of 2024.","genres":["Role-playing (RPG)","Simulator"],"developers":["G-MODE Corporation"],"publishers":["G-MODE Corporation","Marvelous Inc."],"aggregated_rating":null,"release_date":1725408000,"platforms":["Android","PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coaxzw.jpg","external_ids":[]},{"igdb_id":222158,"name":"G-Mode Archives 36: Beach Volleyball Girl Shizuku 3 - Sekai Taikai-hen","summary":"The shining midsummer sun stimulates the hearts of the fairies. A beach volleyball festival where 16 beautiful girls dance in the air.\n\nThis game is set in Tokyo in 2XX9, one year after the world expedition in the previous work \"Flight Edition\". Shizuku Asagiri, the captain of the Ao High School beach volleyball club, was practicing hard every day with his junior, Suzu Kamijima. It was a pair of Shizuku & Bells who challenged the preliminary round of the world tournament for the reunion with Shizuku's best friend Haruna, but ...?\n\nIn this work, not only new characters, but also nostalgic characters who appeared in past works will participate!\nIn the competition scene, new actions such as \"change of operation character\" and \"combination technique\" are also added.\n\nIn the new \"World Tour Mode\", you can play in pairs with your favorite characters!\n\nEveryone's long-awaited swimsuits and sunburn have also been increased ...! Please enjoy the \"Shizuku World\" that has evolved more brilliantly and boldly.","genres":["Sport"],"developers":["Mobile & Game Studio, Inc."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1626825600,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co78zt.jpg","external_ids":[]},{"igdb_id":100570,"name":"GM Forge - Virtual Tabletop","summary":"GM Forge is a Standalone Virtual Tabletop with competitive features, making it a good affordable alternative. When you buy a copy of GM Forge, your friends join you through their web browser without purchasing a copy. It has all the competitive features in other virtual tabletops, as well as some impressive new innovative ideas built with the average GM in mind.\n\nGM Forge is essentially a sandbox for GMs, and has 6 sample systems with some automation setup for basic play, with the option of downloading additional user created content and mods through the steam workshop!","genres":["Role-playing (RPG)","Simulator","Strategy","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1527638400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1u8t.jpg","external_ids":[]},{"igdb_id":196066,"name":"G-Mode Archives+: DoDonPachi DaiOuJou DX","summary":"“It's better to die.” Confirm it with your own eyes. The most deadly barrage in history spreads in the palm of your hand.\n\n\"DoDonPachi DaiOuJou\" is a vertical scrolling shooting game released in 2002. The game's addictive game system, detailed worldview, and challenging difficulty level have won the support of many users.\n\n``DoDonPachi DaiOuJou DX'', which is being reprinted as an archive this time, is a feature phone ported version of the same work.\n\nNot only can you take on a barrage of threats, as the title suggests, ``Great Death'', but you can also compete with users from all over the world for your score, thanks to online ranking support.\n\nThere are also plenty of elements that allow you to change your play style according to your skill and preference, such as changing the difficulty level, selecting your own aircraft type, and selecting an enhanced type (element doll).\n\nFor both shooting game beginners and bullet hell experts. Challenge the line of death and charm the way of death.","genres":["Shooter","Arcade"],"developers":["CAVE Interactive CO"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1621468800,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5dpk.jpg","external_ids":[]},{"igdb_id":271045,"name":"G-Mode Archives 49: Gregory Horror Show","summary":"Use the abilities of the terrifyingly cute guests, Escape from the mysterious \"Gregory House\" hotel...\n\n\"Gregory Horror Show\" is based on the popular 3DCG horror comedy broadcasted by CS Broadcasting (Kids Station), etc.\nIt is a horror adventure game that was once produced and distributed for feature phones.\n\nPlayers aim to escape from the hotel \"Gregory House\" while solving the mystery by borrowing the ability of the guests by making full use of the special ability \"Soul Exchange\" to transfer to the character.\nThere are also many mini-games with unique characters in the game.\n\nThe ending changes depending on the player's choice and behavior. In addition, the stage of the bonus game after clearing will increase, so you can enjoy it again and again.\nPlease enjoy the hotel life that unfolds with a little scary but cute characters ...","genres":["Adventure"],"developers":["Seekz"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1698278400,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co77kc.jpg","external_ids":[]},{"igdb_id":170501,"name":"G-Mode Archives 17: Flyhight Cloudia III","summary":"The thoughts reflected in the distant sky are the ties that bind a new world... Here and now, all the mysteries will be revealed.","genres":["Role-playing (RPG)"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1600905600,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5dpj.jpg","external_ids":[]},{"igdb_id":222170,"name":"G-Mode Archives 21: Unou Paradise","summary":"I'm snoring in my tired right brain!\nHave fun checking the power of the right brain that controls intuition and inspiration.\n\n\"Unou Paradise\" is a game that fun to play and check the ability of the \"right brain\" that controls human intuition, inspiration, creativity, and image.\n\nAll you need for the operation is 4 buttons, up, down, left and right, and your judgment.\nCheck the ability of the \"right brain\" while doing various tasks (games) such as quickly counting the animals in the group within the time limit and instantly choosing the same picture as the example.\n\nThere are 8 types of tasks (games) included.\nThere is an \"exam\" mode through all assignments and a \"practice\" mode where you can play only one type of assignment.","genres":["Quiz/Trivia"],"developers":["Game Studio"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1603324800,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7uud.jpg","external_ids":[]},{"igdb_id":137617,"name":"G-Mode Archives 06: Shijou Saikyou Miyamoto Julia","summary":"50 years after the end of the Galactic War, the eastern galaxy's bubble economy finally pops. The resulting depression catapults society into a desperate age of class stratification, with workers at the bottom struggling to make ends meet. Julia Miyamoto, the player character, is a temp worker doing her best to get by in the bad economy. She takes a gig at the Galaxy Crisis Management Organization, where she discovers that she has an incredible talent for cleaning up other people's messes, and sets out to prove herself. In the process, she'll find herself drawn into a galaxy-wide conspiracy. This mission-based action RPG has players setting out to clear missions by wiping out waves of enemies as efficiently as possible.","genres":["Role-playing (RPG)"],"developers":["Magical Company"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1593043200,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7szf.jpg","external_ids":[]},{"igdb_id":222148,"name":"G-Mode Archives+: Tantei Kibukawa Ryousuke Jiken-tan Vol. 9 - Samidare ha Nibiiro no Shirabe","summary":"I follow his shadow in the pale dull sky.... Eight years ago, the Kibukawa Detective Agency, another great detective.","genres":["Adventure","Visual Novel"],"developers":["Genki Co. Ltd."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1640304000,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co866e.jpg","external_ids":[]},{"igdb_id":222160,"name":"G-Mode Archives 34: Majoukko Princess","summary":"Mefi, the princess of the devil's castle, was defeated by a hero and lost her place. Let's summon our wisdom, trap humans, and recapture the castle!\n\nThe stage of the story is after the ending of a role-playing game... Mefi, the last boss who has been kicked out of the Devil's Castle, aims to revenge on the hateful heroes!\n\nHowever, there is very little that Mefi, who has lost her magical power, can do.\n\nLet's carry the wooden box placed in the stage to make a scaffolding, and make good use of tricks such as Tsurugiyama and punching gloves to clear it.\n\nWhen you get orbs and treasure chests that appear on a specific stage, you can recover your demon friends and stolen treasures, and the title screen that was alone also includes the lively elements that change more and more.\n\nWill Mefi be able to regain the demon castle stolen by the hero!?","genres":["Platform","Puzzle"],"developers":["Ixill LLC"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1618444800,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7wu0.jpg","external_ids":[]},{"igdb_id":222157,"name":"G-Mode Archives 37: Moe Slot Beach no Shizuku","summary":"Beach fairies appear in the slot! Put out the enchanted \"777\" with your fingers!\n\n\"Moe Slot ☆ Beach no Shizuku\" is a casino-style authentic slot game that incorporates bonus elements such as \"JACK POT\" and \"FACTOR\". During the game, \"Shizuku\" and \"Haruna\" of the \"Beach Volleyball Girl Shizuku\" series will appear, and the adult play will be gorgeous and lovely.\n\nA \"tutorial\" mode that explains the rules in an easy-to-understand manner, which is safe even for beginners, and it can be left alone! Equipped with an \"autoplay\" function that keeps turning the reels automatically.\n\nIf you meet certain conditions, the number of \"Haruna\" costumes will increase, and you can also enjoy dressing up.\n\nPlease enjoy the pleasure of making opportunities and bonuses solid and grabbing a large amount of coins.","genres":["Card & Board Game"],"developers":["Mobile & Game Studio, Inc."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1626825600,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7wxs.jpg","external_ids":[]},{"igdb_id":221780,"name":"G-Mode Archives 04: Beach Volleyball Girl Shizuku","summary":"This two-on-two beach volleyball game has players competing to be the best team possible.The core game is action-based, with a relatively fast pace and special over-the-top super moves for each character. Players can either play in a story mode, where they follow protagonist Shizuku's beach volleyball career, or practice matches against the CPU in a versus mode. A collection mode also lets players dress up the characters in the various swimsuits they've collected.","genres":["Sport"],"developers":["Mobile & Game Studio, Inc."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1588809600,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9kxg.jpg","external_ids":[]},{"igdb_id":222165,"name":"G-Mode Archives 28: Sepas Channel","summary":"If we lose something one by one,\nThe world will fall apart.\n\n\"Sepas Channel\" is an RPG that explores identity.\n\n\"What is the meaning of your existence to be recognized by others?\" \" What is freedom and what is time?\"\n\nA boy who lost his memory, a girl who lost his shadow, and a dog looking for a missing owner.\nSet in a mysterious world with a sci-fi and fantasy atmosphere, a story surrounding the radio broadcast by the mysterious DJ \"Sepaschan\" will unfold.\n\nIf you use the \"channel change\" system that holds the key to the game, you can switch the characters and groups you operate.\n\nPlease use the range of action and abilities of the main characters and cooperate with each other to advance the story.","genres":["Role-playing (RPG)"],"developers":["Seekz"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1611187200,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7vh2.jpg","external_ids":[]},{"igdb_id":222151,"name":"G-Mode Archives 42: Izumi Jiken File Vol. 2 - Tasogare-hen","summary":"Suspicious death under the cold sky. Is this a suicide, or...\nThe second installment of the full-scale mystery adventure series.\n\nThe mystery adventure \"Izumi Jiken File\" series is a mystery adventure game that \"deduces the culprit\" based on the situation at the crime scene and the information collected by interviewing.\n\nThe best-selling author \"Kagamizuki Masamune\" who always goes on a sudden trip, and the new editor \"Izumi Kido\" who is in charge of it.\nSolving the mystery of the code left by Kagamizuki, this time Izumi arrived at Tempozan in Osaka in winter.\n\nBut there was another incident there...\n\nA man who drank coffee with sleeping pills and froze to death leaving a suicide note under the cold sky with a temperature of -5℃.\n\nJust before the estimated time of death, she was suddenly told a breakup story from her who was dating, and there is a motive that led to suicide, but Kagamizuki feels uncomfortable with the victim who is said to have moved to the scene of the discovery of the body without wearing a jacket.\n\nIzumi, who took the manuscript hostage again this time, is stubborn as an editor and approaches the truth of the case.","genres":["Visual Novel"],"developers":["ScriptArts"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1653523200,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7wzw.jpg","external_ids":[]},{"igdb_id":222171,"name":"G-Mode Archives 20: Magical Fantasista","summary":"The first in the series of magical synthetic RPG.\n\nIn order to avoid the pinch of school withdrawal, Holin, a student of the Magic College, travels on an adventure to clear the challenges in the \"Seventh Star System\".\n\nThe \"Seventh Star System\" that Holin ventures is made of the Moon, Mars, Mercury, Jupiter, Venus, Saturn, and the Sun, and the inside of the dungeon changes every time you enter. At the bottom, there is a boss waiting to see through the task.\n\nPlease aim to be a \"fantasista\" in the magical world by developing various magical effects and skills that Holin herself has hidden, and creating powerful magic freely.","genres":["Role-playing (RPG)"],"developers":["Matrix Software"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1602720000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7ujf.jpg","external_ids":[]},{"igdb_id":163238,"name":"G-Mode Archives 15: Chura-jima Kurashi","summary":"Where there is sky and sea, there is a story. Experience the \"slow life\" of your dreams on a southern island!\n\nIt is a game where you can simulate life on the fictional island \"Churajima\" reminiscent of a remote island in Okinawa.\n\n\"I want to be wrapped in the pleasant sound of waves and look at the wide sky on the sandy beach ...\"\nSuch a longing \"slow life\" is waiting for you.\n\nInteract with village residents and tourists, sea fishing, shamisen, hub extermination, Okinawan cuisine, etc.\nYou are free to enjoy the activities unique to the southern island and do anything.\nYou can walk around the island and have various experiences.\n\nWhy don't you relax in \"Chura Island\" with the main character who moved because he was tired of living in the city?","genres":["Simulator"],"developers":["Seekz"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1599696000,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co41at.jpg","external_ids":[]},{"igdb_id":222149,"name":"G-Mode Archives+: Tantei Kibukawa Ryousuke Jiken-tan Vol. 5 - Kurai Hako no Ue","summary":"``What's on top of this...? ”\nA creepy urban legend turns into a nightmare that erodes reality.\n\n\"Late at night, when you call for an elevator on the first floor of a haunted apartment, a ``hako'' slowly descends from the rooftop, which is supposed to be off-limits .\n\nWhen the elevator reaches the first floor and opens its mouth, the entire interior is dyed in bright red...\"\n\nA friend of game scenario writer Masao Ikurumi, a freelance writer who makes a living writing articles on the occult. Mirokuin Renji heads to the apartment building where the urban legend ``Red Elevator'' is believed to have originated.\n\nA strange house full of empty rooms, residents who keep their mouths shut, and the ``incident from eight years ago'' that is said to be cursed if you speak about it.\n\nMirokuin, who pursues the truth hidden in urban legends, confronts his fear that night.","genres":["Adventure","Visual Novel"],"developers":["Genki Co. Ltd."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1627516800,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co68k3.jpg","external_ids":[]},{"igdb_id":222147,"name":"G-Mode Archives+: Tantei Kibukawa Ryousuke Jiken-tan Vol. 8 - Kamen Genei Satsujin Jiken","summary":"This is a Switch port of the mobile port of the DS remaster of the first game in the Tantei Kibukawa Ryousuke Jiken-tan series.\n\nEmbraced by illusions, I put on a mask... A mysterious serial murder case intertwines with the virtual world and the real world.\n\nIn April 2003, 8 months after the first work in the series, \"Masque Fantasy Incident,\"\nMasao Ikuo, the scenario writer for this game, received an invitation to the beta test for the new network game ``Misty Online.''\n\n``Misty Online'' was Japan's first MMOADV, and it was an unprecedented game in which players and their friends solve incidents that occur in a world that closely resembles a real city.\n\nA response from a player playing the role of a corpse who participated in a beta test with Izuna Sagishima of the Igawa Detective Agency and tried to solve a fictional murder case, butdied after falling from a height. Gone...\n\nReality and fantasy. present and past. The countless threads intertwined in a complex and mysterious manner create illusions that envelop people's hearts.","genres":["Adventure","Visual Novel"],"developers":["Genki Co. Ltd."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1635984000,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co68jy.jpg","external_ids":[]},{"igdb_id":222137,"name":"G-Mode Archives+: City Connection Rocket","summary":"Agent Clarice, step on the accelerator! In order to protect the peace of the earth, fly to the world with your favorite car!\n\nCity Connection Rocket, which was previously released for feature phones, is a legitimate sequel to the City Connection series, one of Jaleco's signature works.\n\nClarice, an agent dispatched from the United Nations, boards the new Clariscar and goes on a mission to recover the super-secret documents stolen by the runaway secret society \"Spiritus\".\n\nLet's find the super-classified documents hidden on the stage while handling enemy characters well by making full use of the series's annual \"oil cans\" and \"super rockets\" that can destroy the road with your body.\n\nThere are also many huge bosses such as tanks and battle helicopters, and hidden characters with Jaleco fans.\nAlso pay attention to the cute Clarice that is displayed when the stage is cleared!","genres":["Arcade"],"developers":["Jaleco"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1619568000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7yvf.jpg","external_ids":[]},{"igdb_id":340310,"name":"G-Mode Archives+: Bokujou Monogatari Mobile - Minori no Shima","summary":"While developing a fertile island, aim to grow your own soothing farm!","genres":["Role-playing (RPG)","Simulator"],"developers":["Marvelous"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1743120000,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cob12t.jpg","external_ids":[]},{"igdb_id":227706,"name":"G-Mode Archives+: Megami Tensei Gaiden - Shinyaku Last Bible III - Mugen no Eiyuu","summary":"Gather round, demons. Awaken, heroes. A tale of strange evil passed down from generation to generation on the frontier planet of Damir.\n\nIn addition to the series' customary \"Nakama System\" in which players negotiate with demonic beasts that stand in their way as enemies and, if successful, are lent power, this title also features the \"Obedience Attack,\" in which defeated demonic beasts recognize your power and become your befrienders, enabling you to collect befrienders more efficiently. Together with your unique friends and fellow travelers, you will unravel the truth of the history passed down to you on the planet Damir.","genres":["Role-playing (RPG)"],"developers":["Atlus"],"publishers":["G-MODE Corporation","G-MODE"],"aggregated_rating":null,"release_date":1669248000,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9swq.jpg","external_ids":[]},{"igdb_id":251462,"name":"G-Mode Archives 47: 12Gems","summary":"The time left is only one night.\nSave the world with the power hidden in 12 types of GEM.\n\n\"12GEMs\" is an RPG that uses the power hidden in 12 types of GEMs (jewels) and travels while summoning partners sealed in each GEM.\n\nThe beginning of the story is the aerial castle \"Ganseld\" floating in the sky with the power of GEM.\nThe people living in Ganseld chose themselves as noble people, and the lower world on earth was taught as a place where unclean people and horrible monsters wandered around, and they lived without involvement.\n\nHowever, one day, the GEM that supported Ganseld suddenly scattered to the uncurled ground.\nIn order to prevent the castle from falling, the main character, the boy \"Dino\", received the order of collecting GEM and went to the lower world, but it was a mysterious and mysterious world that was different from what was taught in Ganzeldo ...\n\nUntil Ganzeld crashed, there was only one night left. The fate of the world was entrusted to a boy.","genres":["Role-playing (RPG)"],"developers":["Seekz"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1680739200,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xps.jpg","external_ids":[]},{"igdb_id":222162,"name":"G-Mode Archives 32: Maou Company","summary":"The matter of hell also depends on the money!?\n\nAn RPG where the demons of the lower class aim for the heavenly world with the power of money.\n\nIt is a role-playing game that aims for the heavens with three of his friends, in order to solve the mystery of the item \"Pendulum\" given to him by his uncle, Loki, a lower-class demon and the main character, is a role-playing game that aims for heaven.\n\nIf you save money during the adventure, you can exchange \"engagement (contract)\" with ancient demons with the power of the pendulum.\n\nYou can acquire a variety of \"skills\" from the demons who have engaged, so let's acquire \"skills\" according to your purpose and advance the battle with the enemy advantageously!\nAlso, if you don't understand anything while playing, the explanation will be displayed with one \"Navi\" button, so beginners in the demon world can also enjoy it with confidence.","genres":["Role-playing (RPG)"],"developers":["Matrix Software"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1614816000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7wtv.jpg","external_ids":[]},{"igdb_id":222167,"name":"G-Mode Archives 26: Ore no Sentai Oranger","summary":"I'll make the next hero!\nBecome the commander of the Hero Squadron and protect the peace on Sunday morning!\n\n\"Ore no Sentai Oranger\" is a training simulation game that nurtures the hero squadron.\n\nEach of the five members of the squadron has their own personality, age and gender.\nIn addition to normal physical techniques, I will master \"special moves\" that make use of my specialty, such as a ike-face attack that shoots the hearts of moms.\n\nThe growth of the Oranger was confirmed by the battle with the enemy in the Sunday morning program and sales (children's festival).\n\nCultivate a squadron according to the fan base, and compete with other heroes for the popularity ranking and aim for the first place.\nIt's up to you how you enjoy it. Let's grow your favorite squadron!","genres":["Role-playing (RPG)","Simulator"],"developers":["Matrix Games"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1608768000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9kxh.jpg","external_ids":[]},{"igdb_id":222128,"name":"G-Mode Archives+: Tantei Kibukawa Ryousuke Jiken-tan Vol. 7 - Otonari Keiji no Sousa Memo","summary":"A lost Chihuahua and a kind town police officer. With their ideal image of a detective in their hearts, this mismatched duo races through the city!\n\nA small police box at the crossroads in front of the station, the police station in front of Marihamadai Station.\nA lost puppy was entrusted to Officer Otonari, who was still working at the police box as a police officer at that time.\nThe dog breed is Chihuahua. According to the attached collar, the name is Chappie.\n\nOfficer Otonari, tasked with searching for the owner of Chappie, got an eyewitness testimony that a person who seemed to be the owner entered the Marihama Grand Hotel as a result of the interview in front of the station.\n\nAs long as you know where you are, the solution is near. The man and the dog began their investigation in the hotel lobby, but when a guest came running in with a pale face, they were drawn into further incidents...\n\nOtonari Koichi, 26, is always by your side in heart. To protect the peace of Marihamadai, he runs through the town with his little partner!","genres":["Adventure","Visual Novel"],"developers":["Genki Co. Ltd."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1633564800,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co68k4.jpg","external_ids":[]},{"igdb_id":340672,"name":"G-Mode Archives+: Shin Megami Tensei - 20XX","summary":"A boy thirsting for power, and a girl who has lost her memory, In the twisted world of Valhalla, what destiny awaits them?","genres":["Role-playing (RPG)"],"developers":["G-MODE Corporation","Atlus"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1745452800,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9sx7.jpg","external_ids":[]},{"igdb_id":137538,"name":"G-Mode Archives 03: Kururin Cafe","summary":"Set in a cafe, this is a cute puzzle game where you rotate the cursor to connect and erase 3 or more blocks of the same pattern. Look at the customer's order, erase the block shown on the menu, and clear the screen as you advance in the different levels. Let's satisfy the customers while aiming for a big chain!\n\nThere are three modes available: \"Kururin mode\" where the player must complete orders within the time limit, \"Challenge mode\" a vs. 2-player mode, and \"Tokon mode\" to play endlessly without a time limit.","genres":["Puzzle"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1588204800,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4cfc.jpg","external_ids":[]},{"igdb_id":222154,"name":"G-Mode Archives 40: Kamura - Kamigami to Chigiri Shisha","summary":"\"Kamura - Kamigami to Chigiri Shisha\" is a Japanese-style fantasy RPG that depicts a magnificent story woven by gods and humans on the stage of \"The Land of the Sun\".\n\nThe \"God Drop\" system, which allows you to use unique secret techniques by possessing the gods yourself, and the \"Gogyo Aisei and Soko\" system, which changes damage depending on the attributes of the gods and the attributes of enemies, etc., produce strategic battles.\n\nThere are also plenty of collection elements such as completing the picture book by meeting monsters and gods, and there are also dungeons that appear only under specific conditions.\n\nIn order to stop my brother who fell into darkness, make a contract with the eight million gods in various places and defeat the darkness with the ultimate secret technique!","genres":["Role-playing (RPG)"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1642032000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7wyr.jpg","external_ids":[]},{"igdb_id":271044,"name":"G-Mode Archives 50: Midnight Horror School","summary":"Can you save the school from a crisis with your mysterious powers? Mystery-solving adventure set in a school at midnight.\n\n\"Midnight Horror School\" is an adventure game that was once produced and distributed for feature phones based on 3DCG anime works broadcasted in CS, etc.\n\n\"Midnight Horror School\" where ghosts born from forgotten tools can take classes to create \"wonders\" that prove their existence.\n\nThe player operates the ghost boy \"Hickey\" of the red and blue pencil, chooses two people from his friends according to the situation, organizes a party, and solves the mystery that happens at school.\n\nLet's find a way to find and revive friends who have become \"entity\" (tools and things) and save the school.","genres":["Adventure"],"developers":["Seekz"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1698278400,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co77kb.jpg","external_ids":[]},{"igdb_id":137813,"name":"G-Mode Archives 05: Sukebooo Man","summary":"This side-scrolling extreme sports game puts a side-scrolling spin on the skateboarding craze of the 2000s. Players jump their way through 2D platforming levels, complete with bottomless pits and floating platforms, while collecting burgers. Instead of running through like in a traditional platformer, though, they skate their way through. Players can perform various tricks while flying through the air, racking up points by doing tricks and combos. Players compete for high scores on each level, balancing collecting burgers and performing complex series of tricks to maximize their score.","genres":["Platform","Sport"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1591228800,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7sz3.jpg","external_ids":[]},{"igdb_id":340311,"name":"GMU Blastmaster Battle","summary":"Blast your way to master status in this Bomberman-style game!","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1730332800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9oih.jpg","external_ids":[]},{"igdb_id":340308,"name":"G-Mode Archives+: Tantei Kibukawa Ryousuke Jiken-tan Vol. 15 - Ouma ga toki no Kyoushikyoku","summary":"No one knows what it is or what it looks like...Can you protect the treasure, \"Tokoyo no Watashi\" from robbers?","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1723075200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9ojc.jpg","external_ids":[]},{"igdb_id":386621,"name":"G-Mode Archives+: Armored Core Mobile 3","summary":"Fight on—just to survive. A world of rival powers, with tomorrow unknown.","genres":["Simulator"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1768953600,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cobbye.jpg","external_ids":[]},{"igdb_id":222134,"name":"G-Mode Archives+: Tantei Kibukawa Ryousuke Jiken-tan Vol. 2 - Kairoukan Satsujin Jiken","summary":"The \"Kailoukan\", a strange building surrounded by the sea on all sides. Inside a mansion closed underwater, the curtain rises on a tragedy.\n\nHello, everyone.\nMy name is Ikurumi, a game scenario writer.\n\nDo you know the previous work \"Masked Fantasy Murder Case\"?\nThis time, I would like to introduce an incident that happened in a strange building called \"Kairokan\" six months after that incident.\n\nIt is said that it was built by the former chairman of a famous architectural company as a stranger. This story begins from the place where we are invited to the inauguration event of the mansion.\n\n7 invited guests who visited. The owner of the mansion who will not appear forever. And...\n\nA tragedy that happens in a mansion closed in the sea.\nWho is the culprit? What's the motive? And what is the secret hidden in this building? The truth is, in the dark sea...","genres":["Adventure","Visual Novel"],"developers":["Genki Co. Ltd."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1617840000,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co68jv.jpg","external_ids":[]},{"igdb_id":260682,"name":"G-Mode Archives+: Moe Pro - Moero!! Pro Yakyuu","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":276453,"name":"G-Mode Archives+: Saiko Mystery Series Vol.5 - Cold Rain","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":137678,"name":"G-Mode Archives 08: Pucchin Puzzle","summary":"Pucchin Puzzle provides a variation on the nonogram puzzle genre. Players control a square-shaped dog on a grid; players need to mark specific squares in the grid to reveal pixel-art pictures, following hints on the top and left sides of the screen. The game's puzzles are divided into many different themed worlds, laid out on a world map, with different graphical styles and different costumes for the main characters in each different world.","genres":["Puzzle"],"developers":["G-MODE"],"publishers":["G-MODE"],"aggregated_rating":null,"release_date":1594857600,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7jbh.jpg","external_ids":[]},{"igdb_id":263838,"name":"G-Mode Archives+: Fujidou Ryuunosuke Tantei Nikki Vol.2 - Ougon no Rashinban","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":92736,"name":"GM Rally","summary":null,"genres":["Racing"],"developers":["X-bow Software"],"publishers":["1C Company"],"aggregated_rating":null,"release_date":1257724800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9dey.jpg","external_ids":[]},{"igdb_id":222177,"name":"G-Mode Archives 09: Flyhight Cloudia II","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":147679,"name":"G-Mode Archives 25: Topolon","summary":"TOPOLON is a futuristic action puzzle game that challenges the nano-world. Viruses have the habit of moving back and forth on wires that are strung across the circuitry. Collide and destroy viruses by attracting and splitting them up. Viruses will continue to be generated indefinitely and, if left unattended, will transform into other forms. The key to clearing a stage is the player's ability to make quick decisions and efficient operations. There are three different game modes, three difficulty levels, and a random stage generation function.","genres":["Puzzle","Arcade"],"developers":["Game Studio"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1607558400,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5awc.jpg","external_ids":[]},{"igdb_id":271520,"name":"G-Mode Archives+: Saiko Mystery Series vol. 4 - Innocent Noise","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8c4w.jpg","external_ids":[]},{"igdb_id":253228,"name":"G-Mode Archives+: Game Tengoku","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":256268,"name":"G-Mode Archives+: Idol Janshi Suchie-Pai","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":222155,"name":"G-Mode Archives 39: Flyhight Cloudia IV - Eien no Kizuna","summary":"There is something we must protect with everything we have. We will once again confront the dark clouds of fate that surround us.\n\nFlyhight Claodia series is popular as a full-fledged mobile phone RPG. The latest work \"Flyhight Cloudia 4\" started to happen one after another in the world \"Cloudia\". It depicts the mystery of mysterious events and the bonds of the people involved in it.\n\nThis work supports the first \"wide screen\" function of G-MODE Archives. You can enjoy the adventure of the sky on a powerful large screen instead of a conventional square screen.\n\nThe combat system adopts multi-weight battles that have been inherited in the series.\nIn addition to enjoying highly strategic battles with easy operation, a convenient \"AUTO\" mode is also available. You can enjoy fighting with lower-rated enemies without stress and immerse yourself in the story.","genres":["Role-playing (RPG)"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1632441600,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7tb1.jpg","external_ids":[]},{"igdb_id":266172,"name":"G-Mode Archives+: Momoko no Kasei Bowling - La Mars Cup","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":72429,"name":"GM Hockey 2009","summary":"Do you ever thought of becoming a General Manager for your favorite NHL team? Well, here's your chance...\n\nWith GM Hockey 2009, you can do everything that comes with the job: trade players, put them on waivers, blame your coach for the long losing streak (and even fire him), blame your superstar for not performing enough, and so on.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/pchdheqhqfbxomvfbp9f.jpg","external_ids":[]},{"igdb_id":288717,"name":"G-Mode Archives 13: Rinji Shuuden","summary":"The third entry in the Senbazuru series. A strange event that attacks a passenger on a mysterious train...\n\n\"No... I remember seeing the last train running leaving me behind.\n\nAfter that... That's right... The next train of the last train came into the platform. On the destination panel ... it said \"Temporary last train.\"\n\nA few passengers boarded the last train on a certain line at midnight. The scenery wrapped in darkness. A strange unmanned station. Hydrangea flowers that emerge on the night after the rain in early summer.\n\nThe mysterious atmosphere and the fear of not being able to reach the original world are there...\n\nThe third game of the Senbazuru series. Can you get through this fear...!?","genres":["Visual Novel"],"developers":["Seekz"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1598486400,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8dpd.jpg","external_ids":[]},{"igdb_id":144168,"name":"GMDX","summary":"GMDX takes the classic experience of Deus Ex, and enhances the original material to bring the game forward into the contemporary gaming space, while staying true to the creators’ original vision.","genres":["Shooter","Role-playing (RPG)"],"developers":["Totalitarian"],"publishers":["Totalitarian"],"aggregated_rating":null,"release_date":1360800000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2u84.jpg","external_ids":[]},{"igdb_id":137593,"name":"G-Mode Archives 09: Flyhight Cloudia II","summary":"Fulfilling a promise made a long time ago, to a faraway place in the sky.\n\nThe world above the clouds \"Cloudia\" and the world under the clouds \"Eldia\".\n\nVarious thoughts that connect the two worlds begin to spin a new story...\n\nIn this work, a map display function that helps you capture in the complicated dungeon, a pose function in the event scene, etc. have been added, so that you can enjoy the game more comfortably, and the unique battle system \"Mariu\" that was popular in the previous work Great upgrade of \"Battle\" has been greatly upgraded.\nAttributes (fire/ice/thunder), special skill system, elements of the line separating the vanguard and the rear guard are added, and flashy attack effects using polygons produce powerful battles.","genres":["Role-playing (RPG)"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1596067200,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5dph.jpg","external_ids":[]},{"igdb_id":251473,"name":"G-Mode Archives+: Tantei Kibugawa Ryousuke Jiken-bo vol.11 - Ane no Kabe","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1683590400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cobcpf.jpg","external_ids":[]},{"igdb_id":298527,"name":"G-Mode Archives+: Persona 3: Aegis The First Mission","summary":"The setting is Yakushima in 1999. A story depicting Aegis' unknown past.","genres":["Role-playing (RPG)"],"developers":["Atlus","G-MODE Corporation"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1717632000,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9sx3.jpg","external_ids":[]},{"igdb_id":271519,"name":"G-Mode Archives+: Fujidou Ryuunosuke Tantei Nikki Vol.3 - Ruiiro no Suiren: Gosai Ryuudensetsu Renzoku Satsujin-jiken","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":222140,"name":"G-Mode Archives+: Maou ga Ochiru Hi","summary":"Until the final boss “Demon King” comes…minimum 5 minutes! ? Form the strongest party with your friends and intercept the Demon King!\n\n“The Day the Demon King Falls” is an easy-to-use RPG that allows you to reach the ending in as little as 5 minutes.\n\nAccording to the prophecy of the great god Odin, there is only one year left until the final boss, the Demon King, appears.\n\nGrow your hero through training and adventures within a limited amount of time, and prepare for the coming demon lord.\n\nDon't worry, the main character has 15 friends with unique personalities.\n\nDepending on which characters you raise as your companions, your strategy and tactics in battle will change dramatically, and over 100 different events will occur in various locations such as training grounds and adventure grounds.\n\nFrom events centered around friendship, love, and hate to events that are a bit more sexy, you'll be sure to discover new things every time you play.\nAnd once you get into it, you'll discover the true secret hidden in the \"Demon King\"...","genres":["Role-playing (RPG)"],"developers":["Jaleco"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1622073600,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co80mg.jpg","external_ids":[]},{"igdb_id":222175,"name":"G-Mode Archives 11: Senbazuru","summary":"A horror adventure novel that stimulates the imagination.\nWhat do you pray for with a thousand cranes?\n\nSenbazuru is generally known to be folded for \"prayer\". However, it is said that it has the aspect of a kind of obsession and a desperate wish...\n\nThe main character \"Yuichi Sasaki\" is an ordinary 26-year-old office worker. One morning, Yuichi receives a call from a hospital called Tsukumo General Hospital, which he had never heard of.\n\nIt seems that his lover Mayuri was transported the night before. He hurried to Tsukumo General Hospital, but...\n\nA scenario where you can't predict what happens next, a branching system with \"cards\" that determines the future of the story.\n\nLet's complete various stories surrounding Yuichi and Mayuri.","genres":["Visual Novel"],"developers":["Seekz"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1596672000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8dpa.jpg","external_ids":[]},{"igdb_id":251474,"name":"G-Mode Archives+: Tantei Kibukawa Ryousuke Jiken-bo vol.12 - Nakanai Irainjin","summary":"Their cries reach no one. In a distorted cage, they quietly await the hand of salvation.","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1685577600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6mre.jpg","external_ids":[]},{"igdb_id":251472,"name":"G-Mode Archives+: Saiko Mystery Series vol. 1 - Three, Mittsu no Kioki","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":274663,"name":"G-Mode Archives+: Majin Tensei - Blind Thinker","summary":"Set in the year 20XX in \"Neo Tokyo,\" a symbol of the new era What is the \"demon summoning program\" left behind by the father who disappeared?","genres":["Role-playing (RPG)"],"developers":["G-MODE Corporation","Atlus"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1700092800,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9swt.jpg","external_ids":[]},{"igdb_id":222145,"name":"G-Mode Archives+: Tantei Kibukawa Ryousuke Jiken-tan Vol. 6 - Tsuikou Saku Jiken","summary":"Serial murder case x female secretary disappearance case.\nUncover the hidden truth from two intertwined perspectives.\n\nA series of murders have been occurring mainly in Marihamadai since last year.\nDetective Otonari, who is concerned that the victims have no connection with each other and that there is no clue to solving the case, asks his assistant detective Sagishima Izuna to join the police in their investigation.\n\nMeanwhile, scriptwriter Ikuo Masao, who is almost forced to take on work for the detective agency, receives a request from a certain company to search for someone. The woman who is the subject of the investigation, Hamakawa Yumiko, is a contract employee working in the secretarial department. After working for a month, she suddenly becomes unreachable...\n\nIzuna and Ikuo. The two encounter two cases. What is the truth that awaits them at the end?","genres":["Adventure","Visual Novel"],"developers":["Genki Co. Ltd."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1628640000,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co68k1.jpg","external_ids":[]},{"igdb_id":254928,"name":"G-Mode Archives+: Saiko Mystery Series Vol. 2 - Angel City","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":184550,"name":"Gmtk18: Enter the spaceship","summary":"A platformer without gravity.","genres":["Platform"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":137706,"name":"G-Mode Archives 02: Ai to Roudou no Hibi","summary":"Ai to Roudou no Hibi is a surreal mobile life simulation game where the player takes control of a bear as they get a job and live out their short 31 day life. The bears job consists of rolling a ball to a goal, avoiding holes and obstacles. Failing to do so results in some strong words their boss and a cut to their wages.","genres":["Puzzle","Simulator"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1587600000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7stt.jpg","external_ids":[]},{"igdb_id":266570,"name":"G-Mode Archives+: Megami Ibunroku Persona - Iku no Tou-hen","summary":"Escape from the other dimensional space ruled by demons. Another story of the Persona users.","genres":["Role-playing (RPG)"],"developers":["Atlus"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1694649600,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9swm.jpg","external_ids":[]},{"igdb_id":289246,"name":"GMH: Good Morning Human!","summary":"In a synthwave-inspired universe, achieve the best possible scores by avoiding obstacles in your path. Control and skills will be necessary to complete each level.","genres":["Racing","Indie"],"developers":["W-9000 Studio"],"publishers":["W-9000 Studio"],"aggregated_rating":null,"release_date":1753142400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7u9d.jpg","external_ids":[]},{"igdb_id":222086,"name":"G-Mode Archives 14: Mystia","summary":"In order to save the village crisis, the magical swordsman Meena leaves. An easy-to-play adventure fantasy that everyone wanted.\n\nThe first installment of the adventure fantasy RPG \"mystia\" series set on the Mystia continent.\n\nLet's operate Meena, a magical swordsman, and go on an adventure while defeating monsters and searching for treasures in the field and dungeons!\n\nThe combat system is a simple command battle that pursues operability.\n\nIf you fight with 8 kinds of magical attributes in mind, no matter how strong the opponent is, you may be able to advance the battle to the advantage!\n\nIt is also equipped with a memo function that shows the next purpose and an auto save function, so you can play on the move with peace of mind.\nLet's get rid of the many monsters that attack, solve the mystery, and regain the peace of the village.","genres":["Role-playing (RPG)"],"developers":["Mobile & Game Studio, Inc."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1599091200,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7tsw.jpg","external_ids":[]},{"igdb_id":295849,"name":"G-Mode Archives+: Tantei Kibugawa Ryousuke Jiken-tan Vol. 14 - Rasen no Kan Satsujin Jiken","summary":"Two cases are intertwined in a spiral, Heading toward a sad truth.","genres":["Adventure"],"developers":["G-MODE"],"publishers":["G-MODE"],"aggregated_rating":null,"release_date":1709683200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8v7t.jpg","external_ids":[]},{"igdb_id":142178,"name":"GMOTA","summary":"Fantasy arcade beat em up action awaits you in GMOTA, tear through the hoardes of monsters with powerful melee weapons and special subweapons!","genres":["Shooter","Hack and slash/Beat 'em up"],"developers":["Combined_Kegan"],"publishers":[],"aggregated_rating":null,"release_date":1390089600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4mcj.jpg","external_ids":[]},{"igdb_id":251463,"name":"G-Mode Archives 46: Keitai Shoujo: Koi+Hime - Koi ni Ochita Cinderella-hime","summary":"Those shoes are cursed if a fake wears...? A princess romance adventure in a sound novel style.\n\nWhen I woke up, I was alone in the dark wilderness. In the bag I was holding, there were dolls and glass shoes...\n\nThe main character with glass shoes is attacked by a \"masked man\" on the way and escapes from his life, and meets a girl.\nIn the house where she lives, there are girls with familiar faces...\n\n\"Mobile Phone Girl - Love + Princess - Princess Cinderella Who Fell in Love\" is a love simulation \"Mobile Phone Girl\" Gaiden work. It is a princess-like romance adventure game in a sound novel format that incorporates romantic comedy x suspense x moe elements in the Grimm's fairy tale \"Cinderella\" that everyone knows.\n\nAmong the heroines, the story revolves around \"Sayo Tomoe\" which has a quiet and mysterious atmosphere.\nThe main character \"Hiro Aida\" is attracted to her and gets involved in a certain incident.\nPlease enjoy the mysterious and glamorous world that is a bit different from the brilliant youth story depicted in the previous work.","genres":["Visual Novel"],"developers":["Seekz"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1679529600,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7x47.jpg","external_ids":[]},{"igdb_id":279184,"name":"G-Mode Archives 52: Burger Time","summary":"Drop it, swing it, and shake the pepper! The main character Peter Pepper is working hard to make hamburgers!!\n\n\"Burger Time\" is an arcade game released by Data East in 1982.\nThis work was remade for feature phones in 2006.\n\nPass over the ingredients, drop them down, and complete all the hamburgers to clear the stage!\n\nAvoid wieners and pickles that interfere with the completion of hamburgers by dropping them with the ingredients or interfering them. If you use pepper, you can temporarily stop.\n\nAlso, if you complete a new hamburger during the game, it will be added to the menu list.\nMake various kinds of hamburgers, complete the menu list, and aim to clear all with a high score.","genres":["Arcade"],"developers":["Data East"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1701216000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7y2i.jpg","external_ids":[]},{"igdb_id":279118,"name":"G-Mode Archives+: Tantei Kibukawa Ryousuke Jikenbo Vol. 13 - Tasogare ha Ruri no Tsuioki","summary":"What if I had made a different choice then? The truth and consequences of memory.","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1703030400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7g6l.jpg","external_ids":[]},{"igdb_id":222176,"name":"G-Mode Archives 10: Souhide Series Omatsuri-zukushi","summary":"Let's go out for various fairs every season!\nA collection of festival mini-games full of nostalgia!\n\nYou can enjoy a variety of games such as the festival's classic \"goldfish scooping\" and \"shooting\", as well as \"smart ball\" and \"ring throwing\" as much as you want.\nThere are games that can be played other than opening stores, such as \"Bon Dancing\" at the summer festival and \"Mochitsuki\" at the spring festival. Let's explore every corner of the shrine throughout the year and play all 10 kinds of mini-games.\n\nThe memories of the player playing are written in a diary. I enjoyed shooting... I ate a lot of yakisoba... Let's write a lot of your own thoughts in your diary.","genres":["Arcade"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1596672000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7tin.jpg","external_ids":[]},{"igdb_id":251475,"name":"G-Mode Archives+: Todo Ryuunosuke Tantei Nikki vol.1 - Kohakuiro no Igon: Seiyou Karuta Renzoku Satsujin Jiken","summary":null,"genres":[],"developers":[],"publishers":["althi Inc.","G-MODE"],"aggregated_rating":null,"release_date":1684368000,"platforms":["Nintendo Switch"],"cover_url":null,"external_ids":[]},{"igdb_id":222084,"name":"G-Mode Archives 24: Sangokushi Nendaiki DX","summary":"Expand the territory and unify the world at a good pace.\n\nA country stealing game that you can easily enjoy in the era of the Three Kingdoms!\n\n\"Sangokushi Nendaiki DX\" is a country stealing simulation game set in the era of the Three Kingdoms in China, and can be enjoyed by a wide range of beginners and advanced users.\n\nLet's expand our army's territory while moving units to empty territories and attacking enemy territories, and aim to unify the country with all 5 scenarios.\n\nThe battle is conducted by roulette, and it is a simple one that \"the higher the number wins\".\n\nThe more the force of the unit increases, the larger the number of roulette, and the more the battle becomes dominant.\nPlease command the warlords and reinforcements well and rule the turbulent world with your hands.","genres":["Turn-based strategy (TBS)"],"developers":["G-MODE Corporation"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1606953600,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7v14.jpg","external_ids":[]},{"igdb_id":222132,"name":"G-Mode Archives+: Megami Tensei Gaiden - Shinyaku Last Bible","summary":"Together with the demon, we will open up our destiny. The story that is the end of everything and the beginning of everything.","genres":["Role-playing (RPG)"],"developers":["Atlus"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1657756800,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9sws.jpg","external_ids":[]},{"igdb_id":222138,"name":"G-Mode Archives+: Ninja Jajamaru-kun - Ranbu","summary":"Crimson ninja costumes run through the four seasons!\nUse a variety of actions and rescue Princess Sakura!\n\nThis work, \"Ninja Jajamaru-kun Ranbu\", which was previously released on feature phones, is a\nlegitimate sequel to the \"Ninja Jajamaru-kun\" series, one of Jaleco's representative works.\n\nOn stages themed around the four seasons of spring, summer, fall, and winter, use a variety of items such as \"shurikens,\" \"scrolls,\" and \"flames,\" as well as advanced actions such as \"triangle jump\" and \"tackle,\" to face off against formidable monsters!\n\nBy acquiring the \"souls\" that appear when defeating monsters, the special attack gauge will rise, and when the special attack gauge reaches MAX, it will enter a state of wild dance in which the effects of items become even more powerful!\n\nFurthermore, if you defeat a monster and obtain a soul while in a wild dance state, the wild dance state will continue!\nDon't give the monster a chance to counterattack and dance magnificently in the land of peace!","genres":["Platform","Arcade"],"developers":["Jaleco"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1623888000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co81j5.jpg","external_ids":[]},{"igdb_id":222166,"name":"G-Mode Archives 27: Ninja no Gakko","summary":"Train hard to become a full-fledged ninja!\n\nA collection of mini games set in a ninja school.\n\nPlayers become students at a three-year ninja school, improve their ninjutsu skills through various mini-game-style classes, and take on promotion exams and graduation exams.\n\nYou can play 5 types of mini-games, including ``Shuriken Throw'' where you aim at enemies that appear up, down, left and right, and ``Transformation Technique'' where you memorize frog cries in order.\n\nAs you advance to the next grade, you will be able to take new classes, and the difficulty level of the previous subjects will also increase!!\n\nThere is no limit to the number of classes you can take, so you can take any subject you like as many times as you like, and there are also elements that allow you to complete your career path after graduating from ninja school.","genres":["Arcade"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1610582400,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7vfq.jpg","external_ids":[]},{"igdb_id":278197,"name":"G-Mode Archives 51: Trio the Punch","summary":"\"Trio the Punch\" is an arcade action game released by Data East in 1990.\n\nPlayers choose one of the unique characters, such as \"Santos\" the tough guy, \"Kamakura-kun\" the ninja, and \"Rosesub\" the swordsman.\n\nIf you defeat the enemies in the stage and get a heart, and defeat the boss who appears by collecting all the hearts, you will clear the stage.\n\nOf course, \"Mr. Chin's roulette corner\" is also alive and well.\nIf you draw a hit, you can benefit from increasing your HP and increasing your attack power, so let's push your eyes so that you can get a more effective bonus.","genres":["Hack and slash/Beat 'em up","Arcade"],"developers":["Data East"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1700611200,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xx6.jpg","external_ids":[]},{"igdb_id":222163,"name":"G-Mode Archives 31: Irekae IQ Crossword DX","summary":"Let's replace the letters and align the words!\n\nA new sense of crossword puzzle that makes the pleasure of filling become a habit.\n\nIf you know the words that enter each square from the vertical and horizontal hints, replace the letters!\n\n\"Irekae IQ Crossword DX\" is a crossword puzzle you play by replacing panels.\n\nIf multiple words are completed with a single replacement, you will get a high score!\nIn addition, the player's IQ level is judged according to the time required to clear and the score.\nThere are three types of game modes: \"World Mode\" that clears the stage within the time limit, \"IQ Test Mode\" that determines the player's IQ level, and \"Free Mode\" that solves problems without worrying about the time limit.\n\nYou can participate in each national ranking with your score and IQ index.","genres":["Puzzle"],"developers":["Ixill LLC"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1614211200,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7wti.jpg","external_ids":[]},{"igdb_id":222169,"name":"G-Mode Archives 22: Heracles no Eikou III - Kamigami no Chinmoku","summary":"\"Glory of Heracles\" is an RPG based on Greek mythology.\nSince the release of the first work \"Tojin Makyoden: The Glory of Heracles\" in 1987, it is a popular RPG series that has spun stories with a number of hardware, and this work is the best scenario and famous title in the series.\n\nThe story is independent of other series works, and you can enjoy it alone.\n\nIn a world where day and night change with the passage of time, the people and shops you can meet will change.\n\nWhile confronting strong enemies while making full use of 7 kinds of characteristic weapons and magic learned in temples in various places, in battles with weak enemies, the characters will fight automatically battle only with striking attacks by switching to auto battle mode, so it's stressful. You can play without it.","genres":["Role-playing (RPG)"],"developers":["Data East"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1603929600,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9oje.jpg","external_ids":[]},{"igdb_id":137356,"name":"G-Mode Archives 07: Love Love Knuckle","summary":"Love Love Knuckle is a goofy beat-em-up starring buff men wearing animal heads. Players use their buff animal man to beat up other buff animal men and collect the high-calorie sweets they drop to recover health. In between battles, players can buy upgrades to customize their character, including new heads.","genres":["Hack and slash/Beat 'em up"],"developers":[],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1593648000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7szm.jpg","external_ids":[]},{"igdb_id":222168,"name":"G-Mode Archives 23: Keitai Shoujo","summary":"\"Keitai Shoujo\" is a love simulation game with the aim of making a girlfriend in about 40 days until Christmas with Lin, a girl who became a mobile phone girl.\n\nAs you live your daily school life, let's talk to girls, email and date.\nAt specific events, the PPM (psychedelic pink motion) system that allows you to freely appreciate girls is activated, and the reaction and favorability of girls changes depending on the point of view, and there are also factors such as being reflected in the game.\n\nPlease enjoy the pure love story with the five girls who appear.","genres":["Simulator"],"developers":["Seekz"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1605744000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7uzq.jpg","external_ids":[]},{"igdb_id":179350,"name":"GMZN: The Little Game Experiment","summary":"Just a little platform game experiment with GDevelop for learning purposes.","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":222164,"name":"G-Mode Archives 30: Sorcerian","summary":"Action RPG \"Sorcerian\" that gained popularity as a game for PCs and consumers. This work is a complete port of the mobile app version of \"Advanced Sorcerian\". Redesigned graphics and a variety of effects will enliven your adventure in the fantasy world.\n\nPlayers are free to challenge each scenario by creating a party of 4 people from 4 different classes. Each scenario has a lot of mystery-solving and maze elements, and it's very responsive.\n\nIncludes \"Basic Scenario (Chapter 16)\" including tutorials and G-mode original scenarios, and additional scenarios \"Sengoku Sorcerian (Chapter 5)\" and \"Pyramid Sorcerian (Chapter 5)\".\n\nWith the Sorcerians and your hands, lead a number of stories to a happy ending.","genres":["Role-playing (RPG)","Adventure"],"developers":["Nihon Falcom"],"publishers":["Nihon Falcom","G-MODE Corporation"],"aggregated_rating":null,"release_date":1613606400,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5zjq.jpg","external_ids":[]},{"igdb_id":257757,"name":"G-Mode Archives 48: Dragon x Dragon 2","summary":"What is human charm? What is the truth contained in the holy flower pure bloom...\n\n20 years after the story of DRAGON x DRAGON (Dragon x Dragon). \"Seika Pure Brom\" has been blooming all over the world since some time ago. The scent emitted from the petals heals people's troubles, seals the darkness that falls into the heart, and silence, innocence and \"complete peace\" come.\n\nThe Dark Dragon Genesis, which has reached its end, says, \"In order to return to its original form, people must be released from Pure Brom someday.\"\n\nThe daughter of Willow, the main character of the previous work, \"Adeku\", embarks on a new adventure with the young dragon Lily.\n\nNot only the characters from the previous work, but also the addition of new characters and enemy dragons has further increased the hit-in element.\nAlso, in this work, you can take over the level after returning from the dungeon, making it easier to play.\n\nAdventure with the dragon and solve the mystery that sleeps in the ruins.","genres":["Role-playing (RPG)"],"developers":["Graphic Research Co., Ltd."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1689206400,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xs9.jpg","external_ids":[]},{"igdb_id":222143,"name":"G-Mode Archives+: Ketsui - Kizuna Jigoku-tachi DX","summary":"The bonds I have with my friends will not let go even if I fall into hell. ``New authentic shooting'' where you fight with determination in your heart.\n\nThe year is 2054. Behind the endless wars is a company called ``EVAC Industry'' that exports weapons all over the world. The United Nations begins negotiations with EI, but EI completely rejects the proposal for a ``total ban on arms imports and exports.''\nWith no progress being made, the United Nations abandoned negotiations and secretly decided to intervene with force.\n\nThe mission is to ``destroy EI's weapons and development facilities'' and ``destroy everything related to UN military intervention.'' Even if the operation is successful, they will not be allowed to return home alive. There were four young people who volunteered for this harsh special mission.\n\nSelect an aircraft from two types of teams: TYPE-A (WAY SHOT type) and TYPE-B (LINEAR SHOT type). Normal bullets, lock shots, and bombs. Make full use of 3 types of attack methods and overwhelm the hell of barrage and weapons.\n\nAlso supports online rankings for each difficulty level. Take on the world with determination in your chest, even if you're willing to die.","genres":["Shooter","Arcade"],"developers":["CAVE Interactive CO"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1628121600,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co81p6.jpg","external_ids":[]},{"igdb_id":222130,"name":"G-Mode Archives+: Mikuni Field Combat","summary":"Near-future weapons hit the world of the Three Kingdoms!\nCapture famous heroes and great heroes and invade the world of war!\n\nReleased for feature phones in 2007, \"Mikuni Field Combat\" is a spin-off of Jaleco's shooter game \"Field Combat,\" released for arcades and the Family Computer in 1985.\n\n\"Field Combat\" is a strategic shooter game in which you control the futuristic UFO-type attack aircraft carrier \"Genesis-3\" and capture enemy units with a capture beam to use them as allies while trying to clear stages.\nFor some reason, this futuristic weapon, the \"Genesis-3,\" is storming into the world of \"Romance of the Three Kingdoms\" at the end of the 2nd century!\n\nThe system of capturing enemies with a capture beam and using them as allies remains the same, but more than 130 popular generals familiar to fans of the Romance of the Three Kingdoms appear!\n\nRecruit your favorite generals to your side and survive the wars of mainland China, where intrigue is rife!\n\nOperate the futuristic UFO-type attack aircraft carrier \"Genesis-3\", defeat enemy infantry and obstacles, recruit your favorite generals as your allies, and aim to conquer the stage! Can you survive the wars of mainland China, where political intrigue is swirling?\n\nCapture enemy generals and make them your allies. Use the capture beam to capture enemies and make them your allies! More than 130 popular generals familiar to fans of the Romance of the Three Kingdoms appear!\n\nUse your allies' unique strategies to gain an advantage in battle!\nEach captured general has a strategy (special move) that will help you. Figure out when to use it and advance the battle more advantageously!\n\nOperate the attack mobile aircraft carrier Genesis-3 to occupy the enemy castle at the top of the map. Damage the boss enemy, who is always present on each side, and defeat, capture, or force them to retreat, and the castle gate will open. Enter the castle gate that Genesis-3 opens to proceed to the next stage.\n\nAlso, if you damage famous generals, including boss enemies, and weaken their remaining vitality to 30%, a \"GET!\" message will appear above them, and you will be able to capture them with a capture beam. You can make captured generals your allies after clearing the stage. Capture all the strong enemies and make them your allies to create your own strongest army (you can have up to 14 generals). If your ship, Genesis-3, loses its vitality or the time limit runs out, it will be destroyed and the game will be over. Allied generals who are incapacitated in battles on each stage will not be lost, and will be revived in the next stage or when you continue.\n\nAll allied generals always have one \"strategy.\" A strategy is a powerful technique that can only be activated once per stage.\nWhen the strategy you want to use is lit up in the bottom right of the screen, press the strategy button at the right time to change the course of the battle.\nOnly one strategy can be active at a time, and when a new strategy is activated, the previous one will be overwritten.\nContinuous strategies last for about 30 seconds, and damage-dealing strategies have the following expected damage value: Water Strategy > Fire Strategy > Ambush Strategy.\n\nEach general has a rarity, and is ranked in the following order: GR (Greater Rare) > R (Rare) > S (Special) > N (Normal).\nThe higher the rarity of a general, the less likely they are to appear randomly (as a general excluding bosses), but you can expect a higher level of ability.","genres":["Real Time Strategy (RTS)","Arcade"],"developers":["Jaleco"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1647475200,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8587.jpg","external_ids":[]},{"igdb_id":214712,"name":"G-Mode Archives+: Danmaku Kentei Shiken - Ketsui-Hen","summary":"Part of CAVE's line of mobile bullet dodging tests. Released for DoJa and J2ME mobile devices, then re-released for Nintendo Switch.\n\nBased on the arcade game Ketsui: Kizuna Jigoku Tachi, it weaves the stages and bosses from the original into an endless boss rush. The farther a player gets, the harder the game becomes. Players are challenged to survive as long as possible while racking up a high score. Players are able to pick from the original game's ships.\n\nWhen you think of CAVE's shooting games, you think of \"danmaku\". But how good are you really? The second installment of \"Danmaku Certification Death Test\" will answer that question.\n\nThis \"Danmaku Certification Death Test\" is a shooting game that assesses your ability to deal with danmaku by fighting opponents that get stronger with each defeat.\n\nIn this latest installment, \"Ketsui Edition\", the vicious weapons from \"Ketsui: Kizuna Jogoku Tachi\" will stand in your way.\n\nIn addition to being evaluated by rank in the game, this game also supports online rankings,\nso you can further hone your skills by competing with users from all over the world.\nThose heading to hell on earth, behold the essence of danmaku.","genres":["Arcade"],"developers":["CAVE Interactive CO"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1632960000,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co54rw.jpg","external_ids":[]},{"igdb_id":166078,"name":"G-Mode Archives 19: Magical Drop DX","summary":"Take, throw, and connect the colorful drops! An action puzzle with an exhilarating chain of events!\n\n\"Magical Drop DX\" is an action puzzle game in which characters resembling tarot cards take or throw drops and line up three or more vertically to make them disappear.\n\nIf you line up other drops while a drop is disappearing, you can create a chain and score high points!\nRun left and right across the field to gain an edge over your rivals!\n\nThe game includes a \"Story Mode\" where you can fight against the computer at three different levels (easy, normal, and hard), and a \"Hard Mode\" where you just keep erasing drops on a larger stage than usual.","genres":["Puzzle"],"developers":["Matrix Software"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1602115200,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3u84.jpg","external_ids":[]},{"igdb_id":222156,"name":"G-Mode Archives 38: Mystia2","summary":"The second adventure fantasy drawn with gentle colors. The story of the \"King's Sword\" left by the god of Mystia.\n\n\"mystia2\" is a fantasy RPG set on the continent of Mystia, one year after the previous work \"mystia\".\n\nIn this work, which consists of all three chapters, the party changes for each chapter.\nA large volume of scenarios around the \"King's Sword\" left by the gods and the \"Masty Stone\" that manipulates the gods\nYou can enjoy the world view of \"mystia\" drawn with gentle colors more deeply.\n\nLike the previous work, it is equipped with convenient functions such as a memo function and an automatic save system.\n\nThere are also plenty of rushing elements such as the treasure collection system and \"from the beginning as it is strong\" that comes out after clearing.\nLet's use a wide variety of magic and challenge ourselves to fight against monsters who block our way.","genres":["Role-playing (RPG)"],"developers":["Mobile & Game Studio, Inc."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1631750400,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7wy0.jpg","external_ids":[]},{"igdb_id":221732,"name":"G-Mode Archives 43: Izumi Jiken File Vol. 3 - Yujuku-hen","summary":"Novelist Kagamizuki Masamune was suspected of a murder case while traveling... The third installment of the full-scale mystery adventure series.\n\nThe mystery adventure \"Izumi Jiken File\" series is a mystery adventure game that \"deduces the culprit\" based on the situation at the crime scene and the information collected by interviewing.\n\nThe best-selling author \"Kagamizuki Masamune\" who always goes on a sudden trip, and the new editor \"Izumi Kido\" who is in charge of it. Three days before the deadline for the new manuscript, Izumi, who is heading to Kagamizuki's apartment, receives an email.\n\"It's become a big deal. I want you to help me. Please come to Kirishimayama Ryokan in Kagoshima as soon as possible.\"\nA hot spring inn wrapped in the fresh greenery of Mt. Kirishima. There was a figure of Kagamizuki who was suspected of murder...\n\nIn the open-air bath where there was a murder case, there are employees at the entrance and \"Yoshizu\" around it, so it is impossible to commit the crime from the outside.\n\nIt seems that the five men who used the open-air bath were forced to wait at the inn as suspects of the incident.\nAt this rate, my name as a novelist will be scratched. In order to clear Kagamizuki's suspicion, Izumi challenges to solve the case.","genres":["Visual Novel"],"developers":["ScriptArts"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1665619200,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7x0t.jpg","external_ids":[]},{"igdb_id":222174,"name":"G-Mode Archives 12: Night Hike","summary":"Night Hike is the second entry in the Senbazuru, or Thousand Paper Cranes, series. In the darkness, an unknown fear attacks you.\n\n\"Night Hike'' is an outdoor program that increases people's tolerance for darkness, senses they don't normally use, and a sense of solidarity with others by walking on mountain trails at night without lights.\n\nKeita Iizuka, a budding reporter, is drawn to the unfamiliar term \"night hike\" and joins an outdoor tour in a deserted camp on the outskirts of the Tokyo metropolitan area.\n\nScenarios branch through a \"choice card\" system. An immersive sound production stirs your imagination. In the darkness filled with anxiety and fear, will you be able to welcome the morning again?","genres":["Visual Novel"],"developers":["Seekz"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1597881600,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8dpc.jpg","external_ids":[]},{"igdb_id":222172,"name":"G-Mode Archives 18: Hero Must Die. Director's Cut","summary":"An innovative RPG produced with Mr. Shoji Masuda for the original draft, scenario, and game design, Shunya Yamashita for character design, and Kenji Ito for music and gorgeous famous creators.\nThe hero who defeated the demon king and saved the world in exchange for his life went on a journey to find the woman he loved with five days of life expectancy. Time in the game passes according to the action, and as death approaches, the hero gradually loses his power...\nA multi-scenario where you can experience new discoveries and new developments every time you play back. You can enjoy it as many times as you want due to the multi-ending where the content of the funeral changes depending on what you do before you live.","genres":["Role-playing (RPG)"],"developers":["Pyramid"],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1601510400,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7u5v.jpg","external_ids":[]},{"igdb_id":241041,"name":"G-Mode Archives 44: Dragon x Dragon","summary":"Training × blending × combat. Explore the field and raise the strongest dragon!\n\n\"DRAGON x DRAGON\" is an RPG that captures with three elements: training, blending, and combat.\n\nIn order to defeat the dark dragon \"Genesis\" that plunged the world into chaos, the boy \"Willow\", a descendant of the dragon messenger, grows up with his partner dragon \"Kermes\".\n\nChoose your favorite field from among the many exploration destinations and set off on an adventure.\n\nThe items that can be acquired depending on the field and the attributes of the wild dragon you live in are different, so let's go deep into the field while consulting with the remaining physical strength of \"Kermes\" and the items you have on hand.\n\nThe young \"Kermes\" returns to \"1\" every time you return from the search destination, but you can strengthen your basic ability by mixing the items you got in the middle of the search and giving them to \"Kermes\".\n\nThe effect varies depending on the material to be blended. Try a wide variety of combinations and raise them to be the strongest dragon.","genres":["Role-playing (RPG)"],"developers":["Graphic Research Co., Ltd."],"publishers":["G-MODE Corporation"],"aggregated_rating":null,"release_date":1678233600,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7x2z.jpg","external_ids":[]},{"igdb_id":222131,"name":"G-Mode Archives+: Tantei Kibukawa Ryousuke Jiken-tan Vol. 10 - Eigou-kai Jiken","summary":"The year is 1999. The end of the century is a whirlwind of ominous prophecies and incidents. What is the purpose of the \"Eigo-kai,\" an unidentified organization involved...","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1678320000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co68jx.jpg","external_ids":[]}]