[{"igdb_id":266790,"name":"JJJ","summary":"\"A normal vacation\" the three friends were thinking, when they were drawn into a macabre ending.","genres":["Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1695945600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8if9.jpg","external_ids":[]},{"igdb_id":263483,"name":"J-Jump Arena","summary":"A turn based, jumping elimination game where everything happens all at once! Learn to be precise with your jumps and weapon handling, as well as in the art of outsmarting your opponents! Multiplayer for up to 10 players and single player mode available.","genres":["Fighting","Strategy","Indie"],"developers":["Artbarian Games"],"publishers":["Artbarian Games"],"aggregated_rating":null,"release_date":1761177600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6zqi.jpg","external_ids":[]},{"igdb_id":42106,"name":"J.J. & Jeff","summary":"You can be J.J. Or you can be Jeff. Either way, you're a wacko detective on a kidnap case who stumbles into some hilarious action. Clues and surprises pop up everywhere. Use your head, your foot (kicking things brings great results) and your secret weapon - the spray-can - on 30 different enemies. So grab some french fries for energy and get ready for action!\n\nJ.J. & Jeff Detective Agency are assigned the task of locating a missing rich man, and you can choose either J.J. or Jeff to go on the mission. Your partner doesn't like this one bit, so he decides to make a nuisance of himself along the way. Similar to Adventure Island, you must make your way through several levels, destroying wildlife along the way, but instead of using a hammer, you have three different ways to kill them: jump on or kick them, or when they are walking on the ground, blow gas out of them.","genres":["Platform"],"developers":["Hudson Soft"],"publishers":["Hudson Soft"],"aggregated_rating":null,"release_date":662601600,"platforms":["Wii","TurboGrafx-16/PC Engine"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6xfs.jpg","external_ids":[]},{"igdb_id":48451,"name":"JJ","summary":"JJ is an action game developed and published by Square for the Famicom in 1987. In English, it is sometimes referred to by its long form, Jumpin' Jack, or by its subtitle, Tobidase Daisakusen Part II. The game was only released in Japan.\n\nThe sequel to Tobidase Daisakusen (known in North America as 3-D WorldRunner), JJ is a typical scrolling shooter, but it incorporates a third-person view, where the camera angle is positioned behind the main character. As in the previous title, the main character Jack must travel through various worlds, armed with his laser cannon and jumping ability, to defeat the serpentbeasts who have overrun the planets.\n\nJJ was the last game by Square to utilize the \"3D mode\" and 3D glasses, and was Square's last work before the inception of the popular Final Fantasy franchise. The soundtrack of JJ consists of eight tracks, and all of them are either remixed or reused from the game's prequel, 3-D WorldRunner. The game was scored by Nobuo Uematsu, and is Uematsu's 16th work of video game music composition.","genres":[],"developers":["Square"],"publishers":["Square"],"aggregated_rating":null,"release_date":568512000,"platforms":["Family Computer"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co80kw.jpg","external_ids":[]},{"igdb_id":122897,"name":"Jjat","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2qgj.jpg","external_ids":[]},{"igdb_id":131135,"name":"J & J's Vegas Pack: Black-Jack","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":107407,"name":"JJBoom","summary":"A party game that makes you laugh out loud, in the local or online games, raise everything up, throw them out, use your wisdom to blow your enemies up!","genres":["Strategy","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1536710400,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":null,"external_ids":[]},{"igdb_id":61812,"name":"J.J. Rockets","summary":"Side scrolling action game from Keiji Inafune's development studio Comcept.","genres":["Platform"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/ajw1cp8ezvgxmlrnvkpf.jpg","external_ids":[]},{"igdb_id":237006,"name":"J.J's Tennis Tour","summary":"J.J is a rookie on the world tennis tour.\nTravel around the world playing in the first to 5 tournaments against the top opponents.\nPractice in the training zone to earn coins and customize J.J’s appearance as well as levelling up your skills to stand a better chance against your opponents.\nJ.J will make friends on the tour in the pre-tournament lobby as well as having to learn to deal with trash talking from opponents.\nCan you help J.J become the world champion?","genres":["Sport","Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":40193,"name":"J. J. Squawkers","summary":"J. J. Squawkers doesn't have much of story, other than brief crawl text telling the villagers fell into spells of some sort. The short intro where two birds get attacked with the house exploding to pieces is apparently why they're going on rampage to beat up everything in their eyes, so fair enough.\n\nYou play as these two angry birds named Ani Karasukun and Ototo Karasukun (altogether standing for \"crow brothers\" in Japanese, by the way). Along with basic ability to run and jump, they have standard projectiles attack to shoot out the enemies or destroy the objects. Your default weapon at the beginning is a handful of tomatoes. You can exchange them with better weapons by picking up the item dropped by specific enemies; available weapons include pumpkins, watermelon seeds, screws and springboards with red sneakers. Each weapon differs from others about its usefulness; for instance, screws are thrown in straight direction until they meet obstacles or the end of screen, making it easy to deal with enemies far away. On the other hand, watermelon seeds can't reach such a long distance, but they're thrown in several shots simultaneously spread in various angles, effective against the multiple enemies approaching in wide range.","genres":["Platform"],"developers":["Athena"],"publishers":[],"aggregated_rating":null,"release_date":728524800,"platforms":["Arcade"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4or3.jpg","external_ids":[]},{"igdb_id":273177,"name":"JJ Duke Nukem 3D","summary":"Duke crashes down in a stolen alien cruiser but this time he is a little closer to home. Look for the new features. There's a special powerup called the SuperDukePak and a new actors amongst other things.","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":891302400,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]}]