[{"igdb_id":7324,"name":"NHL 15","summary":"12 PLAYER NHL COLLISION PHYSICS\nFor the first time in any sports game, real-world physics affects every player through every on-ice collision with the new 12 Player NHL Collision Physics. Utilizing the power of the next generation consoles, and building off the critically-acclaimed NHL Collision Physics system, every player on the ice is governed by physics at all times. Feel the hard-hitting chaos of NHL hockey through true-to-life secondary collisions, net scrambles and player pileups, capturing the desperation of every shift.\n\nREAL PUCK PHYSICS\nThe puck is one of the most complex items in the game to authentically replicate and it finally gets its due in NHL 15. Completely rebuilt puck physics result in a more realistic feel to every puck interaction. Everything on the ice, including the ice surface itself, is live which leads to the unpredictable and authentic puck spins, rolls and bounces seen in a real NHL game.\n\nAUTHENTIC PLAYER & EQUIPMENT MODELS\nThe Next Generation Hockey Player has been rebuilt from the ice up. Now player models have three distinct layers - the body, equipment, and jersey. Each layer interacts independently, making every contact with the puck or other players even more realistic. Dynamic Cloth technology adds an extra layer of realism as it reacts to the player’s movement as they explode up the ice, helping bring the speed of the game to life.\n\nUNPRECEDENTED PLAYER LIKENESS\nPowered by the same technology that brought the most realistic representation of the athlete to EA SPORTS UFC, NHL 15 delivers groundbreaking player likeness, emotion and animation. From the strides a player takes to get up the ice to the emotion on their face after scoring a game winning goal, the players are as real as they’ve ever been.\n\nSUPERSTAR SKILL STICK\nNow all the tools of an NHL superstar are in your hands. The revolutionary Skill Stick has evolved to give even more control to the player. Protect the puck, receive passes without breaking stride, and discover an arsenal of sweet new dekes, all with an intuitive right stick control scheme that is easy to use but packed with depth.\n\nAUTHENTIC ARENAS\nThere is no feeling like being there, and we are giving you the best seats in the house. The power of the next-gen consoles finally allows the NHL franchise to capture every detail of an NHL arena. Unique arena elements from 19,000+ seat capacities to lighting and player entrance tunnels are captured with a level of detail not possible on the previous generation. Now those home games will truly feel like home.\n\nNEW COMMENTARY TEAM\nNew voices for a new generation. NHL 15 welcomes the NBC Sports commentary team of Mike 'Doc' Emrick and Eddie Olczyk to the broadcast booth. TSN analyst Ray Ferraro will provide game insights at ice level. Combined with Real Life Broadcast Integration that will feature real-world pre-game video commentary with Doc and Eddie set against in-game visuals, NHL 15 takes a revolutionary step forward in sports videogames; where the lines between the real world of sport broadcast and the game are blurred.\n\nNBC SPORTS GAME DAY PRESENTATION\nThe most realistic broadcast package in a video game to-date is possible because of a new partnership with NBC Sports. Set the scene with the NHL on NBC crew welcoming you to the city during the game intros and immerse yourself in an experience that matches what you see on television with NHL on NBC graphics and branding.\n\nLIVING CROWDS\nNHL 15 sets a new standard in videogames with over 9,000 individual crowd models with 4x the animations of previous generations. Take a look through the glass and you’ll see fans hold up signs with your name on them, costume wearing superfans, or even sections full of team rivals rooting against you. Feel their behavior change after dropping the gloves, landing a big hit, or scoring a clutch goal. The crowd is alive.\n\nVISION AI\nAn elevated level of player intelligence, Vision AI features evolved awareness with players reading and reacting to potential plays. Scoring area recognition, pass anticipation, and enhanced team breakouts all improve the flow of the game.","genres":["Simulator","Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":62.22222222222222,"release_date":1410220800,"platforms":["PlayStation 3","PlayStation 4","Xbox 360","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1o2y.jpg","external_ids":[]},{"igdb_id":214675,"name":"NHL 23","summary":"NHL 23 is an ice hockey simulation video game developed by EA Vancouver and published by EA Sports. It is the 32nd instalment in the NHL video game series","genres":["Sport"],"developers":["EA Vancouver"],"publishers":["EA Sports"],"aggregated_rating":76.75,"release_date":1665705600,"platforms":["Xbox Series X|S","PlayStation 4","PlayStation 5","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co55mk.jpg","external_ids":[]},{"igdb_id":172557,"name":"NHL 22: X-Factor Edition","summary":"The X-Factor Edition includes:\n- Dual Entitlement\n- Up to 10 HUT Diamond Player Choice Packs (2 per month for 5 months)\n- 5 World of Chel X-Factor Zone Ability Unlocks\n- 2 Be a Pro X-Factor Slot Unlocks, XP Boost, and Bonus Trait Points\n- 5 Unlocked Hockey Bags\n- 3-Days Early Access\n- HUT X-Factor Player Choice Pack (2 of 25)\n- HUT X-Factor Power-Up Starter Pack\n- Up to 4 HUT X-Factor Power Up Packs (1 per month for 4 months, starting in November 2021)","genres":["Sport"],"developers":["EA Vancouver"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":1633910400,"platforms":["Xbox Series X|S","PlayStation 4","PlayStation 5","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3yvq.jpg","external_ids":[]},{"igdb_id":4047,"name":"NHL Hitz 2003","summary":"The NHL Hitz series has been on all next-generation consoles since the early days of the 32-bit era. With that said, its no surprise that Midway brings NHL Hitz 20-03 to GameCube, with Hitz' trademark 'On-Fire Mode', over-the-top animations, and fully 3D crowds. Like all NHL Hitz games, NHL Hitz 20-03 features gameplay modes for up to 6 players, in-game fights and hidden teams, players and stadiums. The game will also feature Create-A-Player modes and mini-games.","genres":["Sport"],"developers":["Black Box Games","Exient Entertainment"],"publishers":["Midway Games"],"aggregated_rating":60.0,"release_date":1032134400,"platforms":["Xbox","Nintendo GameCube","Game Boy Advance","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co20mr.jpg","external_ids":[]},{"igdb_id":4048,"name":"NHL Hitz Pro","summary":"NHL Hitz Pro is an ice hockey video game developed by Next Level Games and published by Midway Games. It's the third and final game of the NHL Hitz series. It was released on September 25, 2003, for the PlayStation 2, Nintendo GameCube, and Xbox. Unlike the previous titles in the series, this game has 5-on-5 gameplay instead of the usual 3-on-3 gameplay with the earlier titles. Despite that fact, however, the game does not include penalty shots, and it is still an arcade-type hockey game like its predecessors. It also has, as the name suggests, a lot of hard hitting, appealing more often to casual hockey fans than hardcore ones. The cover athlete of the game is Nicklas Lidström, and features commentary from Tim Kitzrow[1] and Harry Teinowitz.\n\nUnlike many other hockey video games of the 21st century, NHL Hitz Pro had the IIHF license, enabling it to use the jerseys of the Olympic hockey teams.\n\nThe game also has many game modes, one of the most popular being the \"Pick-Up Hockey\" game mode, where the game would turn into either a roller, street, or pond hockey match-up between two amateur teams.","genres":["Sport"],"developers":["Next Level Games"],"publishers":["Midway Games"],"aggregated_rating":80.0,"release_date":1064448000,"platforms":["Xbox","Nintendo GameCube","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6ue4.jpg","external_ids":[]},{"igdb_id":382113,"name":"NHL Puck Rush","summary":null,"genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":122110,"name":"NHK Academy: Space School - Math 4th Grade Part 1","summary":"Educational software released in Japan on the Family Computer with a custom cartridge that requires a Konami QTài, Q太, adapter to function.\n1 of 7 games known to use the adapter.\n\nIt is supposed to be used alongside a textbook to answer the questions given in parts of the game.","genres":["Quiz/Trivia"],"developers":[],"publishers":["Konami"],"aggregated_rating":null,"release_date":631065600,"platforms":["Family Computer"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co741d.jpg","external_ids":[]},{"igdb_id":122114,"name":"NHK Academy: Space School - Math 6th Grade Part 1","summary":"Educational software released in Japan on the Family Computer with a custom cartridge that needs the Konami QTài, Q太, adapter to function.\n1 of 7 games known to use the adapter.\n\nIt is supposed to be used alongside a textbook to answer the questions given in parts of the game.","genres":["Quiz/Trivia"],"developers":[],"publishers":["Konami"],"aggregated_rating":null,"release_date":631065600,"platforms":["Family Computer"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co741g.jpg","external_ids":[]},{"igdb_id":8840,"name":"NHL 2K2","summary":"NHL 2K is a series of hockey games by 2K Sports for the Dreamcast, PlayStation 2, Nintendo GameCube, Xbox, iPhone, Xbox 360, PlayStation 3, and the Wii. Initially discontinued after the release of NHL 2K11 in 2010, the brand was revived on mobile devices in 2014. The games are officially licensed from the National Hockey League and NHL Players Association. While its games were released on consoles, its main competition was EA Sports' NHL video games.","genres":["Sport"],"developers":["Visual Concepts"],"publishers":["Sega"],"aggregated_rating":81.0,"release_date":1013644800,"platforms":["Dreamcast"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co417s.jpg","external_ids":[]},{"igdb_id":359477,"name":"NHL 26","summary":null,"genres":["Simulator","Sport"],"developers":["EA Vancouver"],"publishers":["EA Sports"],"aggregated_rating":74.0,"release_date":1757635200,"platforms":["Xbox Series X|S","PlayStation 5"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coa8gi.jpg","external_ids":[]},{"igdb_id":817,"name":"NHL 97","summary":"1997 edition of EA's NHL sport simulation series. Improvements in this edition come mostly in the graphical arena, with a refined version of the \"virtual stadium\" system that adds new camera angles (including the classical top-down one strangely missing from NHL 96), and polygonal players instead of the bitmap-based ones with motion-captured animations.\n\nOther extras include multiplayer support for up to 8 players through network or Gravis's GrIP system, the option to create new players and trade them around, and the usual amount of EA sports licensed multimedia flair, including an interesting \"Goalie Mask Viewer\" which lets you observe the elaboratedly decorated helmets of 30 goalies.","genres":["Sport"],"developers":["Visual Concepts"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":846720000,"platforms":["Sega Saturn","PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gpg.jpg","external_ids":[{"category":null,"store":null,"uid":"18663","url":"https://www.giantbomb.com/games/3030-18663/"},{"category":14,"store":null,"uid":"17105","url":"https://www.twitch.tv/directory/game/NHL 97"}]},{"igdb_id":20434,"name":"NHL FaceOff 2003","summary":"NHL FaceOff 2003 is an ice hockey video game made by SolWorks and published by Sony Computer Entertainment of America, released on the PlayStation 2. It features then-Colorado Avalanche defenceman Rob Blake on its cover. Mike Emrick and Darren Pang return from the game's predecessor, NHL FaceOff 2001, to provide commentary.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1036454400,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2iei.jpg","external_ids":[]},{"igdb_id":4046,"name":"NHL Hitz 2002","summary":"Midway introduces hockey with its no-rules twist that is seen in NFL Blitz. Hockey may have fewer rules than football, but NHL Hitz features hard-hitting action and very simple 3-on-3 gameplay. The game has franchise modes for a created team that you can design along with championship and exhibition modes. You earn attribute points and credits that you can use to unlock items and improve your players along the way. There are several mini-games and extras hidden deep in the game for you to unlock. NHL Hitz is Midway's attempt at making the most action-packed hockey game to ever hit consoles.","genres":["Sport"],"developers":["Black Box Games"],"publishers":["Midway Games"],"aggregated_rating":60.0,"release_date":1001289600,"platforms":["Xbox","Nintendo GameCube","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gvp.jpg","external_ids":[]},{"igdb_id":4044,"name":"NHL 06","summary":"Hit the ice with EA Sports' NHL 06 for the XBOX. This entry in the NHL series builds on the 2005 version by adding new rules and an up to date rooster that includes just about every big name in the National Hockey League. NHL 06 includes everything from NHL 05, including the revamped shooting controls. New to the 2006 version is the use of the left analog stick for deking, which in hockey terms means to dodge and fake out defenders. The right analog stick is used to pull off fancy moves like a spin or between the legs pass. These fancy moves will distract goalkeepers, giving the gamer an opening to shoot. The drawback to these moves is that only superstar characters can pull them off regularly. The game includes many of the traditional hockey game modes, including dynasty mode. In dynasty mode, gamers will control their own hockey team and have to deal with outside pressures, sponsors, and more while trying to meet the team philosophy, which is different for each team. Other modes include single season, leagues and tournaments, quick game, and online play. The graphics of NHL 06 are top notch. This time, they've been tweaked to accurately show character size differences. The defense players and goalkeepers, who are traditionally larger players, actually look larger, while the smaller and faster scorers are indeed a little thinner and smaller. This is just one small change that adds to the overall amazing gameplay of NHL 06.","genres":["Simulator","Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":88.0,"release_date":1125964800,"platforms":["Xbox","Nintendo GameCube","PC (Microsoft Windows)","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2guy.jpg","external_ids":[]},{"igdb_id":953,"name":"NHL 10","summary":"NHL 10 is a video game in the NHL series developed and released by EA Canada and published by EA Sports, and is the 19th game in the series. The game debuted at Hockey Fest '09, a three-day interactive festival celebrating the sport of hockey and the Los Angeles Kings, which took place in downtown Los Angeles from August 28 to 30.[1]\n\nIts tagline is \"Good Old Hockey,\" with television ads featuring the Stompin' Tom Connors favourite \"The Hockey Song\" (also known as \"The Good Old Hockey Game\"). It is the first game in the NHL series by EA Sports not to get a PC release and the first since NHL 2001 not to get a PlayStation 2 release. On October 1, 2011, all online services for NHL 10 were discontinued.[2]","genres":["Simulator","Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":84.0,"release_date":1252972800,"platforms":["PlayStation 3","Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1xq5.jpg","external_ids":[{"category":null,"store":null,"uid":"66acd000-77fe-1000-9115-d802454108ba","url":"https://marketplace.xbox.com//en-US/Product/NHL-10/66acd000-77fe-1000-9115-d802454108ba"},{"category":null,"store":null,"uid":"xbox36066acd000-77fe-1000-9115-d802454108ba","url":"http://marketplace.xbox.com/en-US/Product/NHL-10/66acd000-77fe-1000-9115-d802454108ba"},{"category":null,"store":null,"uid":"26458","url":"https://www.giantbomb.com/games/3030-26458/"},{"category":null,"store":null,"uid":"23910","url":"https://www.twitch.tv/directory/game/NHL%2010"}]},{"igdb_id":36847,"name":"NHL 18","summary":"EA SPORTS NHL 18 delivers the speed, creativity and action of today's young NHL superstars with new Creative Attack controls and an all-new Defensive Skill Stick. Play the fast-paced, arcade-inspired 3-on-3 NHL THREES mode, or create your own custom 32nd NHL team with the new Expansion Draft. Do it all with the most co-op and competitive multiplayer options ever in an EA SPORTS NHL game.","genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":76.125,"release_date":1505433600,"platforms":["PlayStation 4","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1xpz.jpg","external_ids":[]},{"igdb_id":212791,"name":"NHRA Championship Drag Racing: Speed for All - Ultimate Edition","summary":"For the ultra die-hard NHRA fan, this Ultimate Edition delivers to you not only everything showcased in the Deluxe Edition, but also loads of additional content available for NHRA Championship Drag Racing: Speed for All.","genres":["Racing","Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1661472000,"platforms":["Xbox Series X|S","Xbox One","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co54sk.jpg","external_ids":[]},{"igdb_id":128388,"name":"NHL 20: Ultimate Edition","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1wmz.jpg","external_ids":[]},{"igdb_id":856,"name":"NHL 2003","summary":"In order to become a superstar in the NHL, you'll need a combination of speed, power, and moves. NHL 2003 gives you the abilities of all the stars and teams of pro hockey, but it's up to you to master them. This time, you have full control of the puck with Dynamic Deke Control and accurate puck physics. The game also features four game modes, including Create-a-Player, enhanced sounds and animations, and dynamic camera work to bring you closer to the NHL action.","genres":["Simulator","Sport"],"developers":["EA Sports"],"publishers":["EA Sports"],"aggregated_rating":40.0,"release_date":1033344000,"platforms":["Xbox","Nintendo GameCube","PC (Microsoft Windows)","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2guu.jpg","external_ids":[]},{"igdb_id":44843,"name":"NHL Rock the Rink","summary":"A three-on-three arcade-style hockey game which makes use of the license granted by the NHL and its players' association to create a lightning-fast arcade style game as opposed to the more nuanced aspects of an NHL simulation.","genres":["Sport"],"developers":[],"publishers":["Electronic Arts"],"aggregated_rating":null,"release_date":954288000,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2i2h.jpg","external_ids":[]},{"igdb_id":48400,"name":"NHL: 19 Legends Edition","summary":"NHL: 19 Legends Edition includes: \n \n5 HUT Gold packs. \nChoice of 1 NHL 19 Cover Athlete HUT item. \nChoice of 1 HUT Legend item. \nChoice of 1 HUT Rookie item.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1lh7.jpg","external_ids":[]},{"igdb_id":20433,"name":"NHL FaceOff 2001","summary":"This year's edition allows you to compete against legendary players including Gordie Howe, Bobby Hull, Phil Esposito, and Marcel Dionne. New Jersey Devils announcers Mike Emrick & Darren Pang call the games.\n\nThere is an exhibition mode for up to eight players with the Multitap, a season mode for multiple players, playoff mode, tournament mode, a practice option, and shoot-out mode, that helps to sharpen your breakaway and deke moves.\n\nAlso new this year are the updated rosters of all NHL teams including expansion teams Columbus BlueJackets and Minnesota Wild.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":968112000,"platforms":["PlayStation","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ied.jpg","external_ids":[]},{"igdb_id":122111,"name":"NHK Academy: Space School - Math 4th Grade Part 2","summary":"Educational software released in Japan on the Family Computer with a custom cartridge that requires a Konami QTài, Q太, adapter to function.\n1 of 7 games known to use the adapter.\n\nIt is supposed to be used alongside a textbook to answer the questions given in parts of the game.","genres":["Quiz/Trivia"],"developers":[],"publishers":["Konami"],"aggregated_rating":null,"release_date":631065600,"platforms":["Family Computer"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co741e.jpg","external_ids":[]},{"igdb_id":165197,"name":"NHL 22","summary":"Powered by Frostbite, EA SPORTS NHL 22 gets the superstar treatment. For the first time ever, experience EA SPORTS NHL on one of the industry’s most powerful game engines bringing unrivaled visual detail to every hit, deke and shot. Superstar X-Factors lets you feel the personality and power of NHL superstars with an all-new ability system that unlocks the unique skills of the league’s most elite players. Authentic to real player skill and style, the stars of the NHL truly come to life in EA SPORTS NHL 22 making their time on ice more influential than ever . From HUT to World of Chel, Superstar X-Factors brings new class based strategy to every game mode. EA SPORTS NHL 22 is an all new game for a new generation, giving you more ways to play and compete than ever before. This is breakthrough hockey.","genres":["Sport"],"developers":["EA Vancouver"],"publishers":["EA Sports"],"aggregated_rating":74.66666666666667,"release_date":1633910400,"platforms":["Xbox Series X|S","PlayStation 4","PlayStation 5","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3m03.jpg","external_ids":[]},{"igdb_id":261413,"name":"NHL 24","summary":"NHL 24’s all-new gameplay features bring authentic on-ice action to life. Experience the rush and fatigue of a high-pressure game with the Exhaust Engine, where sustained pressure in the attack zone leads to new game-changing effects like goalie fatigue that slows the netminder’s reaction time the more they get worn down with offensive action; change the momentum with Physics-Based Contact as you break the glass and send players into the bench with big body checks; and get unparalleled player command with the new Vision Passing System and Total Control Skill Moves. Chel is more connected than ever with cross-play in all online team play modes, along with HUT Moments, which lets you recreate classic moments in hockey history and today’s biggest plays. Adding an extra layer of authenticity, Flex Moments introduces 75+ new goal celebrations, and a wholly refreshed presentation complements an enriched crowd atmosphere that makes playing the game feel like you’re at the game.","genres":["Sport"],"developers":["EA Vancouver"],"publishers":["EA Sports"],"aggregated_rating":80.33333333333333,"release_date":1696550400,"platforms":["Xbox Series X|S","PlayStation 4","PlayStation 5","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6xmf.jpg","external_ids":[]},{"igdb_id":146213,"name":"NHL 94 Rewind","summary":"EA SPORTS is throwing it back with NHL 94 Rewind. It’s today’s teams and today’s rosters with controls and graphics from 1994. Relive one of the greatest hockey video games of all time with your favourite clubs and stars of today.","genres":["Simulator","Sport"],"developers":["EA Vancouver"],"publishers":["Electronic Arts"],"aggregated_rating":null,"release_date":1606953600,"platforms":["PlayStation 4","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ygt.jpg","external_ids":[]},{"igdb_id":5405,"name":"NHL '94","summary":"Aside from the licenses, the gameplay for this edition sees for the first time the inclusion of the devastating one-timer shot, but to keep forwards (literally) in check, defenders also feature harder body checks, with new animations. For an additional challenge, players can also choose to control the goalkeeper manually. A popular feature in previous editions, fighting is completely removed from the game. Game modes include exhibition games (or \"regular season\" in-game), playoffs (best of one or best of seven) and an all new shoot-out mode. The main options remain basically the same couple since the establishment of the series - period length (5, 10 or 20 minutes), line changes (off, manual or the new automatic mode) and penalties. (off, on, on but no offsides).","genres":["Simulator","Sport"],"developers":["EA Canada","High Score Productions","Park Place Productions"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":749433600,"platforms":["Super Nintendo Entertainment System","Sega Mega Drive/Genesis","DOS","Sega CD"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gvn.jpg","external_ids":[]},{"igdb_id":4045,"name":"NHL 2K3","summary":"NHL 2K3 is a hockey video game developed for the GameCube, PlayStation 2, and Xbox by Treyarch and published by Sega in the United States, and Atari in Europe. It features Jeremy Roenick on the cover.\n\nNHL 2K3 utilizes ESPN's presentation and was the first hockey game developed to utilize the Xbox Live online service. The rosters are from the 2002–2003 NHL season.","genres":["Sport"],"developers":["Treyarch"],"publishers":["Sega","Atari Europe"],"aggregated_rating":null,"release_date":1036886400,"platforms":["Xbox","Nintendo GameCube","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2hmq.jpg","external_ids":[{"category":3,"store":null,"uid":"15523","url":"https://www.giantbomb.com/games/3030-15523/"}]},{"igdb_id":7119,"name":"NHL 2K8","summary":"NHL 2K8 is an ice hockey video game made by 2K Sports, and published on the PlayStation 3, PlayStation 2 and Xbox 360 consoles. It features Ottawa Senators centre Jason Spezza on its cover. Bob Cole and Harry Neale return from NHL 2K6 and NHL 2K7 to provide commentary. \n \nNew features in the game include an all-new faceoff system, an all new ProStick system involving the right skill stick to deke, take faceoffs and puck handle, and an all new system called Superstar Combo moves, which mimics real-life dekes and fakes by actual NHL players to use in the game with the push of a button. Also, the game included an all-new goaltending system, with all-new graphics and movement. \n \nNHL 2K8 introduced the new Reebok Edge jerseys through the use of a code found on the 2K Sports website.","genres":["Sport"],"developers":["Kush Games","Visual Concepts"],"publishers":["2K Sports"],"aggregated_rating":70.25,"release_date":1189382400,"platforms":["PlayStation 3","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2hmp.jpg","external_ids":[]},{"igdb_id":315729,"name":"NHL 25: Deluxe Edition","summary":"EA SPORTS NHL 25 is powered by ICE-Q, a new gameplay intelligence system that gives you the time and space to control every inch of the ice. Experience true hockey intelligence.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1727395200,"platforms":["Xbox Series X|S","PlayStation 5"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8rzk.jpg","external_ids":[]},{"igdb_id":5964,"name":"NHL 07","summary":"NHL 07 is an ice hockey video game, released in 2006 as the successor to NHL 06. The game improved the series' gameplay with more realistic features, such as stickhandling and a wider variety of controller schemes. The Xbox 360 version features a completely revamped game and graphics engine from the predecessor, while the other versions are left behind with the old engine. It is the only game in the series to have a PSP version, the last installment to be released on Xbox, and the first installment to be released on Xbox 360.","genres":["Simulator","Sport"],"developers":["EA Canada","EA Montreal"],"publishers":["EA Sports"],"aggregated_rating":73.8,"release_date":1158019200,"platforms":["Xbox","PC (Microsoft Windows)","PlayStation Portable","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1xsv.jpg","external_ids":[]},{"igdb_id":122112,"name":"NHK Academy: Space School - Math 5th Grade Part 1","summary":"Educational software released in Japan on the Family Computer with a custom cartridge that needs the Konami QTài, Q太, adapter to function.\n1 of 7 games known to use the adapter.\n\nIt is supposed to be used alongside a textbook to answer the questions given in parts of the game.","genres":["Quiz/Trivia"],"developers":[],"publishers":["Konami"],"aggregated_rating":null,"release_date":631065600,"platforms":["Family Computer"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co741c.jpg","external_ids":[]},{"igdb_id":19464,"name":"NHL 17","summary":"All-new game modes, new and deeper experiences in fan-favorite modes, and the best on-ice gameplay ever make NHL 17 the most exciting EA SPORTS NHL game to date. Live out your hockey fantasy in all-new Draft Champions and World Cup of Hockey game modes, own every zone with authentic goaltenders, new Net Battles on offense and defense, and bone-crushing Collision Physics. Take your team to the next level in the most customizable EA SPORTS Hockey League ever and bring your game to life with dozens of thrilling new goal celebrations. No matter how you play the game, NHL 17 lets you shape your legacy on and off the ice.","genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":79.72222222222223,"release_date":1473724800,"platforms":["PlayStation 4","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2qu9.jpg","external_ids":[]},{"igdb_id":166971,"name":"NHL 21: Ultimate Edition","summary":"In EA SPORTS NHL 20, your favorite NHL stars now look and feel more authentic with new Signature Shots and over 45 new shot types that make every attack a threat. A new broadcast package celebrates your biggest plays as you take on all-new game modes, including the new winner-take-all Eliminator mode where you play solo or team up with friends to take down the competition.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xju.jpg","external_ids":[]},{"igdb_id":138538,"name":"NHL 21","summary":"In NHL 21 it’s the most creative, inventive and fearless players that are worth celebrating. Carve your path to superstardom in an expanded \"Be A Pro\" mode and go down as one of the league’s greatest. On the ice, change up your attack with all new moves, dekes, dangles and evasive maneuvers, inspired by the league’s most groundbreaking innovators. Recognize creativity, recognize revolutionary, recognize future. Recognize greatness.","genres":["Simulator","Sport"],"developers":["EA Vancouver"],"publishers":["Electronic Arts"],"aggregated_rating":74.125,"release_date":1602806400,"platforms":["PlayStation 4","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2z9q.jpg","external_ids":[]},{"igdb_id":8839,"name":"NHL 2K","summary":"NHL 2K is a series of hockey games by Visual Concepts for the Dreamcast, PlayStation 2, Nintendo GameCube, Xbox, iPhone, Xbox 360, PlayStation 3, and the Wii. Initially discontinued after the release of NHL 2K11 in 2010, the brand was revived on mobile devices in 2014. The games are officially licensed from the National Hockey League and NHL Players Association. While its games were released on consoles, its main competition was EA Sports' NHL video games.","genres":["Simulator","Sport"],"developers":["Visual Concepts"],"publishers":["Sega Sports R&D"],"aggregated_rating":null,"release_date":950054400,"platforms":["Dreamcast"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5xxu.jpg","external_ids":[]},{"igdb_id":3562,"name":"NHL Blades of Steel '99","summary":"Non-stop NHL action! The newest all-star in the Konami Sports Series hits the ice! Get ready for a whole new game! NHL Blades of Steel '99 hits the ice with all the NHL players, stats and action. Motion captured animation, adjustable team strategies and fully detailed NHL stadiums with real ice conditions. Updated 98-99 rosters called out by NHL TV announcer Randy Hahn. Trade players and sign free agents. Full season stat tracking and league leaders.","genres":["Sport"],"developers":["Konami"],"publishers":["Konami"],"aggregated_rating":null,"release_date":923270400,"platforms":["Nintendo 64"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co47ye.jpg","external_ids":[]},{"igdb_id":11075,"name":"NHL 16","summary":"NHL 16 is a hockey video game developed by EA Canada and published by EA Sports. It is the 25th installment of the NHL series and was released on September 15, 2015 in North America and September 17 and 18 in Europe, Australia and New Zealand. The game was released on PlayStation 4 and Xbox One, with a separate release for PlayStation 3 and Xbox 360 titled NHL: Legacy Edition. Jonathan Toews of the Chicago Blackhawks is the official cover athlete, marking his second appearance on an NHL cover, following NHL 11. Upon release, NHL 16 received positive reviews and was declared an improvement over NHL 15 by critics.","genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":78.77777777777777,"release_date":1442275200,"platforms":["PlayStation 4","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1o33.jpg","external_ids":[]},{"igdb_id":813,"name":"NHL 2000","summary":"You can choose from all of the NHL teams, including the expansion Atlanta Thrashers. Play an Exhibition game to work on your tactics and strategies, and when you are ready for long-term competition, try to endure an 82-game Season, or just skip straight to the Playoffs. While in the game, you will have to learn when to make line changes and determine when it's a good time to pull the goalie. In addition to these tactical decisions, you must also deal with penalties and infractions including offsides, two-line passes, and icing. However, you can customize the game by turning off certain rules and setting the referee's strictness. In addition, there are three different difficulty levels. Will you be able to claim the Stanley Cup? The only way to find out is by playing NHL 2000.","genres":["Platform","Simulator","Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":936057600,"platforms":["PC (Microsoft Windows)","PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co629f.jpg","external_ids":[]},{"igdb_id":954,"name":"NHL 11","summary":"Celebrating its 20th year, the franchise that captured 22 Sports Game of the Year awards has raised the bar yet again with NHL 11. Powered by an all-new Real-Time Physics Engine, NHL 11 lets you create highlight reel moments as you experience adrenaline-pumping NHL action with bigger hits, broken sticks, and faster dangles. Whether you're beginning your career in the Canadian Hockey League, dominating rivals in the EA SPORTS Hockey League, or assembling Hockey's Ultimate Team, any moment can be a WOW moment with NHL 11.","genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":88.0,"release_date":1283817600,"platforms":["PlayStation 3","Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1xq4.jpg","external_ids":[]},{"igdb_id":314499,"name":"NHL 25","summary":"From the modernized skating of Next-Gen Vision Control and an overhaul of Chel’s AI player movement to authentic Reactive Action animations — experience true hockey intelligence.","genres":["Simulator","Sport"],"developers":["EA Vancouver"],"publishers":["EA Sports"],"aggregated_rating":73.66666666666667,"release_date":1728000000,"platforms":["Xbox Series X|S","PlayStation 5"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8pwh.jpg","external_ids":[]},{"igdb_id":212785,"name":"NHRA Championship Drag Racing: Speed for All","summary":"NHRA is back – bigger and better than ever! Immerse yourself into the teams, tracks, tuning, and strategies, then strap into the driver’s seat in your ultimate quest to become the Champion among the true Beasts of the Strip. Key Game Features: • 5 NHRA…","genres":["Racing","Sport"],"developers":["Team6 Game Studios"],"publishers":["GameMill Entertainment"],"aggregated_rating":null,"release_date":1661472000,"platforms":["Xbox Series X|S","PlayStation 4","PC (Microsoft Windows)","PlayStation 5","Xbox One","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7i0a.jpg","external_ids":[]},{"igdb_id":103500,"name":"NHL 19","summary":"In NHL 19, hockey returns to its roots by taking the game to the great outdoors. Play on outdoor rinks and journey from the pond to the pros in new and returning modes. Compete with and against over 200 of the greatest hockey legends, including Wayne Gretzky, all powered by the cutting-edge gameplay technology Real Player Motion Tech. RPM Tech delivers explosive-edge skating with faster acceleration, and more responsiveness. A new collision physics system also adds bigger, jaw-dropping hits. Introducing World of CHEL, a brand new game hub of new and returning Create-A-Character modes united under a single reward system. Design your character and progress to earn custom gear, equipment and over 900 new apparel customization options, including lifestyle clothing like hoodies, jackets, winter knits and more. Express yourself with a unique look and personalize your game with brand new player classes and unique player traits that give you the freedom to look, feel and play the way you want.","genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":78.8,"release_date":1536883200,"platforms":["PlayStation 4","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2qua.jpg","external_ids":[]},{"igdb_id":214668,"name":"NHL 23: X-Factor Edition","summary":"in the NHL 23 X-Factor Edition you receive:\n- HUT Spotlight Master Item Choice Pack (1 of 10)\n- Dual Entitlement\n- 3-Days Early Access\n- 4600 NHL Points\n- X-Factor Women's HUT Choice Pack\n- HUT X-Factor Player Choice Pack\n- HUT X-Factor Power-Up Starter Pack","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1665446400,"platforms":["Xbox Series X|S","PlayStation 4","PlayStation 5","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co55ml.jpg","external_ids":[]},{"igdb_id":128387,"name":"NHL 20: Deluxe Edition","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1wmy.jpg","external_ids":[]},{"igdb_id":80334,"name":"NHL Eastside Hockey Manager 2005","summary":"NHL Eastside Hockey Manager 2005's database features over 20 playable leagues, with more than 3000 teams and in excess of 30000 players and staff. The new 2D snapshot view allows coaches to watch the action unfold second-by-second, making key decisions on the fly. As usual, all competition rules and regulations are fully represented for the coming season. Brand new in 2005 are Training Camps. Team can now prepare for the new season, trying out new lines, different tactics, and players hoping to crack the roster.\n\nThe North American version includes the rosters from the end of August (2005) and NHL CBA. Owners of the European or digital version received this as a free season update.","genres":["Simulator","Sport"],"developers":["Sports Interactive"],"publishers":["SEGA of America, Inc.","Russobit-M","Sega Europe Ltd."],"aggregated_rating":null,"release_date":1117152000,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7vpe.jpg","external_ids":[]},{"igdb_id":57932,"name":"NHL 5-On-5 2006","summary":"A hockey game for mobile phones.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/m1dprolvecxh79hl5zmq.jpg","external_ids":[]},{"igdb_id":80068,"name":"NHRA Drag Racing","summary":"A drag racing simulation featuring races based on 22 real events against 19 professional drag racers.","genres":["Racing"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/osssapuz8rqvqeepj2iq.jpg","external_ids":[]},{"igdb_id":140900,"name":"NHL 21: Deluxe Edition","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1598572800,"platforms":["PlayStation 4","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2oro.jpg","external_ids":[]},{"igdb_id":173114,"name":"NHL 17: Deluxe Edition","summary":"All-new game modes, new and deeper experiences in fan-favorite modes, and the best on-ice gameplay ever make NHL 17 the most exciting EA SPORTS NHL game to date.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xjs.jpg","external_ids":[]},{"igdb_id":3003,"name":"NHL 14","summary":"Summary: Unlock the highest level of hockey aggression, speed and skill. Deliver hits with the NHL Collision Physics, built from FIFA’s Player Impact Engine. Drop your gloves with the new Enforcer Engine, powered by EA SPORTS Fight Night technology. Dangle defenders with new One-Touch Dekes and expd experience enhanced speed and control with the second season of True Performance Skating.","genres":["Simulator","Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":78.33333333333333,"release_date":1378771200,"platforms":["PlayStation 3","Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2qu8.jpg","external_ids":[{"category":11,"store":null,"uid":"xbox36066acd000-77fe-1000-9115-d802454109be","url":"http://marketplace.xbox.com/en-US/Product/NHL-14/66acd000-77fe-1000-9115-d802454109be"},{"category":null,"store":null,"uid":"42387","url":"https://www.giantbomb.com/games/3030-42387/"},{"category":null,"store":null,"uid":"323193","url":"https://www.twitch.tv/directory/game/NHL 14"},{"category":null,"store":null,"uid":"66acd000-77fe-1000-9115-d802454109be","url":"https://marketplace.xbox.com//en-US/Product/NHL-14/66acd000-77fe-1000-9115-d802454109be"}]},{"igdb_id":263060,"name":"NHRA Championship Drag Racing: Speed for All - Electro Blitz Pack","summary":"Featuring eye-catching neon circuitry laid-to-black, the Electro Blitz Pack is loaded with a Top Fuel Car, a Driver's Suit, a Parachute, and a Vehicle-Hauler each with a design sure to be noticed.","genres":["Racing"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1661472000,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]},{"igdb_id":128897,"name":"NHL 2K","summary":"NHL 2K was an ice hockey video game, developed by Virtuos in association with Visual Concepts and published by 2K Sports. The game was released on October 23, 2014. It is the 12th game in the NHL 2K series and the first since 2010's NHL 2K11.","genres":["Sport"],"developers":["2K China"],"publishers":["2K Sports"],"aggregated_rating":null,"release_date":1414022400,"platforms":["Android","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5ce9.jpg","external_ids":[]},{"igdb_id":24116,"name":"NHL Championship 2000","summary":null,"genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":60.0,"release_date":938563200,"platforms":["PC (Microsoft Windows)","PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2hb4.jpg","external_ids":[]},{"igdb_id":210034,"name":"NHRA Drag Racing: Pro Stock Cars & Trucks","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":210033,"name":"NHRA Drag Racing: Quarter Mile Showdown","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":85230,"name":"NHL 18: Young Stars Edition","summary":"Get the EA SPORTS NHL 18 Young Stars Edition now and receive 2800 NHL 18 Points in Hockey Ultimate Team, an Adidas Custom HUT Jersey and the Connor McDavid EASHL Celebration.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/vvnxc9re60htxieyf0cc.jpg","external_ids":[]},{"igdb_id":45121,"name":"NHL All-Star Hockey '98","summary":"NHL All-Star Hockey '98 is a Sega Saturn exclusive. It was commissioned by SEGA after Virgin decided not to make another incarnation of NHL Powerplay for the SAT.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":880934400,"platforms":["Sega Saturn"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gvr.jpg","external_ids":[]},{"igdb_id":5068,"name":"NHL 2K9","summary":"NHL 2K9 is an ice hockey simulation made by 2K Sports, part of the NHL 2K series, and published on the PlayStation 2, PlayStation 3, Wii, and Xbox 360 consoles. It features New York Rangers, former Columbus Blue Jackets left winger Rick Nash on its cover.[citation needed]","genres":["Simulator","Sport"],"developers":["Visual Concepts"],"publishers":["2K Sports","Take-Two Interactive"],"aggregated_rating":70.75,"release_date":1220832000,"platforms":["PlayStation 3","Wii","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gv1.jpg","external_ids":[]},{"igdb_id":74037,"name":"NHL Eastside Hockey Manager","summary":"The first commercial release in the Eastside Hockey Manager series, also the first to feature the NHL license.","genres":["Simulator","Sport","Strategy"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2i2i.jpg","external_ids":[]},{"igdb_id":78037,"name":"NHRA Drag Racing 2","summary":"An officially licensed simulation of NHRA top fuel and funny car drag racing. It includes the entire 25 event NHRA circuit and 30 of the top drag racing teams. Tune your car against changing weather conditions and view detailed telemetry via Racepak, the same software used by all the NHRA teams. The game supports force feedback devices and includes competitive online play.","genres":["Racing","Simulator","Sport"],"developers":["Motorsims"],"publishers":["ValuSoft","ValuMedia"],"aggregated_rating":null,"release_date":973036800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cobdg1.jpg","external_ids":[]},{"igdb_id":3561,"name":"NHL 99","summary":"Battle along the boards, feed the open man, patrol the ice! Game Features: *Beginner lever - pick up and play!; *Coaching strategies from Stanley Cup Winner Marc Crawford; *Commentary by Bill Clement; *5 game modes; *18 top international teams; *Updated 1998 roster-expansion Nashville Predators.","genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":907113600,"platforms":["Nintendo 64","PC (Microsoft Windows)","PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gow.jpg","external_ids":[{"category":null,"store":null,"uid":"7122","url":"https://www.twitch.tv/directory/game/NHL 99"},{"category":null,"store":null,"uid":"7774","url":"https://www.giantbomb.com/games/3030-7774/"}]},{"igdb_id":61636,"name":"NHL 19: Ultimate Edition","summary":"NHL 19 Ultimate Edition includes: \n \n8 HUT Gold packs. \nChoice of 1 NHL 19 Cover Athlete HUT item. \nChoice of 1 HUT Legend item. \nChoice of 1 HUT Rookie item.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2iee.jpg","external_ids":[]},{"igdb_id":85253,"name":"NHL 18: Young Stars Deluxe Edition","summary":"Get the EA SPORTS NHL 18 Young Stars Deluxe Edition now and receive 5850 NHL 18 Points in Hockey Ultimate Team, an Adidas Custom HUT Jersey and the Connor McDavid EASHL Celebration. EA SPORTS NHL 18 delivers the creativity of today's young NHL superstars through new Creative Attack controls and the all-new Defensive Skill Stick. \n \nPlay the fast-paced, arcade-inspired 3-on-3 EA SPORTS NHL THREES mode, or reshape the league entirely with the new Expansion Draft and create your own custom 32nd NHL team. Do it all with the most co-op and competitive multiplayer options ever delivered in an EA SPORTS NHL game.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/iustsgpnic0kfubgtgnt.jpg","external_ids":[]},{"igdb_id":43761,"name":"NHL Powerplay '98","summary":"NHL POWERPLAY '98 offers all the NHL teams. Not only are real NHL teams with real NHL players available, but several Olympic teams also make an appearance. The graphics are also one of the many strong points here polygonal player models move exceptionally well and possess some realistic animations, including high-sticking swipes and some hard-hitting body checks. Basically, if you've seen it in a real NHL game, chances are you'll see it in NHL POWERPLAY '98. You can also take on a friend in the Versus mode to see who's the king of the ice.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":876355200,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ksr.jpg","external_ids":[]},{"igdb_id":45126,"name":"NHL Rivals 2004","summary":"NHL Rivals 2004 is the first NHL title for the Xbox, developed by MGS (Microsoft Game Studios), and the second title developed under the XSN Sports banner - the development team's first foray into hockey on console.\n\nAt the time of its release, the visuals in this game were its major selling point, with each player's face mapped onto their model ingame. The game features a fully animated polygonal crowd, tons of motion-captured animations, NHL licensed players, teams and arenas. The look and feel of the game are much different than games like EA's NHL series.\n\nThis was also the first hockey game on Xbox that let players play in online tournaments and leagues over Xbox Live and XSN Sports. Rosters were updated as the season went on via content downloads over Xbox Live, though were only available for a limited time.\n\nRivals 2004 features the gameplay mode of 3-on-3 pond hockey. This pickup-game style of play is meant for those who prefer instant action, and it can also be played over Xbox Live. Players can connect and join in on a recreational game intended to simulate the fun pickup games that many people played as kids.\n\nThe gameplay is arcade-like, with fast play and quick passing via a button or in specific directions using the analog stick.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1071705600,"platforms":["Xbox"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gou.jpg","external_ids":[]},{"igdb_id":3563,"name":"NHL Breakaway 98","summary":"Hit the ice with NHL Breakaway 98! All 26 NHL teams and over 600 players from the NHLPA. Variable player sizes, from hulking defensemen down to speedy wingers. Playbook based AI, so teams play their actual styles - forecheck, trap, dump and chase. Five gameplay modes: Exhibition, Season, Playoffs, Practice and Shoot-Out modes. Create players - assigned name actually appears on the player's jersey. Season wins provide bonus points which improve coaching, player development, injury therapies and more.","genres":["Sport"],"developers":["Iguana Entertainment"],"publishers":["Acclaim Entertainment"],"aggregated_rating":null,"release_date":888451200,"platforms":["Nintendo 64","PC (Microsoft Windows)","Sega Saturn","PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2hb3.jpg","external_ids":[{"category":null,"store":null,"uid":"19417","url":"https://www.giantbomb.com/games/3030-19417/"},{"category":null,"store":null,"uid":"17768","url":"https://www.twitch.tv/directory/game/NHL%20Breakaway%2098"}]},{"igdb_id":19732,"name":"NHL All-Star Hockey","summary":"NHL All-Star Hockey is a Sports game, developed by Gray Matter and published by Sega, which was released in 1995.","genres":["Sport"],"developers":["Gray Matter"],"publishers":["Sega of America"],"aggregated_rating":null,"release_date":820368000,"platforms":["Sega Game Gear","Sega Saturn"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gp6.jpg","external_ids":[]},{"igdb_id":952,"name":"NHL 12","summary":"NHL 12 is an ice hockey video game developed by EA Canada and published by EA Sports. The game was released between September 8–13, 2011, in Australia, New Zealand, Europe, and North America. The game was featured in the 2011 Electronic Entertainment Expo (E3). Steven Stamkos was announced as the game's cover athlete on June 22, 2011, at the NHL Awards Show in Las Vegas, Nevada. The game notably includes more interactive goalies (i.e. players can have real contact with the goalies and vice versa, and the goalies and skaters may fight each other), better physics engine, improved Be a Pro mode, and the ability to play the 2011 NHL Winter Classic.\n\nLike NHL 11, Gary Thorne (play-by-play) and Bill Clement (color) provide commentary for NHL 12.","genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":87.0,"release_date":1315353600,"platforms":["PlayStation 3","Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1xq3.jpg","external_ids":[{"category":11,"store":null,"uid":"xbox36066acd000-77fe-1000-9115-d80245410964","url":"http://marketplace.xbox.com/en-US/Product/NHL-12/66acd000-77fe-1000-9115-d80245410964"},{"category":14,"store":null,"uid":"30300","url":"https://www.twitch.tv/directory/game/NHL%2012"},{"category":3,"store":null,"uid":"33698","url":"https://www.giantbomb.com/games/3030-33698/"},{"category":null,"store":null,"uid":"66acd000-77fe-1000-9115-d80245410964","url":"https://marketplace.xbox.com//en-US/Product/NHL-12/66acd000-77fe-1000-9115-d80245410964"}]},{"igdb_id":248585,"name":"NHL 2002","summary":"Hit the ice and experience the thrill of professional hockey with NHL 2002 for the Game Boy Advance. This fast-paced sports game brings all the action and excitement of the NHL to your handheld, offering a rich and engaging hockey experience on the go.\n\nPlay as your favorite NHL teams and players, all faithfully recreated with updated rosters and realistic stats. The game features multiple modes, including Season, Playoffs, and Exhibition, allowing you to jump right into the action or work your way through an entire hockey season.\n\nNHL 2002 boasts smooth gameplay with intuitive controls that make passing, shooting, and checking a breeze. The advanced AI ensures challenging opponents that adapt to your playing style, providing a dynamic and competitive experience. Master the ice with precision skating, strategic playmaking, and powerful slap shots.\n\nTake on friends in multiplayer mode using the Game Link Cable, and prove who the ultimate hockey champion is. The game's detailed graphics and authentic sound effects, including commentary and crowd reactions, create an immersive atmosphere that captures the intensity of NHL hockey.\n\nWith its fast action, strategic depth, and portable convenience, NHL 2002 for the Game Boy Advance is a must-have for any hockey fan. Lace up your skates, grab your stick, and get ready to score big in NHL 2002!","genres":["Sport"],"developers":[],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":1015459200,"platforms":["Game Boy Advance"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6h2b.jpg","external_ids":[]},{"igdb_id":5071,"name":"NHL Slapshot","summary":"Wayne Gretzky is the game's cover athlete, and also serves as the in-game coach for beginners. This marked the first time that the EA Sports NHL series featured a retired ice hockey player on the cover as well as Wayne Gretzky's first appearance on a cover of a video game since 2006","genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":77.33333333333333,"release_date":1283817600,"platforms":["Wii"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1un1.jpg","external_ids":[]},{"igdb_id":122115,"name":"NHK Academy: Space School - Math 6th Grade Part 2","summary":"Educational software released in Japan on the Family Computer with a custom cartridge that needs the Konami QTài, Q太, adapter to function.\n1 of 7 games known to use the adapter.\n\nIt is supposed to be used alongside a textbook to answer the questions given in parts of the game.","genres":["Quiz/Trivia"],"developers":[],"publishers":["Konami"],"aggregated_rating":null,"release_date":631065600,"platforms":["Family Computer"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co741f.jpg","external_ids":[]},{"igdb_id":68984,"name":"NHRA Drag Racing: Main Event","summary":null,"genres":["Racing","Simulator","Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/y9gl0oykxgys7i5qo7ws.jpg","external_ids":[]},{"igdb_id":18270,"name":"NHRA Drag Racing: Countdown to the Championship","summary":"A drag racing simulation featuring races based on 22 real events against 19 professional drag racers.","genres":["Racing","Simulator"],"developers":["Pipeworks Software"],"publishers":["ValuSoft"],"aggregated_rating":null,"release_date":1184284800,"platforms":["PlayStation Portable","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co727a.jpg","external_ids":[]},{"igdb_id":45122,"name":"NHL Powerplay '96","summary":null,"genres":["Sport"],"developers":["Radical Entertainment"],"publishers":["Virgin Interactive Entertainment"],"aggregated_rating":null,"release_date":823132800,"platforms":["PC (Microsoft Windows)","Sega Saturn","PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2hb6.jpg","external_ids":[]},{"igdb_id":263055,"name":"NHRA Championship Drag Racing: Speed for All - John Force Racing Pack","summary":"John Force is a legend in the sport and this pack puts you in the driver's seat with Team Force to further build on this formidable legacy.","genres":["Racing"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":210499,"name":"NHL Hockey","summary":"Licensed hockey game for the intellivision","genres":["Sport"],"developers":["APh Technological Consulting"],"publishers":["Mattel Electronics"],"aggregated_rating":null,"release_date":315446400,"platforms":["Intellivision"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xk4.jpg","external_ids":[]},{"igdb_id":287014,"name":"NHL 2K10","summary":"PlayStation 2 port of NHL 2K10","genres":["Sport"],"developers":["Visual Concepts"],"publishers":["2K Sports"],"aggregated_rating":null,"release_date":1252972800,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7rr2.jpg","external_ids":[]},{"igdb_id":37667,"name":"NHK Taiga Drama Taiheiki","summary":"AKA: NHK大河ドラマ 太平記. A samurai era turn-based strategy game based on the NHK TV drama Taiga Taiheiki.","genres":["Strategy"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":696816000,"platforms":["TurboGrafx-16/PC Engine"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6xj0.jpg","external_ids":[]},{"igdb_id":815,"name":"NHL 2002","summary":"NHL 2002 is a video game released by EA Sports in 2001. It is the predecessor to NHL 2003. The game's cover man is Pittsburgh Penguins superstar and owner Mario Lemieux, who had just made a stunning comeback after being retired for three and a half years. It was the first installment of the NHL series to be released on Xbox.","genres":["Simulator","Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":70.0,"release_date":1000684800,"platforms":["Xbox","PC (Microsoft Windows)","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2guz.jpg","external_ids":[{"category":null,"store":null,"uid":"18520","url":"https://www.giantbomb.com/games/3030-18520/"},{"category":null,"store":null,"uid":"16972","url":"https://www.twitch.tv/directory/game/NHL%202002"}]},{"igdb_id":4509,"name":"NHL 95","summary":"NHL '95 was EA Sports' third licensed ice hockey game, promising the fastest action in the series to date. The action is viewed top-down, and can be played with or without realistic penalties. There is a full season mode, allowing you to guide a team through all 84 matches, with the option of injuries potentially putting players out of a sequence of matches. You have full control over trading and creating players for your squad. New in-game moves include dummy shots and lie-down blocks.","genres":["Simulator","Sport"],"developers":["EA Canada","High Score Productions"],"publishers":["Electronic Arts","EA Sports"],"aggregated_rating":null,"release_date":788832000,"platforms":["Super Nintendo Entertainment System","Sega Mega Drive/Genesis","DOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gpf.jpg","external_ids":[{"category":3,"store":null,"uid":"15126","url":"https://www.giantbomb.com/games/3030-15126/"},{"category":null,"store":null,"uid":"13881","url":"https://www.twitch.tv/directory/game/NHL 95"}]},{"igdb_id":140901,"name":"NHL 21: Great Eight Edition","summary":"Purchase EA SPORTS NHL 21: Great Eight Edition and receive:\n\n- 16 HUT Premium Packs\n- HUT Cover Athlete Choice Pack (Choice of: Ovechkin, Matthews, McDavid, Pettersson, Laine, Subban)\n- Be A Pro XP Boost and Bonus Trait and Specialization Points\n- 5 Unlocked Hockey Bags","genres":["Simulator","Sport"],"developers":["EA Vancouver"],"publishers":["Electronic Arts"],"aggregated_rating":null,"release_date":1602806400,"platforms":["PlayStation 4","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2kf5.jpg","external_ids":[]},{"igdb_id":45124,"name":"NHL Blades of Steel 2000","summary":"Try to win Lord Stanley's Cup in NHL BLADES OF STEEL 2000. You can play with or against any NHL team and use the Exhibition mode to learn the controls and practice your skills. When you want to test your tactics, enter the race for the Stanley Cup in the Season mode. If getting through a Season is a bigger time investment than you want, just skip it and go straight to the Playoffs. When a friend challenges your domination of the rink, put him in his place with the link cable Two-Player mode. No matter what mode you play, you will have to win the game in a shootout if it's tied at the end of regulation. And if you get into a fight and lose, you will have to sit in the penalty box. Try to become the greatest hockey player in the world with NHL BLADES OF STEEL 2000.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":958867200,"platforms":["Game Boy Color"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ksh.jpg","external_ids":[]},{"igdb_id":242265,"name":"NHL 97","summary":"Genesis / Mega Drive port of NHL 97.","genres":["Sport"],"developers":["High Score Productions"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":846720000,"platforms":["Sega Mega Drive/Genesis"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6a7k.jpg","external_ids":[]},{"igdb_id":209404,"name":"NHL Open Ice","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":18269,"name":"NHRA Championship Drag Racing","summary":"Compete in the world's fastest cars at 20 authentic tracks and 35 of NHRA's top stars. Choose a quick race and take on the computer or go head-to-head with a buddy or start a career and take on legends of drag racing. Take on superstar Greg Anderson of the Pro Stock division, the perennial powerhouse Tony Schumacher of the Top Fuel Dragsters or take on the legendary Funny Car driver John Force. Choose a sponsor and hire a crew chief to set up your car or if your feeling confident, tune the car your way. Get it right, you win, get the big sponsors, the best equipment and become champion. Get one thing wrong... and meet Mr. Wall and see your car torn up in painful slo-mo.","genres":["Racing","Simulator"],"developers":["Lucky Chicken Games"],"publishers":["ValuSoft"],"aggregated_rating":75.0,"release_date":1126656000,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/rgzlwsw2kofkjg0fhqq2.jpg","external_ids":[]},{"igdb_id":45125,"name":"NHL Blades of Steel","summary":"Strap on your skates and hit the ice with NHL BLADES OF STEEL. Play with or against all of the teams in the NHL in the Exhibition mode, where you can get your bearings and learn winning tactics. Then, put those tactics to the test in the Season mode and try to win the Stanley Cup. If you don't like the ups and downs of Season play, go straight to the Playoffs. And when your friends question your dominance in the rink, go after them in the Two-Player link cable option. If the game ends in a tie, you will have to try to win it all in a shootout. No matter what mode you play, you must win the fights because if you lose, you go to the box. However, you can use the Practice mode to work on your fighting skills as well as your shootout technique. Will you be able to handle the action of NHL BLADES OF STEEL?","genres":["Sport"],"developers":[],"publishers":["Konami"],"aggregated_rating":null,"release_date":933897600,"platforms":["Game Boy Color"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xjt.jpg","external_ids":[]},{"igdb_id":206295,"name":"NHL Blades of Steel 2000","summary":null,"genres":["Sport"],"developers":[],"publishers":["Konami"],"aggregated_rating":null,"release_date":949363200,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xjv.jpg","external_ids":[]},{"igdb_id":229285,"name":"NHL 2K10","summary":"NHL 2K10 is an ice hockey simulation developed by Visual Concepts and published by 2K Sports, part of the NHL 2K series.","genres":["Sport"],"developers":["Visual Concepts"],"publishers":["2K Sports"],"aggregated_rating":null,"release_date":1252972800,"platforms":["Wii"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7rr1.jpg","external_ids":[]},{"igdb_id":299309,"name":"NHL 95","summary":"Game Boy port of NHL 95.","genres":["Sport"],"developers":["Probe Software"],"publishers":[],"aggregated_rating":null,"release_date":820368000,"platforms":["Game Boy"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9hrp.jpg","external_ids":[]},{"igdb_id":2986,"name":"NHL 13","summary":"NHL 13 is an ice hockey video game developed by EA Canada published by EA Sports. It is the 22nd installment of the NHL series and was released on September 11, 2012 in North America, Europe as well as Australia and New Zealand. The game was released on the PlayStation 3 and the Xbox 360, featuring Philadelphia Flyers forward Claude Giroux on the cover. The game was featured at the Electronic Entertainment Expo 2012 (E3 2012), which took place between June 5–7, 2012. The demo of the game was released on August 21–22, 2012, at the Xbox Live Marketplace and the PlayStation Store.\n\nThere was a vote deciding which player would be on the NHL 13 cover. Anybody could vote on the player(s) they wished to see on the cover of the game. The vote started on March 29, 2012 with 60 NHL players in a single-elimination voting with two players in each match-up, and was closed on June 4, receiving over 25 million votes worldwide. On June 20, Claude Giroux was named the winner, over Pekka Rinne at the 2012 NHL Awards in Las Vegas.\n\nAn exclusive \"Stanley Cup Collector's Edition\" was also released, apart from the actual NHL 13 game. The Collector's Edition includes five random Hockey Ultimate Team (HUT) player packs from the two 2012 Stanley Cup Finals teams; a Gold Jumbo HUT pack including legend Wayne Gretzky; and a boost pack featuring the CCM RBZ stick.\n\nJust like in NHL 12, Gary Thorne (play-by-play) and Bill Clement (color) provide commentary for NHL 13.\n\nThis year, for the first time, two playable female characters, Hayley Wickenheiser and Angela Ruggiero have been added. In NHL 12, users could create female characters, but there were no real-life players.\n\nOn September 20, Gamesindustry.biz reported that NHL 13 had posted the best first week sales in the franchise's history.","genres":["Simulator","Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":83.83333333333333,"release_date":1347321600,"platforms":["PlayStation 3","Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1xq0.jpg","external_ids":[{"category":14,"store":null,"uid":"33746","url":"https://www.twitch.tv/directory/game/NHL 13"},{"category":3,"store":null,"uid":"37807","url":"https://www.giantbomb.com/games/3030-37807/"},{"category":11,"store":null,"uid":"xbox36066acd000-77fe-1000-9115-d8024541099b","url":"http://marketplace.xbox.com/en-US/Product/NHL-13/66acd000-77fe-1000-9115-d8024541099b"},{"category":null,"store":null,"uid":"66acd000-77fe-1000-9115-d8024541099b","url":"https://marketplace.xbox.com//en-US/Product/NHL-13/66acd000-77fe-1000-9115-d8024541099b"}]},{"igdb_id":299310,"name":"NHL 96","summary":"Cancelled Sega Game Gear port of NHL 96.","genres":["Sport"],"developers":[],"publishers":["Electronic Arts"],"aggregated_rating":null,"release_date":null,"platforms":["Sega Game Gear"],"cover_url":null,"external_ids":[]},{"igdb_id":299311,"name":"NHL 96","summary":"Game Boy port of NHL 96.","genres":["Sport"],"developers":["Probe Entertainment"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":815184000,"platforms":["Game Boy"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9hrq.jpg","external_ids":[]},{"igdb_id":299312,"name":"NHL Hockey 2000","summary":"Game Boy Color port of NHL 2000.","genres":["Sport"],"developers":["Tiertex Design Studios"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":936057600,"platforms":["Game Boy Color"],"cover_url":null,"external_ids":[]},{"igdb_id":210102,"name":"NHL Hockey","summary":"Sega Game Gear port of NHL Hockey.","genres":["Sport"],"developers":[],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":820368000,"platforms":["Sega Game Gear"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6yn8.jpg","external_ids":[]},{"igdb_id":4043,"name":"NHL 2005","summary":"Capture all the speed, finesse, and action of professional hockey with NHL 2005, the successor to NHL 2004. The game's new EA Sports Open Ice Control lets you execute offensive plays, such as a give-and-go and a breakaway pass, and you can also call for defensive double-teams. Dynasty mode has been enhanced with more interactive GM/owner relationships, including a new e-mail system. NHL 2005 also delivers all the action of the World Cup of Hockey with International Teams and venues from North America and Europe.","genres":["Simulator","Sport"],"developers":["EA Black Box"],"publishers":["EA Sports"],"aggregated_rating":75.0,"release_date":1095120000,"platforms":["Xbox","Nintendo GameCube","PC (Microsoft Windows)","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2got.jpg","external_ids":[{"category":null,"store":null,"uid":"6328","url":"https://www.twitch.tv/directory/game/NHL%202005"},{"category":null,"store":null,"uid":"6923","url":"https://www.giantbomb.com/games/3030-6923/"}]},{"igdb_id":5966,"name":"NHL 2K7","summary":"NHL 2K7 is an ice hockey video game made by 2K Sports, and published on the PlayStation 3, PlayStation 2, Xbox, and Xbox 360 consoles. It features San Jose Sharks centre Joe Thornton on its cover. Bob Cole and Harry Neale return from NHL 2K6 to provide commentary.\n\nNew features in the game include improved animations that are mainly geared towards skating. 2K7 also includes a new gameplay setting called \"Cinemotion\". This feature uses close up camera angles as well as dramatic music to capture the intensity of the game.\n\nThe game was also the first ice hockey simulation to be made for the PlayStation 3.","genres":["Sport"],"developers":["Visual Concepts","Kush Games"],"publishers":["2K Sports"],"aggregated_rating":76.66666666666667,"release_date":1158019200,"platforms":["Xbox","PlayStation 3","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2hmr.jpg","external_ids":[{"category":3,"store":null,"uid":"21700","url":"https://www.giantbomb.com/games/3030-21700/"},{"category":11,"store":null,"uid":"xbox36066acd000-77fe-1000-9115-d802545407eb","url":"http://marketplace.xbox.com/en-US/Product/NHL-2K7/66acd000-77fe-1000-9115-d802545407eb"},{"category":14,"store":null,"uid":"19760","url":"https://www.twitch.tv/directory/game/NHL%202K7"},{"category":null,"store":null,"uid":"66acd000-77fe-1000-9115-d802545407eb","url":"https://marketplace.xbox.com//en-US/Product/NHL-2K7/66acd000-77fe-1000-9115-d802545407eb"}]},{"igdb_id":36848,"name":"NHL: Legacy Edition","summary":"EA SPORTS NHL Legacy Edition brings together the most popular modes and award-winning gameplay features from nine years of NHL hockey. Featuring updated rosters and authentic schedules, it’s the perfect experience for fans looking to get that complete hockey fix on Xbox 360 or PlayStation 3.","genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":1441756800,"platforms":["PlayStation 3","Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2kse.jpg","external_ids":[]},{"igdb_id":5070,"name":"NHL 2K11","summary":"NHL 2K11 is an ice hockey video game, developed by Visual Concepts and published by 2K Sports.\n\nThe game was announced on March 3, 2010, as a Wii-exclusive game. It was the first game in the NHL 2K series since NHL 2K7 not to be released on the PlayStation 3, the first since NHL 2K6 not to be released on the Xbox 360, the first since NHL 2K3 to not be released on the PlayStation 2, and the last game in the NHL 2K series to be released on the Wii, as the next entry in the series is released only on iOS and Android devices. Take-Two chairman Strauss Zelnick said that \"As far as NHL, we're taking a year off on PS3 and Xbox 360 to refine, redesign and re-think\".\n\nThen Vancouver Canucks forward Ryan Kesler is the cover athlete for NHL 2K11.","genres":["Sport"],"developers":["Visual Concepts"],"publishers":["2K Sports"],"aggregated_rating":65.0,"release_date":1282608000,"platforms":["Wii"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ieb.jpg","external_ids":[{"category":null,"store":null,"uid":"30340","url":"https://www.giantbomb.com/games/3030-30340/"},{"category":14,"store":null,"uid":"27339","url":"https://www.twitch.tv/directory/game/NHL%202K11"}]},{"igdb_id":27062,"name":"NHL Hockey","summary":"NHL Hockey (titled EA Hockey outside North America) is an ice hockey game by Electronic Arts.","genres":["Simulator","Sport"],"developers":["Park Place Productions"],"publishers":["Electronic Arts","Tec Toy"],"aggregated_rating":null,"release_date":694137600,"platforms":["Sega Mega Drive/Genesis"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5oyt.jpg","external_ids":[]},{"igdb_id":814,"name":"NHL 2001","summary":"In NHL 2001, there are five primary game modes: exhibition, season (where players can take a team through a full season and act as the team's general manager), tournament (involving up to 16 teams), playoffs (also a 16 team format), and shootout (where gamers play out the tie breaker format used in international hockey). Outside of the season and playoff modes, NHL 2001 allows gamers to use a total of 18 international teams and four all-star teams.\n\nSeveral new features have been added to the mix including \"Big Hit\" and \"Big Shot\" buttons for enhanced gameplay. Also new to gameplay is \"The Momentum Meter,\" where a team's performance is affected by the game's momentum. Finally, similar to the Madden Challenge offered in EA's football title, NHL 2001 offers NHL Challenge Mode. Here, players are rewarded points for achieving certain tasks during gameplay. These points can then be used to enhance the abilities of created players.","genres":["Simulator","Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":969926400,"platforms":["PC (Microsoft Windows)","PlayStation","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coagan.jpg","external_ids":[{"category":null,"store":null,"uid":"14995","url":"https://www.giantbomb.com/games/3030-14995/"},{"category":null,"store":null,"uid":"13755","url":"https://www.twitch.tv/directory/game/NHL 2001"}]},{"igdb_id":5069,"name":"NHL 2K10","summary":"NHL 2K10 is an ice hockey simulation developed by Visual Concepts and published by 2K Sports, part of the NHL 2K series. It was released on September 15, 2009 for Wii, Xbox 360, PlayStation 3, and PlayStation 2. Randy Hahn and Drew Remenda provide commentary as they did for NHL 2K9. As of 2011, NHL 2K10 was the final 2K Sports ice hockey video game released for the PlayStation 3, PlayStation 2 and Xbox 360, as NHL 2K11 was released only for the iPhone & Wii.","genres":["Simulator","Sport"],"developers":["Visual Concepts"],"publishers":["2K Sports"],"aggregated_rating":73.33333333333333,"release_date":1252972800,"platforms":["PlayStation 3","Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gov.jpg","external_ids":[{"category":null,"store":null,"uid":"24407","url":"https://www.twitch.tv/directory/game/NHL 2K10"}]},{"igdb_id":5965,"name":"NHL 2K6","summary":"NHL 2K6 is a realistic hockey simulation in which you must take part in all aspects of running a franchise, from scheduling workouts to hitting a slap shot. The game includes revamped animations and more realistic player movement. NHL 2K6 also includes on-the-fly coaching that lets you make decisions during the game to affect your teams strategy and execution. You can even go online to challenge other gamers, track stats, or join a league.","genres":["Sport"],"developers":["Visual Concepts","Kush Games"],"publishers":["2K Sports"],"aggregated_rating":71.66666666666667,"release_date":1126051200,"platforms":["Xbox","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2hmn.jpg","external_ids":[]},{"igdb_id":42479,"name":"NHLPA Hockey 93","summary":"The second part in Electronic Arts' hockey series. It features the NHLPA license (so it has real player names), but not the NHL license (so it doesn't have NHL team names).\n\nGameplay is altered only slightly over the predecessor. Regular season and Playoff modes are available. Goalies have improved AI, there are more foul play options and the game now features detailed statistics.","genres":["Sport"],"developers":["Park Place Productions"],"publishers":["Electronic Arts","Tec Toy"],"aggregated_rating":null,"release_date":715305600,"platforms":["Super Nintendo Entertainment System","Sega Mega Drive/Genesis"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3xuv.jpg","external_ids":[]},{"igdb_id":42655,"name":"NHL Stanley Cup","summary":"This early SNES title is one of the first hockey titles to simulate 3 dimensions by using the SNES mode 7 SNES technology. It contains all 26 NHL teams at the time with varying strengths and weaknesses. It doesn't have the players association license, but all of the player numbers and abilities were true to their real-life counterparts. You can take your favorite team from the regular season all the way through the titular Stanley Cup. It even has a menu option in the North American version to change the between English and French languages.","genres":["Sport"],"developers":["Sculptured Software"],"publishers":["Nintendo","Playtronic"],"aggregated_rating":null,"release_date":741484800,"platforms":["Super Nintendo Entertainment System"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co49jc.jpg","external_ids":[]},{"igdb_id":875,"name":"NHL 08","summary":"NHL 08 is a video game released on September 11, 2007 in North America; the Xbox 360 version was supposed to be released on the same date as the Microsoft Windows, PlayStation 2 and PlayStation 3 versions,[1] but was delayed for a day due to shipping issues. NHL 08 features the Skill Stick System which EA says will allow gamers to more easily control the puck.[2] There is also a way to release the puck and control your player around the defender then retrieve the puck to perform 1-on-1 dekes. It was the first installment of the NHL series to be released on PlayStation 3.","genres":["Sport"],"developers":["EA Canada","HB Studios"],"publishers":["EA Sports"],"aggregated_rating":83.0,"release_date":1189555200,"platforms":["PlayStation 3","PC (Microsoft Windows)","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1xqg.jpg","external_ids":[{"category":null,"store":null,"uid":"18227","url":"https://www.giantbomb.com/games/3030-18227/"},{"category":11,"store":null,"uid":"xbox36066acd000-77fe-1000-9115-d80245410820","url":"http://marketplace.xbox.com/en-US/Product/NHL-08/66acd000-77fe-1000-9115-d80245410820"},{"category":null,"store":null,"uid":"16710","url":"https://www.twitch.tv/directory/game/NHL%2008"},{"category":null,"store":null,"uid":"66acd000-77fe-1000-9115-d80245410820","url":"https://marketplace.xbox.com//en-US/Product/NHL-08/66acd000-77fe-1000-9115-d80245410820"}]},{"igdb_id":43696,"name":"NHL Face Off '97","summary":"NHL FACEOFF '97 has all the basic features you've come to expect from a hockey game. All 26 NHL teams from the 1997 season are included, and you'll find all the players as well. The Season mode lets you take a team through a full slate of games while you keep an eye on how the rest of the league is doing. Players can be traded from one team to another, and created as well. This is Sony's first PlayStation hockey series, and graphically it is considered one of the best-looking hockey games ever to appear on the system. You'll find all the action of the real game here, including wicked slap shots, hard body checks, and plenty of fancy skating and stick handling. Up to eight human players can duke it out via a multitap. So if you're looking for a complete hockey simulation, look no further than NHL FACEOFF '97.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":80.0,"release_date":846028800,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2i2l.jpg","external_ids":[]},{"igdb_id":11650,"name":"NHL 96","summary":"NHL 96 was the first EA Sports game to feature Virtual Stadium technology, which resulted in a 3D feel and multiple camera angles. The NHL license ensures that real teams and players of the era are included, with a full league and playoff system. Many game options can be toggled - the infamous fighting is option, as are the penalties and offsides. The control system makes it possible to execute one-touch passes, and several special trick moves to quickly advance the ball. As a bonus feature, it included 'Hockey Card' profiles of every player on CD, and interviews with the stars of the game.","genres":["Sport"],"developers":["EA Canada","EA Orlando","High Score Productions"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":812505600,"platforms":["Super Nintendo Entertainment System","Sega Mega Drive/Genesis","3DO Interactive Multiplayer","DOS","PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gox.jpg","external_ids":[]},{"igdb_id":225723,"name":"Nhero2","summary":null,"genres":["Fighting"],"developers":["Taewool"],"publishers":[],"aggregated_rating":null,"release_date":993945600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5rzr.jpg","external_ids":[]},{"igdb_id":122113,"name":"NHK Academy: Space School - Math 5th Grade Part 2","summary":"Educational software released in Japan on the Family Computer with a custom cartridge that needs the Konami QTài, Q太, adapter to function.\n1 of 7 games known to use the adapter.\n\nIt is supposed to be used alongside a textbook to answer the questions given in parts of the game.","genres":["Quiz/Trivia"],"developers":[],"publishers":["Konami"],"aggregated_rating":null,"release_date":631065600,"platforms":["Family Computer"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co741b.jpg","external_ids":[]},{"igdb_id":142607,"name":"NHL 21: Rewind Bundle","summary":"In EA SPORTS NHL 21, it's the most creative, inventive and fearless players that are worth celebrating. Carve your path to superstardom in an expanded Be A Pro mode and go down as one of the league's greatest. Recognize Creativity, Recognize Revolutionary, Recognize Future. NHL 21. Recognize Greatness.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1606953600,"platforms":["Xbox Series X|S","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3k30.jpg","external_ids":[]},{"igdb_id":70454,"name":"NHL Eastside Hockey Manager 2007","summary":"A menu-based hockey management simulation game made by Sports Interactive. One of the most robust managers with full licensing that includes 45,000 players and staff, 3000 teams and 20 playable leagues.","genres":["Simulator","Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xjo.jpg","external_ids":[]},{"igdb_id":67280,"name":"NHK Kouhaku Quiz Kassen","summary":"NHK Kohaku Quiz Kassen is a trivia game published by Nintendo and developed by Eighting in cooperation with NHK Enterprises. It was released on December 17, 2009 in Japan only.","genres":["Quiz/Trivia"],"developers":["Nintendo EAD"],"publishers":["Nintendo"],"aggregated_rating":null,"release_date":1261180800,"platforms":["Wii"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7kqm.jpg","external_ids":[]},{"igdb_id":242264,"name":"NHL 97","summary":"SNES port of NHL 97.","genres":["Sport"],"developers":["Ceris Software"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":846720000,"platforms":["Super Nintendo Entertainment System"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6a7j.jpg","external_ids":[]},{"igdb_id":262029,"name":"NHL 24: X-Factor Edition","summary":"NHL 24 X-Factor Edition includes:\n\n-Dual Entitlement\n-3-Days Early Access\n-4600 NHL Points\n-Exclusive Cale Makar Player Item\n-HUT Power Up Icon Choice Pack\n-WOC Battle Pass XP Modifier (x5)","genres":["Simulator","Sport"],"developers":["EA Vancouver"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":1696291200,"platforms":["Xbox Series X|S","PlayStation 4","PlayStation 5","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xjq.jpg","external_ids":[]},{"igdb_id":19559,"name":"NHL All-Star Hockey '95","summary":"Sega's second attempt at hockey for the Genesis (after Mario Lemieux Hockey) offers 26 NHL teams and 650 professional players rated in 15 categories. Team rosters and the season schedule are based on the NHL's 1994-95 season. Also noteworthy is the inclusion of broadcaster Marv Albert to provide color commentary. Other features include: one-timers, line changes, adjustable penalties, fighting, speed bursts, cross-checks, instant replay, manual or automatic goalies, and complete statistical tracking saved to battery. Game modes include: Exhibition, Full Season, New Playoffs, and New Playoffs/7 Game. All modes support two players except for the full 84 game season. Special attention was given to the animation, with players having over 1,000 frames to make them look smooth on the ice.","genres":["Simulator","Sport"],"developers":["Sega Midwest Development Division"],"publishers":["Sega of America"],"aggregated_rating":null,"release_date":820368000,"platforms":["Sega Mega Drive/Genesis"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5oys.jpg","external_ids":[]},{"igdb_id":20430,"name":"NHL FaceOff 98","summary":"NHL FaceOff 98 is a Sports game, developed by Killer Game and published by SCEA, which was released in 1997.","genres":["Simulator","Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":877651200,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2iej.jpg","external_ids":[]},{"igdb_id":119947,"name":"NHL 20","summary":"In NHL 20, your favorite NHL stars now look and feel more authentic with new Signature Shots and over 45 new shot types that make every attack a threat. A new broadcast package celebrates your biggest plays as you take on all-new game modes, including the new winner-take-all Eliminator mode where you play solo or team up with friends to take down the competition.","genres":["Sport"],"developers":["EA Vancouver"],"publishers":["EA Sports"],"aggregated_rating":79.14285714285714,"release_date":1568332800,"platforms":["PlayStation 4","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2qub.jpg","external_ids":[]},{"igdb_id":21625,"name":"NHL Supercard","summary":"Offering more than 450 cards featuring current and legendary NHL players in active circulation, with each card representing different rarity levels, NHL SuperCard offers a wealth of collectible content, extensive replay value and opportunities to purchase individual card packs.","genres":["Sport"],"developers":["Cat Daddy Games"],"publishers":["2K Games"],"aggregated_rating":78.0,"release_date":1444176000,"platforms":["Android","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2i2f.jpg","external_ids":[]},{"igdb_id":816,"name":"NHL 2004","summary":"NHL 2004, developed by the EA Black Box studios, is an ice hockey video game. It is the successor to NHL 2003 and is widely considered to be a major turning point in the NHL series. The game adds 3 European Elite Leagues: Germany's Deutsche Eishockey Liga (DEL), Sweden's Elitserien (SEL), and Finland's SM-liiga. (This is not the first time that European teams are included in an EA game; EA released both Elitserien 95 and Elitserien 96 for the Mega Drive in Sweden only and Elitserien and SM-liiga 2001 as an expansion pack for PC in Sweden and Finland which included those teams.) The ratings of the teams in the Elitserien and SM-liiga were comparable to the NHL rosters, however future installments had the league teams inferior to the NHL.","genres":["Simulator","Sport"],"developers":["EA Black Box"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":1064188800,"platforms":["Xbox","Nintendo GameCube","PC (Microsoft Windows)","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gv0.jpg","external_ids":[{"category":null,"store":null,"uid":"1673","url":"https://www.twitch.tv/directory/game/NHL%202004"},{"category":null,"store":null,"uid":"1828","url":"https://www.giantbomb.com/games/3030-1828/"}]},{"igdb_id":818,"name":"NHL 98","summary":"NHL 98 features much faster and refined gameplay (now using four action keys instead of two, removing the need to double-tap to perform some actions), along other new features such as \"in-the-fly\" tactics developed by Marc Crawford, then manager of the Colorado Avalanche and new commentary lines from Jim Hughson and Darryl Reaugh and a re-worked interface.\nGraphics are improved from the previous version with the players being less angular, and thanks to 3Dfx support, with less pixels showing in the textures. The in-game presentation follows a TV-style script, zooming in players while displaying stats during clock stoppages.\n\nAs far as game modes go, in the year of the first Olympic Tournament with professional players, NHL 98 introduced the first real international competition, with 18 International teams to choose from. Other game modes include Season (option to pick between 25 or 82 games) and Playoff (best of 1, 3, 5 or 7 matches) and a Penalty Shootout mode.","genres":["Sport","Strategy"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":877564800,"platforms":["Super Nintendo Entertainment System","Sega Mega Drive/Genesis","PC (Microsoft Windows)","Sega Saturn","PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gux.jpg","external_ids":[{"category":14,"store":null,"uid":"17269","url":"https://www.twitch.tv/directory/game/NHL 98"},{"category":null,"store":null,"uid":"18845","url":"https://www.giantbomb.com/games/3030-18845/"}]},{"igdb_id":20432,"name":"NHL FaceOff 2000","summary":"In NHL FACEOFF 2000 you can make trades, release slackers, create a player, and sign free agents. You'll get gameplay modes like Season, Exhibition, Quick Start. One new feature is Multi-Team play, which lets more than one user play within the same season and creates the potential for some great rivalries. FACEOFF 2000 is officially licensed and has all the real NHL teams and players.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":941414400,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ieh.jpg","external_ids":[]},{"igdb_id":204906,"name":"NHRA: Speed for All","summary":"NHRA is back – bigger and better than ever! Immerse yourself into the teams, tracks, tuning, and strategies, then strap into the driver’s seat in your ultimate quest to become the Champion among the true Beasts of the Strip.","genres":["Racing"],"developers":[],"publishers":["Game Mill Entertainment"],"aggregated_rating":null,"release_date":1661472000,"platforms":["Xbox Series X|S","PlayStation 4","PC (Microsoft Windows)","PlayStation 5","Xbox One","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4wk8.jpg","external_ids":[]},{"igdb_id":20431,"name":"NHL FaceOff 99","summary":"989 Studios makes the race for the best hockey title a bit more interesting. Like EA Sports, 989 Studios is building on a previous title to make it better. The game features New Jersey Devil announcer, Mike Emrick and ESPN's Darren Pang providing play-by-play; graphic and control upgrade; TV-style gameplay; in-depth stat tracking, season play, exhibition games, and more.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":917740800,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ieg.jpg","external_ids":[]},{"igdb_id":242266,"name":"NHL 97","summary":"PC port of NHL 97.","genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":846720000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6a7i.jpg","external_ids":[]},{"igdb_id":824,"name":"NHL 09","summary":"NHL 09 is the 17th video game in the NHL series released by EA Sports in 2008. Both the Nintendo DS and Wii versions had been planned, but canceled. It was the last installment of the NHL series to be released on Playstation 2 and the last to get a PC release","genres":["Sport"],"developers":["EA Canada","HB Studios"],"publishers":["EA Sports"],"aggregated_rating":90.0,"release_date":1220918400,"platforms":["PlayStation 3","PC (Microsoft Windows)","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2jw7.jpg","external_ids":[{"category":null,"store":null,"uid":"xbox36066acd000-77fe-1000-9115-d80245410872","url":"http://marketplace.xbox.com/en-US/Product/NHL-09/66acd000-77fe-1000-9115-d80245410872"},{"category":null,"store":null,"uid":"21320","url":"https://www.giantbomb.com/games/3030-21320/"},{"category":null,"store":null,"uid":"19435","url":"https://www.twitch.tv/directory/game/NHL 09"},{"category":null,"store":null,"uid":"66acd000-77fe-1000-9115-d80245410872","url":"https://marketplace.xbox.com//en-US/Product/NHL-09/66acd000-77fe-1000-9115-d80245410872"}]},{"igdb_id":20428,"name":"NHL FaceOff","summary":"Sony Computer Entertainment's first foray into the world of professional ice hockey. The game was made for the 1995-1996 NHL season and the FaceOff brand continued into the 21st Century.","genres":["Sport"],"developers":["Sony Computer Entertainment America"],"publishers":["Sony Computer Entertainment America"],"aggregated_rating":null,"release_date":823219200,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/pfbghifztaqvpbxk2crx.jpg","external_ids":[]},{"igdb_id":246699,"name":"NHL 94: 2023 Edition","summary":"NHL 94: 2023 Edition is a ROM hacked that updates NHL ‘94 for the 2023 playoffs. The hack aims to provide the most refined and realistic modern versions of this all-time classic game.","genres":["Sport"],"developers":["Adam Catalyst"],"publishers":[],"aggregated_rating":null,"release_date":1673308800,"platforms":["Sega Mega Drive/Genesis"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9rf6.jpg","external_ids":[]},{"igdb_id":74536,"name":"NHL SuperCard 2K18","summary":"NHL SuperCard, the action-packed NHL collectible card-battling game \n \nNHL SuperCard is the action-packed NHL collectible card-battling game. Featuring cover athlete Zach Parise, NHL All-Star, 2014 U.S. Olympic Team Captain and left wing for the Minnesota Wild, NHL SuperCard is available for download free of charge on the App Store for iOS devices, including the iPhone, iPad and iPod touch, as well as the Google Play Store and Amazon Appstore for Android devices.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["Android","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2i2e.jpg","external_ids":[]},{"igdb_id":214728,"name":"NHRA Championship Drag Racing: Speed for All - Deluxe Edition","summary":"For the dedicated NHRA fan, this Deluxe Edition features the NHRA Championship Drag Racing: Speed for All base game plus the John Force Racing (JFR) Pack.","genres":["Racing"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1661472000,"platforms":["Xbox Series X|S","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co54sr.jpg","external_ids":[]},{"igdb_id":3564,"name":"NHL Breakaway 99","summary":"All 27 NHL teams and over 600 players including the expansion Nashville Predators. Symbol-based passing and non-puck handler control. Real-life player sizes and weights. Create, trade, sign and release players. Set team style for physical play, power plays and penalty killing. Updated 1998-99 team jerseys, rosters, schedules and realigned divisions. Actual arena names for the ultimate NHL realism!","genres":["Sport"],"developers":["Iguana Entertainment"],"publishers":["Acclaim Entertainment"],"aggregated_rating":null,"release_date":912124800,"platforms":["Nintendo 64"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2hb2.jpg","external_ids":[]}]