[{"igdb_id":186851,"name":"P1441vr","summary":"P1441vr is a basic gun range simulator with semi realistic mechanics and a variety of game modes to sling lead in. Move n shoot your way through steel targets or disable enemy threats in Simunitions mode. *Read Early Access section*","genres":["Simulator","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1641945600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4h06.jpg","external_ids":[]},{"igdb_id":363808,"name":"P1: Anchor Light","summary":"Anchor Light is a first-person anomaly-hunting experience set within a lavish, mysterious lighthouse. In this unique game, light and shadow are your tools and your enemies. You'll need to observe every detail, as each room holds secrets waiting to be uncovered.\n\nA wide spectrum of anomalies will test your perception and sanity. From subtle distortions that question your memory to deeply unsettling scenes, every moment is designed to linger, striking a balance between dread and awe. The finely-tuned gameplay ensures that each run feels fresh and compelling.\n\nKey Features\nTense 'Red Light, Green Light' Mechanic: The music is your guide. When it stops, so should you. Any movement during a music cut can be your last, so freeze, listen, and pray that whatever is hunting you doesn't find you.\n\nFloppy Disk Collectibles: Discover floppy disks scattered throughout the lighthouse to reveal fragments of the past. These memories from previous inhabitants offer crucial clues to the horrors you're facing.\n\nUnlockable Difficulty Modes: Master the game in Normal and Hard modes, then face the ultimate challenge in Nightmare mode, where familiar layouts are twisted into new terrors.\n\nLeaderboards and Endless Mode: Immortalize your fastest times on the leaderboards across all difficulty modes, or test your endurance in Endless mode to see how many floors you can clear without getting caught.","genres":["Puzzle","Simulator","Indie"],"developers":[],"publishers":["Perp Games"],"aggregated_rating":null,"release_date":1757462400,"platforms":["Xbox Series X|S","PC (Microsoft Windows)","PlayStation 5"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coacu4.jpg","external_ids":[]},{"igdb_id":126937,"name":"P1r4t3s","summary":"Gather a fearsome crew and sail the space boarding ships and stations, robbing them naked, and shooting whoever stands in your way in the roguelike with RPG elements P1r4t3s!","genres":["Role-playing (RPG)","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1580428800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3qr0.jpg","external_ids":[]},{"igdb_id":139803,"name":"P1 Select","summary":"New mini roguelike \"broughlike\" game. Explore 9 randomly generated levels, avoid fierce monsters, collect magical rings to use your special attack powers, and gather pyramids to reach a high score. Nine different hero characters to choose from!","genres":["Puzzle","Strategy","Tactical","Indie"],"developers":["Michael Brough"],"publishers":["Michael Brough"],"aggregated_rating":null,"release_date":1560038400,"platforms":["Web browser","PC (Microsoft Windows)","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ifh.jpg","external_ids":[]}]