[{"igdb_id":286931,"name":"Sítio do Picapau Amarelo: A Nova Aritmética da Emília","summary":"Game based on the story \"A Nova Arithmética da Emília\" by Brazilian writer Monteiro Lobato.","genres":["Point-and-click","Puzzle"],"developers":["PAM Comércio Planejamento e Editora"],"publishers":[],"aggregated_rating":null,"release_date":1041292800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7rml.jpg","external_ids":[]},{"igdb_id":286928,"name":"Sítio do Picapau Amarelo: As Novas Reinações de Narizinho","summary":"Game based on the story \"Sítio do Picapau Amarelo: As Novas Reinações de Narizinho\" by the Brazilian writer Monteiro Lobato.","genres":["Point-and-click","Puzzle"],"developers":["PAM Comércio Planejamento e Editora"],"publishers":[],"aggregated_rating":null,"release_date":1009756800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7rmi.jpg","external_ids":[]},{"igdb_id":286929,"name":"Sítio do Picapau Amarelo: Emília e a Reforma da Natureza","summary":"The Reforma da Natureza CD-ROM had as its theme a computer brought by the Viscount to Sítio de Dona Benta. Emília uses make-believe and the computer to carry out renovations in nature.\n\nAll the renovations that appear in the book appear in the game at some point: the edible book, the bird's nest, the renovation of the mocha cow, among others. The highlight is the games that Emília uses to undo the renovation.","genres":["Point-and-click","Puzzle"],"developers":["PAM Comércio Planejamento e Editora"],"publishers":[],"aggregated_rating":null,"release_date":1009756800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7rmk.jpg","external_ids":[]},{"igdb_id":286934,"name":"Sítio do Picapau Amarelo: Caçadas de Pedrinho","summary":"In Caçadas de Pedrinho, players join Pedrinho, Narizinho, Emília, and other characters from Monteiro Lobato's Sítio do Picapau Amarelo in an adventure to hunt a jaguar that threatens the Sítio. The game features animated screens where players can explore the Sítio, forest, and its inhabitants, interacting with the story by reading, listening, and completing challenges. Activities include testing aim, solving mazes, challenging memory, coloring characters, assembling puzzles, and navigating mini-games with adjustable difficulty. With 256-color graphics and interactive elements, the game combines learning, action, and fun in a detailed, animated environment.","genres":["Point-and-click","Puzzle"],"developers":["PAM Comércio Planejamento e Editora"],"publishers":[],"aggregated_rating":null,"release_date":883526400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co92mm.jpg","external_ids":[]},{"igdb_id":81031,"name":"Sítio do Pica-Pau Amarelo","summary":"A platform game based on the books and characters of \"Sítio do Pica Pau Amarelo\", a literary work created by the Brazilian author Monteiro Lobato.","genres":["Platform"],"developers":["Tec Toy"],"publishers":["Tec Toy"],"aggregated_rating":null,"release_date":901929600,"platforms":["Sega Master System/Mark III"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3s02.jpg","external_ids":[]},{"igdb_id":286923,"name":"Sítio do Picapau Amarelo: Geografia de Dona Benta","summary":"Geografia de Dona Benta tells the story of one of the adventures that took place at Sítio do Picapau Amarelo, in which the Marquês de Rabicó trips and goes flying through the sky on Emília's magic carpet. Through several games you can take part in a trip around the world, getting to know and learning the main characteristics of each country and city.","genres":["Point-and-click","Puzzle"],"developers":["PAM Comércio Planejamento e Editora"],"publishers":["Macromedia"],"aggregated_rating":null,"release_date":1041292800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7rm8.jpg","external_ids":[]}]