[{"igdb_id":182416,"name":"TKKG: Zelle 13","summary":"Superstition is not the order of the day for the 13th case of TKKG. Or is it? For the school newspaper, Gaby interviews an inmate in prison about his everyday life in jail. The prisoner from cell 13, Bodo Heppner, willingly gives information. But Heppner is still silent about what happened to the loot after his bank robbery and whether he had an accomplice. When Gaby visits the bank robber again to give him the freshly printed school newspaper, he suddenly becomes nervous. A short time later he breaks out of prison! And again TKKG is involved in a new case. The clues lead to a horror store, to hard-core crime readers, illiterates and last but not least to an abandoned bunker ...","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co49f9.jpg","external_ids":[]},{"igdb_id":289945,"name":"T.K. Punk: G.O.L.D","summary":"Cyber Three Kingdoms Turn-Based Strategy RPG— As the latest humanoid AI developed, you were kidnapped by Zhang Jiao and joined the resistance organization—GOLD. Develop yourself, accept commissions, research prosthetics, cultivate companions and pursue the love and destruction in your heart!","genres":["Role-playing (RPG)","Strategy","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1798675200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coagkv.jpg","external_ids":[]},{"igdb_id":78914,"name":"TKO","summary":"In TKO you can play the career of a boxer. Create your boxer by trading off a mixture of attributes, for example a boxer who cuts easily will not tire as easily, and a boxer whose best punch is to the head will not punch to the body as efficiently.","genres":["Fighting","Simulator","Sport"],"developers":["Accolade"],"publishers":["Accolade"],"aggregated_rating":null,"release_date":631065600,"platforms":["DOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3xwp.jpg","external_ids":[]},{"igdb_id":182420,"name":"TKKG: Die Feuerprobe","summary":"Investigate with TKKG in a new, exciting case that you do not know from the radio plays or books!\nIn this one, an increasing number of students no longer feel safe at boarding school. What is the truth behind the rumors of blackmail and intimidation at the school? Tim, Karl, Klößchen and Gaby investigate and not only have to deal with a neglected ex-teacher and demonstrating animal rights activists, but also encounter self-appointed \"guardian angels\" who want to ensure safety in the schoolyard. The good reputation of the school is at stake!\nHelp TKKG uncover the evil machinations and put a stop to the culprits!","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co49fc.jpg","external_ids":[]},{"igdb_id":165158,"name":"TKKG: Voodoozauber","summary":"Investigate with TKKG in a new, exciting case that you do not know from the radio plays or books!\nTogether with Tim, Karl, Klößchen and Gaby you search for clues, evidence and question witnesses. Only if you repeatedly slip into the different roles of the detectives and cleverly combine them, you will solve the crime in an exciting finale.","genres":["Point-and-click","Adventure"],"developers":["Tivola Verlag GmbH"],"publishers":["Tivola Verlag GmbH"],"aggregated_rating":null,"release_date":1141257600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3lh9.jpg","external_ids":[]},{"igdb_id":42440,"name":"TKO Super Championship Boxing","summary":"A boxing game featuring a Championship mode and a 1 or 2 player exhibition match mode.\n\nIn the Championship mode, players choose from 1 of the 8 available boxers, and then compete against the other 7 boxers on the road to try becoming the World Champ. Players go toe to toe with their opponents in the boxing ring in 3 minute rounds. The boxers can throw hooks and jabs at each other with the sole intention to knock their opponent down to the canvas by draining all their energy by landing those punches. Each punch thrown costs the boxer some stamina which is indicated by boxing glove icons. If all the boxers stamina is drained, they can no longer throw punches for a little while until they gain some of their stamina back. After each fight is over, players go to the gym to train in various different exercises like skipping rope and bench pressing weights. These exercises increase the players boxer in various areas like speed and power.\n\nOptions include setting the number of rounds (from 1 to 10) and setting the difficulty level (novice, advanced, and expert).","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":728524800,"platforms":["Super Nintendo Entertainment System"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5zfl.jpg","external_ids":[]},{"igdb_id":186335,"name":"Tkium Exclusion Area","summary":"Tkium Exclusion Area is an horror escape game. You need to get out of this place, and quickly. Even if this area looks abandoned, nothing can confirm that you are really alone. You have to leave quickly, the fear is taking over you.","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1641340800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5nj9.jpg","external_ids":[]},{"igdb_id":206218,"name":"TKKG: Jennifer is Missing","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":225181,"name":"Tkium Underground","summary":"Tkium Underground is a short horror escape game taking place in an unknown tunnels facility. Activate generators, levers, and find a specific object to unlock the exit door, then find it. You were not the first one to be in this situation, but will you be the first one to escape alive?","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1667001600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5rjf.jpg","external_ids":[]},{"igdb_id":120853,"name":"TKKG: Die Feuerprobe","summary":"Investigate with TKKG in a new, exciting case that you do not know from the radio plays or books! In this one, more and more students feel no longer safe at the boarding school. What about the rumors of extortion and intimidation at school? Help TKKG uncover the evil machinations and stop the malefactors!","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1560297600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co44pf.jpg","external_ids":[]},{"igdb_id":158722,"name":"TKKG: Wer stoppt den Feuerteufel?","summary":"Investigate with TKKG in a new, exciting case that you do not know from the radio plays or books!\nTogether with TKKG you search for traces, clues and suspects. Only if you repeatedly slip into the different roles of the detectives and cleverly combine them, you can solve the crime in an exciting finale.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3g2d.jpg","external_ids":[]},{"igdb_id":36106,"name":"Tkl Online","summary":"Tkl Online (TO) is an MMO-style single player RPG created with RPG Maker VX. You are a human in the world of Orbis Terrarum, in which monsters and magic are real. Orbis Terrarum is a free-roaming open world where you have the freedom to become anything you want.","genres":["Role-playing (RPG)","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1422316800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cob6rx.jpg","external_ids":[]},{"igdb_id":34208,"name":"T-Kara Puzzles","summary":"Unique match-4 puzzle game, filled with fun variations and exciting challenges!","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1464739200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co42vh.jpg","external_ids":[]},{"igdb_id":206217,"name":"TKKG: The Betrayal","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":206216,"name":"TKKG: Mystery of the Mayan Treasure","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":172737,"name":"T Kara Hajimaru Monogatari","summary":"T Kara Hajimaru Monogatari is an action adventure game developed by Jaleco in 1998, in the game the player takes the role of a young skater boy (which name is unknow since the player can put the name that he wants to) that one day he arrives at home and received in email in his computer to create a graffitti using these 4 words: Trap, trick, trip, truth.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":896918400,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3wos.jpg","external_ids":[]},{"igdb_id":182417,"name":"TKKG: Gefährliche Ferien","summary":"Vacation at last! Camping in Cyprus is the motto, but the four detectives have hardly unrolled their sleeping bag when they get involved in a new case. A picture that at first seems inconspicuous is stolen from a hotel safe. The more TKKG look into the history of the picture, the more people show up who want it desperately. So something is not right with this painting ...","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co49ff.jpg","external_ids":[]},{"igdb_id":182418,"name":"TKKG: Verfolgt!","summary":"Investigate with TKKG in a new, exciting case that you do not know from the radio plays or books!\nStalked! Gaby feels a shiver down her spine: At the end of a Spanish class at the adult education center, she discovers an anonymous letter between the pages of her book. A stranger who signs \"Your faithful prince\" seems to be constantly watching her and trying to intimidate her. Tim, Karl, Klößchen and Gaby take up the pursuit of the stranger. The clues soon lead them into the world of the Internet, webcam spying and chat rooms Just when the young detectives think they are on the right track, the case takes a dramatic turn. Will TKKG win the hunt for the \"prince\" across the city?","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co49fe.jpg","external_ids":[]},{"igdb_id":182419,"name":"TKKG: Das Unheimliche Zimmer","summary":"Actually, the four friends of TKKG just wanted to go for a bike ride, turn their backs on the city of millions and spend a relaxing weekend in the countryside.\nBut when they are surprised by a thunderstorm and have to seek shelter in an abandoned hotel, they come across a terrible secret ... And before they know it, they are in the middle of a thrilling criminal case, in which it quickly becomes clear that this is no ordinary case. The clues lead into the past - a past that scares the inhabitants of the small village Oberfeldbach so much that they don't want to talk about it.\nIs this case perhaps a bit too big for TKKG?","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co49fd.jpg","external_ids":[]},{"igdb_id":150019,"name":"TKKG: Verrat an TKKG","summary":"Is Gaby a thief? How could it happen that she got under wrong suspicion? Who wants to destroy the friendship between the 4 detective friends?\n\nTogether with Tim, Karl, Kloesschen and Gaby you search the city for clues on who is the real thief. You are immediately within an exciting case of missing dogs, a suspected animal cruelity and a strange secret passage.","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":938736000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co31ak.jpg","external_ids":[]},{"igdb_id":182384,"name":"TKKG: Alarm in der Geisterbahn","summary":"With their annual pass, Tim, Karl, Dumpling and Gaby have already been to the amusement park \"Snappyland\" countless times. It was almost getting boring! But when they overhear a conversation between 2 entertainers who are planning a crime, they get into an exciting case. The \"goose man\", they hear, is to have a \"fatal accident\" on the same day! Time is running out. Stress at the amusement park!\n\nTake on the roles of Tim, Karl, Dumpling and Gaby. Interview witnesses, look for clues and evidence ...","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co49bm.jpg","external_ids":[]},{"igdb_id":200658,"name":"TKKG: Deadly Chocolate","summary":"TKKG is a point and click adventure game following four students solving a crime.","genres":["Point-and-click","Adventure"],"developers":[],"publishers":["Tivola Verlag GmbH"],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]},{"igdb_id":152034,"name":"TKKG: Der Fälscherbande auf der Spur","summary":"Investigate with TKKG in a new, exciting case that you do not know from the radio plays or books!","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1093996800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co38xv.jpg","external_ids":[]}]