[{"igdb_id":367429,"name":"Yì Shìjiè Wúlítóu Shēnghuó 2","summary":"This is a text otherworld adventure game that allows you to advance the game's plot with different choices.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1650585600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coagwe.jpg","external_ids":[]},{"igdb_id":372322,"name":"Yì Shìjiè Wùyǔ","summary":"“Yì Shìjiè Wùyǔ” is a fantasy adventure RPG with character growth and development elements.\nIn the game, players take on the role of brave warriors who hunt and defeat powerful Origin Beasts to obtain Origin Elements. By crafting mighty Origin Weapons and Origin Gear from these elements, you can enhance your combat power and grow ever stronger on your journey.","genres":["Role-playing (RPG)","Simulator","Strategy","Adventure"],"developers":["YSJWY"],"publishers":["YSJWY"],"aggregated_rating":null,"release_date":1736467200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coan8w.jpg","external_ids":[]},{"igdb_id":368464,"name":"Yìnéng Dūshì","summary":"“Showdown at the Cyber Pinnacle — Yi Neng Du Shi arrives with groundbreaking innovation!”\nThis is a cyber-futuristic 3D action MMO. Players take on the role of interdimensional travelers, investigating mysteries, mastering new skills, and recruiting allies. Awaken sci-fi divine powers, enhance your body with mech augmentations, and rise to unmatched strength to become the savior of a futuristic world—fighting against dark forces to preserve the survival of humanity.","genres":["Role-playing (RPG)"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1699574400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coai4y.jpg","external_ids":[]},{"igdb_id":373704,"name":"Yìnéng Chóngzǔ","summary":"\"Yìnéng Chóngzǔ\" is a turn-based rogue-like game. Do you envy the boss's abilities? Great! In this game, you can completely plunder the enemy's abilities, skills, and even minions! Build your own abilities through looting while simultaneously destroying the enemy's abilities. Can you find the best strategy? As you progress, the strength of both you and your enemies will rapidly increase. Come experience the stat boost brought by perfect combos!","genres":["Strategy"],"developers":["Mò Yuánsù"],"publishers":["Mò Yuánsù"],"aggregated_rating":null,"release_date":1770076800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coapf6.jpg","external_ids":[]}]