[{"igdb_id":41769,"name":"Xak: The Art of Visual Stage","summary":"Xak: The Art of Visual Stage is the first game in the fantasy role-playing video game series Xak. It was originally released for the NEC PC-8801 computer system, with subsequent versions being developed for the NEC PC-9801, Sharp X68000, MSX2, PC-Engine, Super Famicom, and mobile phones.","genres":["Role-playing (RPG)"],"developers":["Micro Cabin"],"publishers":["Micro Cabin"],"aggregated_rating":null,"release_date":602294400,"platforms":["PC-9800 Series","Sharp X68000","PC-8800 Series","PC (Microsoft Windows)","MSX2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co626m.jpg","external_ids":[]},{"igdb_id":377091,"name":"Xak: The Art of Visual Stage","summary":"The Super Famicom remake of Xak: The Art of Visual Stage reworks the classic RPG for Super Famicom, replacing the original’s bump-based battles with a new sword-swinging combat system.\n\nThe player assumes the role of Latok Kart, a blue-haired swordsman and the son of the legendary warrior Dork Kart. He is sent on a quest to defeat the warmongering demons led by the powerful Badu that are running rampant in the eponymous world of the humans, Xak.","genres":["Role-playing (RPG)"],"developers":["Micro Cabin"],"publishers":["SUNSOFT"],"aggregated_rating":null,"release_date":730684800,"platforms":["Super Famicom"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coatuo.jpg","external_ids":[]},{"igdb_id":103931,"name":"XAirports","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":110232,"name":"Xanxillium","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":337108,"name":"Xander: 7-Shot","summary":"Follow Xander, the self-proclaimed Warping Hero as he needs to stop the Fallen Hero's forces and save the universe from collapsing. Throughout his journey he'll come across various people that stand in his way, shoot your way through and stop the Fallen Hero!","genres":["Shooter","Indie"],"developers":["Stargaze Studio"],"publishers":["Stargaze Studio"],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9l5s.jpg","external_ids":[]},{"igdb_id":231495,"name":"Xanniban","summary":"Evil has been unleashed. Don the Trespasser's suit as you dash across facilities, manage resources, and confine hostile machines to change the fate of humanity. Lure your foes into containment as a grim epidemic festers beneath the surface...","genres":["Point-and-click","Indie"],"developers":["NeeTroo Games"],"publishers":["NeeTroo Games"],"aggregated_rating":null,"release_date":1798675200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coag6i.jpg","external_ids":[]},{"igdb_id":359242,"name":"Xalos Conquest","summary":"Awaken my Xalos, the Venishien Empire calls for you! Conquer Earth against the Egyptians and Romans with our robotic might. As Sci-Fi meets Medieval in a epic top-down side-scroller war!","genres":["Strategy","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1753488000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coa83t.jpg","external_ids":[]},{"igdb_id":37606,"name":"Xak III: The Eternal Recurrence","summary":"Ratok, a descendant of the Duel bloodline, receives a distress message from Farland Castle... For the longest time, the world has been split into three, fairy, demon, and human, mainly for the purposes of having the demons sealed off... Yet somehow, the demons have found a way to enter the human world to launch an invasion. One by one, the human world's kingdoms fall to an unforgiving reign of terror. Ratok is informed of the situation by a dying man's last breath after Farland Kingdom fell, its king slaughtered mercilessly. Thus begins Ratok's journey to prevent the demons from realizing their dreams of conquest...\n\nJourney with Ratok, as he quests with his legendary Xak Sword to repel the demon invasion, make plenty of interesting and humorous allies/friends along the way, and discover his true identity as well as that of his father's (whose gone missing for quite some time)...","genres":["Role-playing (RPG)","Strategy"],"developers":["Micro Cabin"],"publishers":["NEC Home Electronics"],"aggregated_rating":null,"release_date":780883200,"platforms":["Turbografx-16/PC Engine CD"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4mkm.jpg","external_ids":[]},{"igdb_id":266789,"name":"Xanthaphobia","summary":"Xanthaphobia presents an immersive experience that blends elements of puzzles, mystery, and horror.","genres":[],"developers":["Wilfred Berg","Jayden Hammerbacher"],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7uor.jpg","external_ids":[]},{"igdb_id":38407,"name":"Xardion","summary":"Xardion tells the tale of 3 warring planets that are home to 3 distinct alien races. Their fighting is interrupted by the threat of invasion from a much more potent alien race. The 3 planets find that they are able to set aside their differences long enough to battle their shared menace.\n\nEach planet sends a warrior to deal with the threat. There is a robot named Triton, a cat-like quadruped named Panthera, and a giant red bipedal insect alien name Alcedes. The single player of the game controls one of these characters at a time and can switch at any time. If the current character loses all of his health, the player is sent back to the start of the level and that one character receives a health refill.\n\nEach character has special attributes that help the team. For example, Panthera's relatively small size allows him to squeeze into spots where the other 2 characters can not travel. The characters can gather a number of unique powerups and weapons to help them on their mission.","genres":["Shooter","Platform","Role-playing (RPG)"],"developers":["Jorudan"],"publishers":["Asmik Corporation"],"aggregated_rating":null,"release_date":701049600,"platforms":["Super Nintendo Entertainment System"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3c2f.jpg","external_ids":[]},{"igdb_id":372213,"name":"Xargon Remake Ep.1","summary":"A remake of the classic 1993 DOS video game Xargon.","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1737936000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coan4e.jpg","external_ids":[]},{"igdb_id":11543,"name":"Xanadu","summary":"In Legend of Xanadu, the player controls a young adventurer named Areios. Monsters attack his homeland, and he is forced to flee. After traveling by ship and arriving at the town Bolda, Areios finds out that strange things have been happening in the North Cave near the town. His first mission will be to venture to the North Cave and investigate the matter. Of course, soon Areios finds himself involved in a battle against sinister forces, and commences the longest and most dangerous adventure of his life!\n\nThe game is an action RPG set in the Dragon Slayer universe, with a gameplay style similar to Falcom's other popular series, Ys. Controlling Areios, the player explores the top-down world, visiting towns and fighting monsters in vast outdoor areas and dungeons. Like in Ys series, it is sufficient to \"bump\" into a monster in order to inflict damage. Areios gains hit points and becomes stronger by sustaining damage from enemies and resting. His weapons and armor can gain experience and level up. In many areas, companions will join Areios and help him in combat, controlled by the computer AI.\n\nThe game is divided into chapters; the final stage of each chapter is a side-scrolling/platform level, which Areios has to navigate in order to reach the boss enemy, defeat him, and end the chapter. In such stages, the combat turns into a more familiar action-oriented style, with the player being required to press buttons in time in order to execute attacks and jump.\n\nThere is a day/night cycle in the game, manifested not only in graphical changes, but also in the schedules of townspeople: when it's dark, people will return to their homes and go to sleep, etc.","genres":["Platform","Puzzle","Role-playing (RPG)"],"developers":["Nihon Falcom"],"publishers":["Nihon Falcom"],"aggregated_rating":null,"release_date":499219200,"platforms":["PC-8800 Series","Sharp X1","PC (Microsoft Windows)","MSX2","MSX"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4ke5.jpg","external_ids":[]},{"igdb_id":207368,"name":"XanChuchamel","summary":"XanChuchamel is a puzzle-platformer where you will need skill but also intelligence to overcome each challenge. Xan can catch blocks and place them in different places to access new areas. 50 levels are waiting for you!","genres":["Platform","Puzzle","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1672099200,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co59mf.jpg","external_ids":[]},{"igdb_id":254730,"name":"Xaladia: Rise of the Space Pirates X2","summary":"Upgrade your weapons, control armaments, and annihilate space pirates! Cover the screen with a barrage of support weapons such as missiles, lasers, barriers, and bots! Captivate players with non-scrolling single-screen combat, flashy support attacks with armaments, and beautiful 3D graphics.","genres":["Shooter","Indie"],"developers":["ACQUIRE Corp."],"publishers":["ACQUIRE Corp."],"aggregated_rating":null,"release_date":1697673600,"platforms":["PC (Microsoft Windows)","PlayStation 5","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6occ.jpg","external_ids":[]},{"igdb_id":6296,"name":"Xanadu Next","summary":"Xanadu Next is an exploration-centric action RPG from Nihon Falcom, the acclaimed creators of the Ys and The Legend of Heroes RPG franchises. A late entry in their immensely popular Dragon Slayer series and a spiritual follow-up to the late ‘80s cult classic Faxanadu, Xanadu Next puts players in the shoes of a gravely injured knight given a new lease on life through ancient magic who must now seek a legendary sword called “Dragon Slayer” to ensure his survival.","genres":["Role-playing (RPG)","Hack and slash/Beat 'em up"],"developers":["Nihon Falcom"],"publishers":["Nokia","XSEED Games"],"aggregated_rating":82.83333333333333,"release_date":1119571200,"platforms":["N-Gage","PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3l8l.jpg","external_ids":[]},{"igdb_id":131489,"name":"XaviX Baseball","summary":"\"Xavix BASEBALL\" is software exclusively for Xavix Port released by SSD Co. in 2004. Xavix Port is a game machine that mainly releases sensory games, and with this software you can actually move your body and play virtual baseball using a dedicated Baseball bat-shaped controller.","genres":["Simulator","Sport"],"developers":["SSD Company Limited"],"publishers":["SSD Company Limited"],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9u8k.jpg","external_ids":[]},{"igdb_id":107154,"name":"Xam","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1405468800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cob5vz.jpg","external_ids":[]},{"igdb_id":92120,"name":"Xalx no Monshou 98","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":12854,"name":"Xain'd Sleena: Soldier of Light","summary":"You are an armoured, rocket-booted soldier, whose mission is to defend five planets against the evil empire. You run from left to right, shooting your way to the base at the end of each level, then tackle a left to right space ship stage.","genres":["Shooter","Platform"],"developers":["Technos Japan"],"publishers":["Technos Japan"],"aggregated_rating":null,"release_date":536371200,"platforms":["Arcade","Commodore C64/128/MAX","ZX Spectrum","Atari ST/STE","Amiga","MSX"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3h6k.jpg","external_ids":[]},{"igdb_id":133668,"name":"Xargon's Revenge","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":263718,"name":"Xanthiom 2","summary":"Play through the next chapter in the Xanthiom saga, now bigger and better than before!","genres":["Adventure","Indie"],"developers":["MathanGames"],"publishers":["MathanGames"],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6zyd.jpg","external_ids":[]},{"igdb_id":46906,"name":"Xari Arena","summary":"A previously unreleased prototype game for the Atari 5200.\n\nYour goal is to destroy all the Xari's that come out of the well in the center of the screen before they can destroy all your blocks. You can use the joystick or the trackball controller.\n\nEach player resembles a hollow paddle (like a capsule), which you can move around your side of the screen. Your paddle can catch and hold up to three fireballs (the little star looking things that the Xari's shoot), and each stored fireball allows you to destroy one Xari by running into it. If you hit a Xari without any fireballs stored in your paddle, it is temporarily stunned and you cannot catch or deflect any shots for a few seconds. If you already have three fireballs stored up, your paddle will start reflecting the fireballs back at the Xari's (a great tactic for those hard to reach guys that won't come near you) and at your partner (which is not so good). You can choose to reflect shots even if you don't have three fireballs stored up by pressing the bottom controller button.\n\nIf things start to get out of control you can activate your fire extinguisher (using the top controller button) to temporarily protect your blocks. The fire extinguisher coats your blocks with foam and will destroy any shots that touch it. the foam moves quickly down your blocks and only lasts for a few seconds so you have to use it wisely (like when fireballs get behind your blocks). You get one new fire extinguisher each level, which can be stored for later use.\n\nIt was meant to be released in October 20th, 1983. It was later released digitally in Atari compilations.","genres":[],"developers":["Atari"],"publishers":["Atari, Inc."],"aggregated_rating":null,"release_date":1546214400,"platforms":["Atari 5200"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co673a.jpg","external_ids":[]},{"igdb_id":311973,"name":"Xanthiom","summary":null,"genres":["Shooter","Adventure"],"developers":["MathanGames"],"publishers":["MathanGames"],"aggregated_rating":null,"release_date":1680134400,"platforms":["Atari 2600"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8vkq.jpg","external_ids":[]},{"igdb_id":37640,"name":"Xanadu II","summary":"Falcom has pretty much established themselves as one of the finest RPG makers in the business, and Xanadu II - an offshoot of the Legend of Heroes series shows exactly why. The sequel to the first popular Xanadu game, Xanadu II is also an action RPG. This game retains the simple Ys inspired walk-into-the-enemy attack style which works very well and also the side-on action scenes used for boss battles. Being untranslated, the story is a little hard to plot out, but you play Arios and start out aboard a ship in search of your friend, whose own ship (as shown in the intro) was attacked by dragon riders. Eventually you get blown overboard in a vicious storm and end up on a beach near the city of Razan...","genres":["Role-playing (RPG)"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":81539,"name":"X.A.O.C Online","summary":"A Chinese MMO created by Winking Entertainment","genres":["Role-playing (RPG)"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/koptrqabmirru8ra7enb.jpg","external_ids":[]},{"igdb_id":265120,"name":"Xaphan: Battle Simulator","summary":"Xaphan is a third person shooter mixed with sandbox battle simulator featuring zombies, huge insects, medieval knights, animals and monsters.","genres":["Simulator","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1700265600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co71bo.jpg","external_ids":[]},{"igdb_id":253436,"name":"Xargon Remake Ep.3","summary":"A remake of the classic 1993 DOS video game Xargon.","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1686787200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6mkq.jpg","external_ids":[]},{"igdb_id":294729,"name":"Xadom","summary":"You collect weapons by wandering through portals.","genres":["Arcade"],"developers":[],"publishers":["Quicksilva Ltd."],"aggregated_rating":null,"release_date":441676800,"platforms":["ZX Spectrum"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co80bf.jpg","external_ids":[]},{"igdb_id":163707,"name":"Xando: Xtreme & Over the Top","summary":"XANDO is a turn-based strategy game that flips the game of Tic-Tac-Toe on its head. Select from 4 rule-bending ability sets in order to complete boards, reduce your opponent's HP, and become champion in this corporate-punk world. Get ready and excited because Tic-Tac-Toe has never been like this!","genres":["Strategy","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1628726400,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3l8n.jpg","external_ids":[]},{"igdb_id":84959,"name":"Xavier","summary":"Help Xavier on his journey to become an adult in this prehistoric themed side-scroller. Face difficult challenges, explore and conquer the world untouched by man. Adapt to overcome any obstacle in every enviroment. Find hidden treasures and defeat enemies standing in your way.","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1415836800,"platforms":["Wii U"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6v1t.jpg","external_ids":[]},{"igdb_id":240815,"name":"Xanthiom Zero","summary":"Play as Captain Grisham, as he uncovers the secrets of Planet Zord in this thrilling prequel to Side Scape!","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1690502400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co68jd.jpg","external_ids":[]},{"igdb_id":288456,"name":"Xavian","summary":"\"Choose Xavian or Hathor, magical lions battling alien invaders in this action-packed adventure!\"","genres":["Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7tde.jpg","external_ids":[]},{"igdb_id":118808,"name":"Xanarthraxia","summary":"Stalwart knight, align yourself for battle! Synchronize the energetic patterns within Xanarthraxia's ancient glyphs in this bite-sized casually competitive RPG clicker.","genres":["Role-playing (RPG)","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1573862400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3l8m.jpg","external_ids":[]},{"igdb_id":249549,"name":"Xalabaias Adventure","summary":"A Super Mario World ROM hack inspired by the Brazilian YouTube channel Pai Troll.","genres":["Platform"],"developers":["MaxwelHacks"],"publishers":["MaxwelHacks"],"aggregated_rating":null,"release_date":1568505600,"platforms":["Super Nintendo Entertainment System"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7c3i.jpg","external_ids":[]},{"igdb_id":150763,"name":"Xanguito Aventura","summary":"2D platform adventure game","genres":["Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3l8o.jpg","external_ids":[]},{"igdb_id":181044,"name":"Xangel","summary":"As the largest economy of mankind, Naya launched the angel coming plan to transform human genes. The project failed. Naya was occupied by the crazy gene scientist Longli. As a former executive of Naya, grace began to fight against evil. This work is a third person shooting game.","genres":["Role-playing (RPG)","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1636329600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co59mg.jpg","external_ids":[]},{"igdb_id":205820,"name":"Xango Tango","summary":"Help this amazing toy robot ‘Xango’ find his upgrade parts in this brain-stretching, 3D animated action puzzle adventure. Match 3 colored crates and watch ’em explode in Classic mode. Solve brain-twisting puzzles in Puzzle mode, or sit back, relax, and play without time pressure in Relax mode. Exotic landscapes, lively tango music and wacky dances make this lively adventure fun for the entire family. Help Xango find all of his parts to witness the surprise ending!","genres":["Puzzle"],"developers":["Freeze Tag Inc."],"publishers":["Freeze Tag Inc.","MumboJumbo"],"aggregated_rating":null,"release_date":1161820800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coa67w.jpg","external_ids":[]},{"igdb_id":270503,"name":"Xaxa Machine","summary":"A video drug-like CD-ROM by Hideki Nakazawa, a leading expert in stupid CG. It's like watching the psychedelic screen move with a uni-uni, but this CD-ROM has a stupid mode that allows the poop to uni-uni and play with a special stupid brush.","genres":["Point-and-click"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":775699200,"platforms":["Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co76zc.jpg","external_ids":[]},{"igdb_id":75933,"name":"Xagia Wars","summary":"Xagia Wars is an epic fantasy tale about Magic, Courage, and Friendship that revolves around Isaac Victor, a young man brimming with talent living his daily wizardry school life. \nBut his fate is already determined, as Cahos the resurrected one will bring the end to the world. What kind of fate awaits him?","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1546214400,"platforms":["Linux","PC (Microsoft Windows)","Mac"],"cover_url":null,"external_ids":[]},{"igdb_id":284247,"name":"Xanadu Land","summary":"Xanadu Land is a fast-paced massively multiplayer bullet hell game that brings you to the arcade gameplay. In the nonstop BOSS battle, your death is just the beginning，accumulate experience, acquire equipment, and fight side by side with other players to knockdown all the bosses!","genres":["Role-playing (RPG)","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1754092800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7olw.jpg","external_ids":[]},{"igdb_id":46467,"name":"XAOC","summary":"XAOC is a MMORPG with almost 4 million words of original story about the eastern deities. In this epic journey of the ancient Chinese, the story dramatically evolves when chemicals such as ethnicity, culture, belief, religion, and emotions come together.","genres":["Role-playing (RPG)"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1501027200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cob4wj.jpg","external_ids":[]},{"igdb_id":158625,"name":"X Air Combat","summary":"The player controls the plane to fight the enemy in the sky, and the perspective of the game is third person.","genres":["Shooter","Indie"],"developers":["Coke Cat Studio"],"publishers":["Coke Cat Studio"],"aggregated_rating":null,"release_date":1610064000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3l8k.jpg","external_ids":[]},{"igdb_id":149326,"name":"Xagonia Colony","summary":"Terraform, decorate and grow plants to customize your Xagonia Colony. Go on a roguelike adventure to nearby planets and collect special resources for your colony. Invite alien residents to build a diverse town on the cozy planet.","genres":["Simulator","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3l8j.jpg","external_ids":[]},{"igdb_id":267372,"name":"Xavix Bowling","summary":"\"Xavix Bowling\" is software exclusively for Xavix Port released by SSD Co. in 2004. Xavix Port is a game machine that mainly releases sensory games, and with this software you can actually move your body and play virtual bowling using a dedicated bowling ball-shaped controller.\nThis work can be said to be the successor to \"Excite Bowling\" released in Japan, and the image quality has been improved due to the evolution of the Xavix chip.","genres":["Simulator","Sport"],"developers":["SSD Company Limited"],"publishers":["SSD Company Limited"],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co73n2.jpg","external_ids":[]},{"igdb_id":94932,"name":"Xatax","summary":"Xatax is a side-scrolling shooter in which the player must defend the remains of the Alliance's guilds against the titular aliens. This is accomplished in a traditional shoot-em-up fashion, fighting waves of alien ships and stationary turrets. The player-controlled ship can become stronger by collecting power capsules dropped by defeated enemies.\n\nThe game features three different worlds, of which the shareware version only contains the first.","genres":["Shooter"],"developers":["Pixel Painters"],"publishers":["Pixel Painters"],"aggregated_rating":null,"release_date":788832000,"platforms":["DOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6xlp.jpg","external_ids":[]},{"igdb_id":159012,"name":"XA: Contra Los Cuatreros Galácticos","summary":"An advergame published in 2010 by Batovi Games Studio based on the Megaman series of games and created to advertise Calcar's products. Enjoy!","genres":["Shooter","Platform"],"developers":["Batovi Games Studio"],"publishers":["Calcar"],"aggregated_rating":null,"release_date":1293753600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3gff.jpg","external_ids":[]},{"igdb_id":42006,"name":"Xak I + II","summary":"Xak I & II is a re-release of Xak and Xak II, a fantasy role-playing video game series Xak developed and published by the Japanese software developer MicroCabin and Telenet Japan's development team Riot. This set contains both the first two Xak series games back-to-back on one complete Super Cd-Rom^2 with enhanced graphics and sound. In a similar style to Ys Books I & II, also for the PC-Engine system, Xak II, the second game in the series picks up immediately as the first game concludes.","genres":["Role-playing (RPG)"],"developers":["Micro Cabin"],"publishers":["Telenet Japan"],"aggregated_rating":null,"release_date":725241600,"platforms":["TurboGrafx-16/PC Engine"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3bgn.jpg","external_ids":[]},{"igdb_id":54665,"name":"Xanthius","summary":null,"genres":["Platform"],"developers":[],"publishers":["Players Software"],"aggregated_rating":null,"release_date":567907200,"platforms":["ZX Spectrum"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/oybf5vqeflkoczr6j5pi.jpg","external_ids":[]},{"igdb_id":30840,"name":"Xark","summary":"** Currently only supports the Vive **\n** Currently in early access / alpha testing **\n\nDelve deep into hidden dungeons. Explore, fight, find, level up.","genres":["Role-playing (RPG)","Strategy","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]},{"igdb_id":41775,"name":"Xak Precious Package: The Tower of Gazzel","summary":"Xak Precious Package: The Tower of Gazzel is a fantasy role-playing video game developed and published by the Japanese software developer MicroCabin. The game is a direct sequel to Xak: The Art of Visual Stage and Xak II: The Rising of the Red Moon. While technically being the third installment of the series, The Tower of Gazzel is a side story taking place between the events of Xak II and Xak III.","genres":["Role-playing (RPG)"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":676857600,"platforms":["PC-8800 Series","MSX"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6iho.jpg","external_ids":[]},{"igdb_id":31185,"name":"Xarq: The Zimmerman Trenches","summary":null,"genres":["Shooter","Arcade"],"developers":[],"publishers":["Electric Dreams Software"],"aggregated_rating":null,"release_date":536371200,"platforms":["ZX Spectrum","Amstrad CPC"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/vvwpnjzkvppqrbclqt3k.jpg","external_ids":[]},{"igdb_id":120983,"name":"Xander the Monster Morpher: Universe Breaker","summary":"A Monster-Catching third person shooter! Fuse monsters together to create the ultimate team!","genres":["Role-playing (RPG)","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1564704000,"platforms":["Android","PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2do4.jpg","external_ids":[]},{"igdb_id":70129,"name":"Xargon","summary":"The basic goal of Xargon is to advance through the map by completing levels. To finish a level, the player must find and reach the exit, which is found by traversing throughout the level.\n\nXargon is unique in the sense that the player can purchase items at any point during the game. Emeralds are randomly placed in most levels. Purchasable items include health units, invincibility, and weapon upgrades.","genres":["Platform","Arcade"],"developers":["Epic MegaGames"],"publishers":["Epic MegaGames","Wiz Technology"],"aggregated_rating":null,"release_date":758592000,"platforms":["DOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2lig.jpg","external_ids":[]},{"igdb_id":112633,"name":"X Archetype","summary":"X Archetype is a Side Scrolling Fast Paced Shooter. Decide which stage to take down and gain its upgrades. Dash, Jump, Wall jump, High jump, Double Jump, Wall Slide, 360 Degree Aiming are what you start with, and you gain insane Upgrades Each Stage you beat.","genres":["Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1543881600,"platforms":["Linux","PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3l8p.jpg","external_ids":[]},{"igdb_id":41768,"name":"Xak II: Rising of the Redmoon","summary":"Xak II: Rising of the Redmoon is a Role-Playing game, developed and published by Micro Cabin, which was released in Japan in 1991.","genres":["Role-playing (RPG)"],"developers":["Micro Cabin"],"publishers":[],"aggregated_rating":null,"release_date":633830400,"platforms":["PC-8800 Series","MSX"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co626n.jpg","external_ids":[]},{"igdb_id":271576,"name":"Xala'noth: Part 1","summary":"Medium-sized level using GothicDM and Knave textures and featuring strong colored lighting. It comes with a start map, a custom skybox and a music track by the author.","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1578787200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co781o.jpg","external_ids":[]},{"igdb_id":62583,"name":"Xanadu Scenario II","summary":"One of the first examples of an expansion pack, this was an additional scenario disk for the action role-playing game Xanadu: Dragon Slayer II.","genres":["Platform","Role-playing (RPG)"],"developers":["Nihon Falcom"],"publishers":["Nihon Falcom"],"aggregated_rating":null,"release_date":528508800,"platforms":["PC-8800 Series","Sharp X1"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/v1entstok6vmvxotet5m.jpg","external_ids":[]},{"igdb_id":272711,"name":"Xatrom Command","summary":"Team up and shoot down waves of invading aliens. Single player or multiplayer top-down shooting action","genres":["Shooter","Indie","Arcade"],"developers":["9Ratones","LEAF TEAM GAMES"],"publishers":["Ratalaika Games"],"aggregated_rating":null,"release_date":1709856000,"platforms":["Xbox Series X|S","PlayStation 4","PC (Microsoft Windows)","PlayStation 5","Xbox One","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co79a3.jpg","external_ids":[]},{"igdb_id":302410,"name":"Xargon: Remake Ep. 2","summary":"A remake of the classic 1993 DOS video game Xargon.","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1715040000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8gd7.jpg","external_ids":[]}]