[{"igdb_id":78050,"name":"Xuan-Yuan Sword 5: A Sword Above the Clouds and the Sentiments of the World of Shanhai","summary":"The main character Lu Chengxuan (陸承軒) killed his parents as a result of not being able control his mysterious power, and was about to die in the wilderness as an outcast when he was coincidentally brought to the World of Shanhai through a portal created by Huangfu Muyun (皇甫暮雲), a powerful wielder of sword energy and the avatar of the Xuanyuan Sword, using the Pangu Axe. There, he encounters Xia Rou (夏柔), second empress of the Kingdom of Women. The two traveled around the world, meeting with people from other kingdoms, and set out to accomplish a task given to them by the Elder of the Green Dragon Kingdom, leading to a confrontation with the exiled Princess of Heaven, Qing'er (青兒), who helped the Yellow Emperor, Ji Xuanyuan (姬軒轅), claim the mortal world for humans and was banished due to her newly acquired form causing cataclysmic droughts after expending her power in aiding him in reforging the sword that would later be known as the Xuan Yuan Sword.","genres":["Role-playing (RPG)","Turn-based strategy (TBS)","Adventure"],"developers":["Softstar Entertainment Inc.","DOMO Studio"],"publishers":["Softstar Entertainment Inc."],"aggregated_rating":null,"release_date":1154476800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2le3.jpg","external_ids":[{"category":null,"store":"store_None","uid":"18372","url":"https://www.twitch.tv/directory/game/Xuanyuan Jian 5: Yi Jian Ling Yun Shan Hai Qing"},{"category":null,"store":"store_None","uid":"1728520","url":"https://store.steampowered.com/app/1728520"},{"category":null,"store":"store_None","uid":"20095","url":"https://www.giantbomb.com/games/3030-20095/"}]},{"igdb_id":78056,"name":"Xuan-Yuan Sword: Dance of the Maple Leaves","summary":"Being the first game in the series to have connection with real world history, Dance of the Maple Banners inherited most of the previous game's interface, arts, and battle system, with subtle modifications, and wrapped with new plot. More realistic ancient war machines were made alive, while historical figures such as Mozi, Lu Ban, Sun Bin, could be encountered in the game. \n \nAs were the cases with most other standalone tales titles, players do not have the chance to wield the Sword. In this game the Sword is in Shu Sangzi's possession, and is used against players. In the final battle, Shu uses a move called Xuan-Yuan Sword Technique (軒轅劍法), which inflicts serious damage to the player party.","genres":["Role-playing (RPG)","Turn-based strategy (TBS)"],"developers":["Softstar Entertainment Inc.","DOMO Studio"],"publishers":["Softstar Entertainment Inc."],"aggregated_rating":null,"release_date":789350400,"platforms":["PC (Microsoft Windows)","iOS","DOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2l77.jpg","external_ids":[{"category":null,"store":"store_None","uid":"1508750","url":"https://store.steampowered.com/app/1508750"},{"category":null,"store":"store_None","uid":"6602","url":"https://www.twitch.tv/directory/game/Xuanyuan%20Jian%202%20Waizhuan%3A%20Feng%20zhi%20Wu"},{"category":null,"store":"store_None","uid":"7223","url":"https://www.giantbomb.com/games/3030-7223/"}]},{"igdb_id":79218,"name":"Xuan-Yuan Sword: The Han Clouds","summary":"The game is set in the era of the Three Kingdoms, Wei, Shu and Wu and feature famous historic figures. Zhuge Liang, the chancellor of the kingdom of Shu had engaged on multiple northward military expeditions with little success. On Zhuge Liang's Third Expedition, a secret military group called \"Fei Yu\" (飛羽)(meaning Flying Feather, deriving its name from the two famous generals of Shu kingdom - Zhang Fei and Guan Yu)carried out various missions in the war to further the interests of Shu. However, on the Fourth Expedition, Thanks to its own group of powerful secret operatives, Wei was able to discover and exploit critical weaknesses of Shu, prompting The Feathers to take action. The game addresses issues of loyalty and duty, as well as the harsh realities of warfare and peace.\n\nA live-action television series based on the game has been released.","genres":["Role-playing (RPG)","Turn-based strategy (TBS)","Adventure"],"developers":["DOMO Studio","SOFTSTAR Entertainment"],"publishers":["SOFTSTAR Entertainment"],"aggregated_rating":null,"release_date":1198022400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2le6.jpg","external_ids":[{"category":null,"store":"store_None","uid":"10669","url":"https://www.giantbomb.com/games/3030-10669/"},{"category":null,"store":"store_None","uid":"1870140","url":"https://store.steampowered.com/app/1870140"},{"category":null,"store":"store_None","uid":"9789","url":"https://www.twitch.tv/directory/game/Xuanyuan Jian Waizhuan: Han zhi Yun"}]},{"igdb_id":81534,"name":"Xuan-Yuan Sword 4: The Black Dragon Dances as the Storm Rages","summary":"This game is the fourth installment of the main series. The game is the first to be presented in 3D, both in environment and in combat.","genres":["Role-playing (RPG)","Turn-based strategy (TBS)"],"developers":["Softstar Entertainment Inc."],"publishers":["Softstar Entertainment Inc."],"aggregated_rating":null,"release_date":1028419200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2l79.jpg","external_ids":[]},{"igdb_id":85727,"name":"Xuan-Yuan Sword: Mists Beyond the Mountains","summary":"This Game is one of the most popular RPGs in the Chinese Speaking Area and has won many awards around Asia. The game story takes place in an era of collision between East and West, covering a wide range, spanning Eurasia, the Arab World, Francia, and China.\n\nXuan-Yuan Sword: Mists Beyond the Mountains is a classic turn-based RPG. Under the orders of Pepin III, the Frankish Knight Septem has embarked on a long journey to seek the Invincible Arts of War. Starting from the canals of beautiful Venice, the great knight's path has spanned the Middle East, Western Regions on his way to the mystical orient. In his adventures, Septem has drawn into the intricate power disputes between local powers, along with the decade-spanning ambitions of the dark lord, Satan.\n\nChina enjoys peace and prosperity under the rule of the Tang Empire, Europe finds itself embroiled in the Dark Ages, the Arabian Empire is ascendant, and all the while, the march of progress brings these disparate cultures together. From ancient times, Chinese legends have spoken of the Xuan-Yuan Sword and Spirit Fusion Pot, along with the rise of great legends in the new era...\n\nThe scope of Xuan-Yuan Sword: Mists Beyond the mountains covers a wide range, spanning all of Eurasia and covering the Arab World, Francia, and China. From the canals of Venice, Damascus to the beautiful Chang’an, the story introduces unique architectural styles, clothing, food, and customs.\n\nPlayers can use the Spirit Fusion Pot to capture enemies in battle. Items and monsters can be used to craft a new item or monster from the codex. Users can craft items and monsters from the Eastern or Western altars, which the resulting item differing based on the selected altar.","genres":["Role-playing (RPG)","Turn-based strategy (TBS)","Adventure"],"developers":["SOFTSTAR Entertainment"],"publishers":["SOFTSTAR Entertainment"],"aggregated_rating":null,"release_date":944265600,"platforms":["PC (Microsoft Windows)","iOS","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co73wb.jpg","external_ids":[{"category":null,"store":"store_None","uid":"2385","url":"https://www.twitch.tv/directory/game/Xuan-Yuan%20Sword:%20Mists%20Beyond%20the%20Mountains"},{"category":null,"store":"store_None","uid":"B0CSF12BDQ","url":"https://amazon.com/dp/B0CSF12BDQ"},{"category":3,"store":"store_3","uid":"2598","url":"https://www.giantbomb.com/games/3030-2598/"}]},{"igdb_id":86029,"name":"Xuan-Yuan Sword: The Millennial Destiny","summary":"The game opens with an alternate version of the Battle of Fei River, a battle between Former Qin and Eastern Jin. It concludes with Eastern Jin's surrender to Former Qin. Former Qin merged with Eastern Jin and united the entirety of China.\n\nOn December 3, 2015, an animated series inspired by the game called Xuan Yuan Sword Luminary (軒轅劍：蒼之曜 / Ken En Ken: Aoki Kagayaki, literally \"Xuan-Yuan Sword: Lights of the Bleak\") was announced as a collaborative project with TV Tokyo and Studio Deen and began airing on October 2, 2018 in Mainland China, Taiwan, as well as Japan.","genres":["Role-playing (RPG)","Turn-based strategy (TBS)"],"developers":["SOFTSTAR Entertainment","DOMO Studio"],"publishers":["SOFTSTAR Entertainment"],"aggregated_rating":null,"release_date":1076025600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ldy.jpg","external_ids":[]},{"igdb_id":90974,"name":"Xuan Yuan Sword: The Gate of Firmament","summary":"The “Xuan-Yuan Sword” is an epic oriental RPG series with 25 years of history.It elaborates on the very heart of this series, the idea of \"one, looking at the same thing from different angles, may come to different conclusions. \" through a variety of historical incidents in different times.\n\nFeatures :\n1. New facial animation and lip-sync systems to enhance facial expression and animation.\n2. New MVN motion capture system that creates real-time character animation.\n3. Real-time combat to make the combat look much more realistic, intense, and diverse.\n4. New Battle field System to make the game much more fun and enjoyable to play.\n5. New Cauldron System (the Urn of Spirit Infusion) to synthesize demons as well as refine or even upgrade their equipments to a better one.\n6. New Guardian System to enable players to capture demons and use them in the game as a combat companion.\n7. New Talisman system that will add additional buffs to players when equipped.","genres":["Role-playing (RPG)","Adventure"],"developers":["DOMO Studio"],"publishers":["SOFTSTAR Entertainment"],"aggregated_rating":null,"release_date":1424822400,"platforms":["PlayStation 4","PC (Microsoft Windows)","PlayStation 5","Xbox One"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2leg.jpg","external_ids":[{"category":null,"store":"store_None","uid":"225004","url":"https://store.playstation.com/en-us/concept/225004"},{"category":null,"store":"store_None","uid":"52840","url":"https://www.giantbomb.com/games/3030-52840/"},{"category":null,"store":"store_None","uid":"BZ014X1JTNW1","url":"https://www.microsoft.com/en-us/store/p/igdb.com/BZ014X1JTNW1"},{"category":null,"store":"store_None","uid":"1307340932","url":"https://www.twitch.tv/directory/game/Xuan%20Yuan%20Sword:%20The%20Gate%20of%20Firmament"},{"category":null,"store":"store_None","uid":"427030","url":"https://store.steampowered.com/app/427030"}]},{"igdb_id":93064,"name":"Xuan-Yuan Sword","summary":"The game featured standard VGA 16-colored 640x480 screen, complete with party-members, round-based combat, full-screen sprite animation, various monsters, Chinese-styled AdLb music, sound effects, animated spell effects, as well as full Chinese interface, which was a great hit in Taiwan's computer game market at that period.","genres":["Role-playing (RPG)","Turn-based strategy (TBS)"],"developers":["Softstar Entertainment Inc."],"publishers":["Softstar Entertainment Inc."],"aggregated_rating":null,"release_date":655776000,"platforms":["DOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2kde.jpg","external_ids":[]},{"igdb_id":93555,"name":"Xuan Dou Zhi Wang","summary":"Xuan Dou Zhi Wang (tentatively translated for an international audience as King of Combat) is an online PC fighting game by Jade Studio for Tencent. \n \nThe game is influenced by the series The King of Fighters, both in gameplay and art design. It is generally considered the development of the game responds to the need of Chinese players to be able to play The King of Fighters (or at least something \"similar\") at home, since video game consoles sale was banned in China by the time.","genres":["Fighting"],"developers":["Jade Studio"],"publishers":["Tencent Games"],"aggregated_rating":null,"release_date":1325289600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1kl1.jpg","external_ids":[]},{"igdb_id":100097,"name":"Xuan-Yuan Sword 2","summary":"Many key features of the game series were introduced with this game. It was set in 320×240 256-colored screen (in the once-popular VGA X-mode). In-game artworks such as scenes, monsters, character portraits, items were fashioned in Chinese painting style.","genres":["Role-playing (RPG)","Turn-based strategy (TBS)"],"developers":["Softstar Entertainment Inc."],"publishers":["Softstar Entertainment Inc."],"aggregated_rating":null,"release_date":760665600,"platforms":["DOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2kdf.jpg","external_ids":[{"category":null,"store":"store_None","uid":"12008","url":"https://www.giantbomb.com/games/3030-12008/"},{"category":null,"store":"store_None","uid":"11031","url":"https://www.twitch.tv/directory/game/Xuanyuan Jian 2"},{"category":null,"store":"store_None","uid":"1508740","url":"https://store.steampowered.com/app/1508740"}]},{"igdb_id":106678,"name":"Xuan-Yuan Sword 3: The Scar of the Sky","summary":"The Magic System is revamped in this game. All magics now belong to one of the five elements of metal, wood, water, fire, and earth in Chinese mythology.\n\nThe game was released on December 2, 2000. A television series based from the game, produced by Chinese Entertainment Shanghai Limited, starring Hu Ge and Cecilia Liu, aired in 2012.","genres":["Role-playing (RPG)"],"developers":["Softstar Entertainment Inc.","DOMO Studio"],"publishers":["Softstar Entertainment Inc."],"aggregated_rating":null,"release_date":975715200,"platforms":["Android","PC (Microsoft Windows)","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ldx.jpg","external_ids":[]},{"igdb_id":112990,"name":"Xuece Border","summary":"The first chapter of Xuece Border is the shooting game of post-modern war type.","genres":["Indie"],"developers":["重庆聚心动科技有限责任公司"],"publishers":["重庆聚心动科技有限责任公司"],"aggregated_rating":null,"release_date":1541635200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cob0ok.jpg","external_ids":[]},{"igdb_id":124643,"name":"Xuan-Yuan Demonbane Chronicles","summary":"This is an experimental strategy RPG utilizing 3D environments with 2D character sprites set in an alternate continuity to the core Xuan-Yuan Sword games, but still contains a few elements related to Xuan-Yuan Sword 3. The protagonist Fu Zixun (輔子洵) is a young man who goes on a journey after of his clan's destruction and the Monster Fusion Vessel's theft caused by Jiutian (九天), the malevolent entity the protagonist's younger clan sister Zhu Yuanyuan (朱媛沅) accidentally unleashed. On his journey, he encounters allies including Ding Yun (丁芸), the kind and trusting daughter of a renowned doctor, Jiang Wushuang (江無雙), a bossy young girl who ran away from home and leads a group of bandits she defeated, Zuo Zhenhe (左震河), a respected and mighty guard leader for transporting goods, Qiu Qianli (裘千里), a skilled but kind-hearted thief, Leng Zhongqiu (冷仲秋), a stoic hero with a dark past, Qise (七色), a fox spirit with a feminine human form who is the elder sister to Jiutian, and Liang Cuo (梁錯), a slightly bumbling young man from a secretive family known for skills in engineering and the occult.","genres":["Role-playing (RPG)","Turn-based strategy (TBS)"],"developers":["DOMO Studio","Softstar Entertainment Inc."],"publishers":["Softstar Entertainment Inc."],"aggregated_rating":null,"release_date":981763200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2l7d.jpg","external_ids":[{"category":null,"store":"store_None","uid":"72349","url":"https://www.giantbomb.com/games/3030-72349/"},{"category":14,"store":"playstation","uid":"511585","url":"https://www.twitch.tv/directory/game/Xuanyuan%20Fu%20Mo%20Lu"}]},{"igdb_id":126038,"name":"Xuan-Yuan Sword: The Clouds Faraway","summary":"軒轅劍外傳: 雲之遙 (Chinese) \nThe Clouds Faraway, also set in the era of the Three Kingdoms, is presented with a contrasting viewpoint to the Han Clouds. The main character, Xu Muyun (徐暮雲), was adopted by Xu Shu and raised in the Kingdom of Wei. Muyun grew up with his childhood friends Lanyin (蘭茵) and Zhang Gao (張誥) in the house of Zhang He, and the three youngsters vowed to fight for their homeland and bring about prosperous days together. Through his journey, Muyun came to a new level of maturity, learned of his true identity, realized the meaning of duty and friendship, and witnessed the ruthlessness of war. \n \nThe story is continued after the main game in three DLC chapters, released to enrich the story. These three chapters are: The Chapter of Wuzhang Plains: Muyun (Chinese: 五丈原暮雲篇), The Chapter of Wuzhang Plains: Zhaoyun (Chinese: 五丈原朝雲篇), and the lengthy and critically acclaimed Chapter of Lan Yin (Chinese: 蘭茵篇).","genres":["Role-playing (RPG)","Turn-based strategy (TBS)","Adventure"],"developers":["Softstar Entertainment Inc.","DOMO Studio"],"publishers":["Softstar Entertainment Inc."],"aggregated_rating":null,"release_date":1263254400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2le7.jpg","external_ids":[{"category":3,"store":"store_3","uid":"72361","url":"https://www.giantbomb.com/games/3030-72361/"},{"category":14,"store":"playstation","uid":"511608","url":"https://www.twitch.tv/directory/game/Xuanyuan%20Jian%20Waizhuan%3A%20Yun%20zhi%20Yao"}]},{"igdb_id":126039,"name":"Xuan-Yuan Sword 6: The Phoenix Soars in the Sky among Millennial Clouds","summary":"軒轅劍陸: 鳳凌長空千載雲(Chinese) \nIn c. 1046 BCE, the Battle of Muye erupted. The leader of the Zhou of the west, Ji Fa, took the opportunity presented when King Zhou of Shang rallied his forces in a southeastern expedition and when the Shang capital of Zhaoge was undefended to form an alliance with leaders in the west at Mengjin to perform a swift strike against the capital. \n \nThe DLC Chapter of Zhuo Shanzhu (濁山鑄篇), released as an free update, features a story involving Zhuo Shanzhu (濁山鑄), the elder brother of Rong Shuang previously presumed to be dead, and his investigation of the nature of Black Fire, the Black Fire Sect, and the history and technology of the lost kingdom of Sanmu.","genres":["Role-playing (RPG)","Turn-based strategy (TBS)","Adventure"],"developers":["Softstar Entertainment Inc.","DOMO Studio"],"publishers":["Softstar Entertainment Inc."],"aggregated_rating":null,"release_date":1325635200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2le9.jpg","external_ids":[{"category":14,"store":"playstation","uid":"511609","url":"https://www.twitch.tv/directory/game/Xuanyuan%20Jian%206%3A%20Feng%20Ling%20Chang%20Kong%20Qian%20Zai%20Yun"},{"category":3,"store":"store_3","uid":"72360","url":"https://www.giantbomb.com/games/3030-72360/"}]},{"igdb_id":130928,"name":"Xuan Chen Xian Tu","summary":"\"Xuan Chen Xian Tu\" is a Q version of the large-scale multiplayer online role-playing game of the Xian Xia style. Click-to-play game features, players can ride the wind sword in the game, experience the thrill of cultivation.","genres":["Role-playing (RPG)"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1572220800,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[{"category":null,"store":"store_None","uid":"1169790","url":"https://store.steampowered.com/app/1169790"},{"category":null,"store":"store_None","uid":"79110144","url":"https://www.twitch.tv/directory/game/Xuan%20Chen%20Xian%20Tu"}]},{"igdb_id":132675,"name":"Xuan-Yuan Sword VII","summary":"Xuan-Yuan Sword VII is an ARPG rooted in Chinese history and mythology. Players take on the role of Taishi Zhao, a calm and reliable swordsman who was accidentally involved in a tragic fate. To protect his beloved family, he starts a journey in this chaotic realm to find the truth.","genres":["Role-playing (RPG)","Adventure"],"developers":["DOMO Studio","Softstar Entertainment Inc."],"publishers":["Softstar Entertainment Inc.","Yooreka Studio"],"aggregated_rating":65.0,"release_date":1603843200,"platforms":["PlayStation 4","PC (Microsoft Windows)","Xbox One","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2i5j.jpg","external_ids":[{"category":null,"store":"store_None","uid":"10001678","url":"https://store.playstation.com/en-us/concept/10001678"},{"category":null,"store":"store_None","uid":"516681","url":"https://www.twitch.tv/directory/game/XuanYuan%207"},{"category":null,"store":"store_None","uid":"B095ZDN58H","url":"https://amazon.jp/dp/B095ZDN58H"},{"category":20,"store":"amazon","uid":"B0967NHYC2","url":"https://amazon.es/dp/B0967NHYC2"},{"category":null,"store":"store_None","uid":"B095ZDN58H","url":"https://amazon.jp/dp/B095ZDN58H"},{"category":3,"store":"store_3","uid":"77570","url":"https://www.giantbomb.com/games/3030-77570/"},{"category":26,"store":"epic","uid":"9ac5d04e37004d698d6a08da6ebb3c1d","url":"https://store.epicgames.com/en-US/p/xuan-yuan-sword-7-22c442"},{"category":null,"store":"store_None","uid":"B095ZDN58H","url":"https://amazon.com/dp/B095ZDN58H"},{"category":20,"store":"amazon","uid":"B08H5Y3628","url":null},{"category":20,"store":"amazon","uid":"B0967JTM4B","url":"https://amazon.fr/dp/B0967JTM4B"},{"category":null,"store":"store_None","uid":"B0967NHYC2","url":"https://amazon.fr/dp/B0967NHYC2"},{"category":null,"store":"store_None","uid":"B095ZJSPR4","url":"https://amazon.com/dp/B095ZJSPR4"},{"category":null,"store":"store_None","uid":"B095ZJSPR4","url":"https://amazon.jp/dp/B095ZJSPR4"},{"category":20,"store":"amazon","uid":"B0967JTM4B","url":"https://amazon.es/dp/B0967JTM4B"},{"category":20,"store":"amazon","uid":"B0967JTM4B","url":"https://amazon.co.uk/dp/B0967JTM4B"},{"category":11,"store":"android","uid":"9P427RGRK91M","url":"https://www.microsoft.com/en-us/p/-1-/9P427RGRK91M"},{"category":null,"store":"store_None","uid":"1249800","url":"https://store.steampowered.com/app/1249800"},{"category":20,"store":"amazon","uid":"B08H5Y142C","url":null},{"category":20,"store":"amazon","uid":"B0967NHYC2","url":"https://amazon.co.uk/dp/B0967NHYC2"},{"category":5,"store":"gog","uid":"1112324255","url":"https://www.gog.com/game/xuanyuan_sword_vii"},{"category":5,"store":"gog","uid":"1671224215","url":"https://www.gog.com/en/game/xuanyuan_sword_vii"}]},{"igdb_id":138434,"name":"Xump: The Final Run","summary":"XUMP is a puzzle game by Psilocybin Development. The game is simple but will keep you busy for hours, and thats a promise!\n\nThe game consists of a 20x12 playfield which is filled with various types of blocks. Your job is to make the blue blocks disappear from the playfield by stepping on them. There are five main types of block, each of which behave differently.\n\nThe first levels are for 'easy entertainment'. At first the levels are small, then get bigger and harder at each stage. Even if you do not read the instructions here, you should be able to handle the game when you start at level 1. To make everything a bit more tricky keep track of the time, but don't panic.\n\nIf you solve a level without fault you will get a 'well done'. This 'well done' is worth one extra chance, otherwise you will just get a 'done' without any bonus. A 'well done' is the only possibility in this game to get an extra life.\n\nXump has participated in the 16 Days Coding Competition.","genres":["Puzzle"],"developers":["Psilocybin Development"],"publishers":["Psilocybin Development"],"aggregated_rating":null,"release_date":1130112000,"platforms":["Linux","PC (Microsoft Windows)","Legacy Mobile Device","Dreamcast"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3c9q.jpg","external_ids":[]},{"igdb_id":153828,"name":"Xump: The Final Run","summary":"This version of Xump is an extended remake of the puzzle game Xump: The Final Run (which in turn is similar to the C64 game Sensitive) with improved graphics and new levels.\n\nThe goal is still the same: With your bot \"Xump\" you will have to remove all blue tiles on platforms somewhere in the sky by moving over them. A bit of planning is required, as you (obviously) can move onto such a blue tile only once. The levels have a time limit, so it's required to think quickly.\n\nApart from the blue tiles the game also contains solid grey tiles that won't disappear, teleporters to move between two locations, bombs that act as a second layer for the tile (so you have to visit the tile twice to remove it) and arrows that will automatically push you into the arrow's direction.","genres":["Puzzle"],"developers":["Retroguru"],"publishers":["Retroguru"],"aggregated_rating":null,"release_date":1400025600,"platforms":["BlackBerry OS","Atari Lynx","Nintendo GameCube","Linux","Wii","Android","PC (Microsoft Windows)","Mac","Amiga","PlayStation Portable","Legacy Mobile Device","Dreamcast","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3c9w.jpg","external_ids":[]},{"igdb_id":167135,"name":"Xuan-Yuan Sword VII: Limited Edition","summary":"This edition includes the following:\n\n- Xuan-Yuan Sword VII\n- Special Collector Box\n- Steelbook\n- Original Soundtrack\n- Visual Book","genres":["Role-playing (RPG)"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":185904,"name":"Xuxa e os Duendes 2: No Caminho das Fadas","summary":"Play with Xuxa! Have fun in this enchanting world and fight to keep love in passionate hearts. Be Kira, the Elf of Light, and battle witches and trolls to break the spell of Witch Algaz in the Witches' Castle.","genres":["Platform"],"developers":["Continuum Entertainment"],"publishers":["Brasoft Produtos de Informática"],"aggregated_rating":null,"release_date":1038700800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4avg.jpg","external_ids":[]},{"igdb_id":196321,"name":"Xuan Yuan Sword Luminary","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":197539,"name":"XueFeng Mountain: Secret Opera","summary":"In the Spring Festival of 2005, the blizzard in Xuefeng mountain trapped the drama troupe performing in the village. At the same time, there was a homicide during the performance. Unlike the nervous members of the drama troupe, the villagers were afraid of a more terrible existence than the homicide","genres":["Simulator","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1718668800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co59l5.jpg","external_ids":[{"category":null,"store":"store_None","uid":"1888060","url":"https://store.steampowered.com/app/1888060"},{"category":14,"store":"playstation","uid":"670132860","url":"https://www.twitch.tv/directory/game/XueFeng%20Mountain:%20Secret%20Opera"}]},{"igdb_id":211373,"name":"Xump Jump","summary":"Xump Jump is exciting 2D platformer. Goal is to overcome all the obstacles and traps on the way and grab as many coins as you can. Best of luck!","genres":["Platform","Adventure"],"developers":["Zakym"],"publishers":["Zakym"],"aggregated_rating":null,"release_date":1659830400,"platforms":["PlayStation 4","PlayStation 5"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co516d.jpg","external_ids":[]},{"igdb_id":216479,"name":"Xuhivan's Autonomous Cube","summary":"Xuhivan's Autonomous Cube is a roguelite turn based brain twister on a fully functioning magic cube, where allies and enemies move deterministically without your command, requiring you to wisely choose fighters with bizzare fates and relics of extraordinary power.","genres":["Strategy","Turn-based strategy (TBS)"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1750204800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9qfa.jpg","external_ids":[]},{"igdb_id":245613,"name":"Xuxa","summary":null,"genres":[],"developers":["Micro Games of America"],"publishers":[],"aggregated_rating":null,"release_date":725760000,"platforms":["Handheld Electronic LCD"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7kqt.jpg","external_ids":[{"category":14,"store":"playstation","uid":"1413674389","url":"https://www.twitch.tv/directory/game/Xuxa"}]},{"igdb_id":267926,"name":"Xulaph Kaizo World","summary":null,"genres":["Platform"],"developers":["TheMURAmatsu"],"publishers":["TheMURAmatsu"],"aggregated_rating":null,"release_date":1585699200,"platforms":["Super Nintendo Entertainment System"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co74bi.jpg","external_ids":[]},{"igdb_id":281455,"name":"Xuxa","summary":null,"genres":["Arcade"],"developers":["Tiger Electronics"],"publishers":["Tec Toy"],"aggregated_rating":null,"release_date":null,"platforms":["Handheld Electronic LCD"],"cover_url":null,"external_ids":[{"category":14,"store":"playstation","uid":"1033254751","url":"https://www.twitch.tv/directory/game/Xuxa"}]},{"igdb_id":292382,"name":"Xurb","summary":"Society has collapsed, use any means to survive in XURB. Loot and shoot your way out of intense PvPvE raids. Use what you find to build up a camp, and recruit survivors you find along the way to help you. Play solo, or with friends, and explore the dangerously desolate exurbs.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xbx.jpg","external_ids":[{"category":null,"store":"store_None","uid":"2314350","url":"https://store.steampowered.com/app/2314350"},{"category":null,"store":"store_None","uid":"707677179","url":"https://www.twitch.tv/directory/game/Xurb"}]},{"igdb_id":302278,"name":"Xuan Yuan Sword Mystic RPG Bundle","summary":"From classic to modern, enjoy two beautiful stories in one amazing RPG bundle!","genres":["Role-playing (RPG)","Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1717027200,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co895m.jpg","external_ids":[]},{"igdb_id":311040,"name":"Xump 2: Back to Space","summary":null,"genres":["Puzzle"],"developers":["Retroguru"],"publishers":["Retroguru"],"aggregated_rating":null,"release_date":1588291200,"platforms":["Turbografx-16/PC Engine CD"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8xlk.jpg","external_ids":[{"category":null,"store":"store_None","uid":"521420728","url":"https://www.twitch.tv/directory/game/Xump%202:%20Back%20to%20Space"}]},{"igdb_id":336910,"name":"Xuan-Yuan Sword: Mists Beyond the Mountains","summary":"This Game is one of the most popular RPGs in the Chinese Speaking Area and has won many awards around Asia. The game story takes place in an era of collision between East and West, covering a wide range, spanning Eurasia, the Arab World, Francia, and China.","genres":["Role-playing (RPG)"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1690243200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9qec.jpg","external_ids":[]},{"igdb_id":336911,"name":"Xuan-Yuan Sword: Mists Beyond the Mountains -1999 Origin Version","summary":"This Game is one of the most popular RPGs in the Chinese Speaking Area and has won many awards around Asia. The game story takes place in an era of collision between East and West, covering a wide range, spanning Eurasia, the Arab World, Francia, and China.","genres":["Role-playing (RPG)"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]}]