[{"igdb_id":34568,"name":"Zxill: A Legend of Time","summary":"Fight, adventure and explore against the clock to collect the crystals and save the world. Perform this ancient ritual in time to witness the creation of a new larger world. Keep up the pace and watch your world expand. Fall behind and be cursed with saving the same world over and over. Die and risk losing everything...","genres":["Role-playing (RPG)","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1441324800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cob4xj.jpg","external_ids":[{"category":null,"store":"store_None","uid":"1934101465","url":"https://www.twitch.tv/directory/game/Zxill%3A%20A%20Legend%20of%20Time"},{"category":null,"store":"store_None","uid":"397830","url":"https://store.steampowered.com/app/397830"}]},{"igdb_id":45071,"name":"ZXE-D: Legend of Plasmalite","summary":"Playstation three-dimensional plastic models that come to life with a proprietary system that allows the game to dynamically structure itself around your robot! Upper body, lower body, build your machine and bring peace back to mankind!","genres":["Fighting"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":853718400,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/un4l92y6dtqmau4hyt4e.jpg","external_ids":[{"category":null,"store":"store_None","uid":"52403","url":"https://www.giantbomb.com/games/3030-52403/"},{"category":14,"store":"playstation","uid":"492640","url":"https://www.twitch.tv/directory/game/ZXE-D:%20Legend%20of%20Plasmalite"}]},{"igdb_id":153505,"name":"Z-Xtricator","summary":"A Defender like (right only) side scrolling shooter. You are equiped with a laser to shoot enemies and a few super bombs destroying all enemies.\n\nWhile fighting of enemies you have to rescue prisoners on the ground by flying close to them (whatch for gravity pulling you down).\n\nThis \"high-resoluation\" game runs on a standard ZX81 with a 16K memory expansion module.","genres":["Arcade"],"developers":["The Software Farm"],"publishers":["The Software Farm"],"aggregated_rating":null,"release_date":473299200,"platforms":["Sinclair ZX81"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3b5j.jpg","external_ids":[{"category":14,"store":"playstation","uid":"205593166","url":"https://www.twitch.tv/directory/game/Z-Xtricator"}]},{"igdb_id":266803,"name":"ZXC","summary":"In a small notebook, an abandoned character was drawn without any story. For a long time, the character lived lonely and trapped in the notebook, but one day, the character gathered courage and decided to escape the notebook.","genres":["Adventure","Indie","Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1732752000,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co733s.jpg","external_ids":[]},{"igdb_id":281479,"name":"ZX Spectrum Pac-Man Arcade","summary":"This is a faithful conversion of the original Pac-Man arcade for the ZX Spectrum 48K. Everything was recreated with as much detail as possible through hours of reading of multiple Pac-Man guides and playing the original game. Being a conversion, some concessions were made to work around the limitations of the 48K but the overall result is still pretty close. The game runs at a silky smooth 50fps with game sound and no tearing or flickering.\n\nAll the level progression, logic, rules and timings are implemented exactly like the arcade. All the intermissions are included at the end of the right levels. All the ghost logic was replicated exactly as the original. A fix has been made to Inky's logic which had a bug in the original. Game does not \"crash\" like the original arcade at the end of level 256. It simply ends with a Game Over. It also supports a 2 Players game like the arcade.","genres":["Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1703894400,"platforms":["ZX Spectrum"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9dsx.jpg","external_ids":[{"category":14,"store":"playstation","uid":"479174524","url":"https://www.twitch.tv/directory/game/ZX%20Spectrum%20Pac-Man%20Arcade"},{"category":30,"store":"itch","uid":"2447545","url":"https://marco-leal-zx.itch.io/zx-pacman-arcade"}]},{"igdb_id":281532,"name":"ZXombies!","summary":"It's 1983 and the dead are rising from the grave. Who can save us?\n\nYou play Magenta, the 100% badass zombie slayer. As the sole survivor of her family, Magenta is on a mission to rid the earth of undead scum. Looking cool while she does it is a bonus too.\n\nTraveling tirelessly from market town to village, she trawls the graveyards for sport collecting trophies from the wretched prey. How much can she collect before the dead overwhelm her?","genres":["Shooter","Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1497312000,"platforms":["ZX Spectrum"],"cover_url":null,"external_ids":[{"category":14,"store":"playstation","uid":"293394188","url":"https://www.twitch.tv/directory/game/ZXombies%21"},{"category":30,"store":"itch","uid":"147989","url":"https://xenopunk.itch.io/zxombies"}]},{"igdb_id":289114,"name":"ZXFM","summary":"ZXFM is a football management simulator for the Sinclair ZX Spectrum written in just 10 lines of BASIC! Play an entire season as manager of a team from your favourite league, or create your own leagues and teams. Manage injuries, buy and sell in the transfer market and save your progress to tape or disk as you go along. ZXFM was inspired by the original 1982 \"Football Manager\" game by Kevin Toms (which was also written in BASIC but used over 700 lines of code!)","genres":["Simulator","Sport","Strategy"],"developers":[],"publishers":["BASIC 10Liner"],"aggregated_rating":null,"release_date":1707868800,"platforms":["ZX Spectrum"],"cover_url":null,"external_ids":[{"category":14,"store":"playstation","uid":"108451090","url":"https://www.twitch.tv/directory/game/ZXFM"},{"category":30,"store":"itch","uid":"2529503","url":"https://bunsen.itch.io/zxfm-sinclair-zx-spectrum-by-matthew-begg"}]},{"igdb_id":289127,"name":"ZXnake","summary":"The objective is to eat as many alien bugs as possible while you avoid crashing with the walls, snake's own body and tombstones. Aliens can jump after some time. Stages will change after enough aliens have been eaten.","genres":["Arcade"],"developers":[],"publishers":["BASIC 10Liner"],"aggregated_rating":null,"release_date":1709078400,"platforms":["ZX Spectrum"],"cover_url":null,"external_ids":[{"category":14,"store":"playstation","uid":"1067157334","url":"https://www.twitch.tv/directory/game/ZXnake"},{"category":30,"store":"itch","uid":"2555260","url":"https://bunsen.itch.io/zxnake-sinclair-zx-spectrum-by-moises-garin-escriva"}]},{"igdb_id":293359,"name":"ZX Terror House","summary":"You are alone in the middle of a stormy night, trapped in your broken-down car on a deserted road. The darkness is palpable, and the wind moans like an echoing wail. Desperate to find help, you venture through a shadowy cemetery that stretches in the direction of the only source of light you glimpse: an ancient mansion shrouded in terrifying legends.\n\nAs you make your way among the graves, killer bats flutter in the sky, emitting bloodcurdling screeches. The tombstones seem to come to life, lurching and lunging toward you, as if they have a will of their own to stop you at all costs. Every step you take is filled with danger and suspense, as you struggle through this cursed graveyard and reach the mansion of terror in search of salvation.\n\nFinally, you make it through the cemetery riddled with killer bats and deadly tombstones, arriving at the entrance to the mansion of terror. However, what you find inside is even more terrifying than you had imagined. As you enter the shadows of the mansion, you come face to face with three legendary figures of terror: Dracula, the Count of Vampires, the Werewolf and the Mummy.\n\nDracula, with his piercing gaze and sharp fangs, stares at you with vampiric hunger. The Werewolf, with deadly claws and glowing eyes, lies in wait, ready for the hunt. The Mummy, swathed in bandages and slow but relentless, advances toward you with sinister purpose.\n\nYou are in the midst of an encounter with horror itself. Your heart is pounding as you face these classic horror monsters while finding a way to survive and escape from the mansion of terror, unraveling the mysteries that envelop it.\n\nFrom out of the shadows emerges an even more terrifying figure: The Grim Reaper, holding a deadly scythe. With each swing of the scythe, you feel the cold wind of death brush against your skin. You must be quick and cunning to dodge his attacks.\n\nYou use your dodging skills and manage to avoid Death's scythe in a deadly dance. Finally, you find the opportunity to counterattack, and bravely take on Frankenstein. After a fierce fight, you manage to defeat him and the giant falls to the ground, inert.\n\nFinally, you discover an ancient coffin that contains the secrets of the heart of the beast and the way to escape from this world of nightmares.\n\nYou have managed to overcome all the horrors, defeat the monsters and find the solution to escape from the mansion of terror. Finally, you can breathe a sigh of relief, knowing that you have prevailed in this suspenseful and dangerous game. Congratulations on your bravery and determination! Or maybe NOT?","genres":["Adventure","Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1698451200,"platforms":["ZX Spectrum"],"cover_url":null,"external_ids":[]},{"igdb_id":307621,"name":"ZxZ","summary":null,"genres":["Puzzle"],"developers":["Ścisław \"drcz\" Dercz"],"publishers":["Ścisław \"drcz\" Dercz"],"aggregated_rating":null,"release_date":1642896000,"platforms":["Web browser"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8g2l.jpg","external_ids":[{"category":null,"store":"store_None","uid":"1804296561","url":"https://www.twitch.tv/directory/game/ZxZ"}]},{"igdb_id":319524,"name":"ZX Chess II","summary":"ZX Chess II is an improved version of ZX Chess I, a single-player chess game. In addition to the features of the previous version (custom board setup, printing etc.), the code enhancements include additional difficulty level, faster move calculation and an option for the player to ask the program to suggest a move.","genres":["Card & Board Game"],"developers":["Artic Computing Ltd."],"publishers":["Artic Computing Ltd."],"aggregated_rating":null,"release_date":378604800,"platforms":["Sinclair ZX81"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8xde.jpg","external_ids":[{"category":null,"store":"store_None","uid":"713366544","url":"https://www.twitch.tv/directory/game/ZX%20Chess%20II"}]},{"igdb_id":319525,"name":"ZX Compendium","summary":"ZX Compendium is a collection of six games and programs that contains:\n\nAlien Intruder: During a long space voyage to Earth, you have been woken from cryogenic suspension to find, to your horror, the rest of the crew devoured by an alien lifeform. To prevent yourself being the next item on the menu you have decided to collect enough essential supplies before escaping in a shuttle. The game is a text adventure with some graphics where the screen is split into two. The top half shows a map of one of the three levels of the ship with your location and the aliens if on the same level as you, a map showing your immediate surrounding area and any exits, and finally the supplies you need to collect which are oxygen, cells, water and food. The bottom half of the screen has text describing your current location and you type in commands with the keyboard to interact with each location. If you enter a location with the alien then you die but if the alien enters your location then you need to deal with the situation.\n\nWumpus Adventure: A text adventure that allows one to four players to move around an area hunting for creatures called a Wumpus to kill. Before you start the hunt you have a number of options and they are, choice of caverns (Novice, Random Cave Pattern and Professional Hunter), number of players, and if you hunt to the death or kill a certain amount of Wumpus. The actual game sees text on the screen describing each location of a player and the current player types in commands to interact with their surroundings. Each player gets one move before the next player has a turn. The players are armed with five arrows but more can be collected, and as well as Wumpus there are other creatures like Goblins and giant serpents that need to be dealt with.\n\nNumerology: A program that allows you to enter your name and birth date to receive a reading about your personality and find out your lucky number, colour and day of the week.\n\nHangman: Based on the pen and paper game, you can compete against the computer or another person as you try to guess a word without being hanged. A word is generated and you have to select a letter at a time to try to make the word. If you guess a correct letter then it appears in the word but get one wrong and a man being hanged on a scaffold starts to appear. The computer has two levels (1-2) to choose from.\n\nHieroglyphics: You have to decipher 39 Hieroglyphics by placing a letter or a vowel combination under the correct symbol and the computer will give you a word to help you decipher them. You must be careful in your guesses though because each wrong guess sees trapped explorer Wullie Makeit's tomb slowly fill with sand.\n\nMovie Mogul: A management game where with a limited budget you have to buy a script and attempt to make a movie and make a profit with it. After buying a script you decide which type of movie to make as well as hiring a director, actor and actress. You decide on each day of filming how much money to spend on various options watching your budget levels decrease. Once you have completed filming you are given a final score as a profit or loss for the finished movie.","genres":[],"developers":["Carnell Software"],"publishers":["Carnell Software"],"aggregated_rating":null,"release_date":441676800,"platforms":["Sinclair ZX81"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8xdg.jpg","external_ids":[{"category":null,"store":"store_None","uid":"1376833440","url":"https://www.twitch.tv/directory/game/ZX%20Compendium"}]},{"igdb_id":319602,"name":"ZX Asteroids","summary":"ZX Asteroids is based on the arcade game where you are a craft sitting in the middle of the screen surrounded by large asteroids moving about the screen. You have to blast all the asteroids, and when one is shot then it splits into smaller asteroids and keeps repeating the process until the asteroid has gone. You can turn your craft left or right 360 degrees but you can also move forwards. Occasionally an alien craft will appear and when shot gives you bonus points. If you are hit by an asteroid or the alien craft then you lose one of three lives. Two players can play and each player takes it in turns when the other player loses a life and there are five levels of play (1-5) with one being the easiest.","genres":["Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":410140800,"platforms":["Sinclair ZX81"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8xhi.jpg","external_ids":[{"category":14,"store":"playstation","uid":"1745565883","url":"https://www.twitch.tv/directory/game/ZX%20Asteroids"}]},{"igdb_id":328318,"name":"ZXD: Zombie Xtinction Defense","summary":"In a world devastated by a zombie apocalypse, you find yourself defending the last human city. You are humanity's final hope against the hordes of undead that threaten to wipe out life as we know it.","genres":["Strategy"],"developers":["GeeseBumpsGames"],"publishers":["GeeseBumpsGames"],"aggregated_rating":null,"release_date":1729641600,"platforms":["ZX Spectrum"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9aa8.jpg","external_ids":[{"category":14,"store":"playstation","uid":"1873224720","url":"https://www.twitch.tv/directory/game/ZXD:%20Zombie%20Xtinction%20Defense"},{"category":30,"store":"itch","uid":"3024122","url":"https://geese-bumps.itch.io/zxd"}]}]