[{"igdb_id":11882,"name":"A320 Airbus","summary":"If you want to fly a modern passenger jet then this is the sort of game for you. This is a serious simulation of flying which was developed in corporation with Lufthansa and Deutsche Airbus. The flying area includes most of Western Europe with about 80 airports. During gameplay you have to fly a specified route and navigate yourself by using the supplied map. There is also a training mode available.","genres":["Simulator"],"developers":[],"publishers":["Thalion Software"],"aggregated_rating":null,"release_date":694137600,"platforms":["Atari ST/STE","DOS","Amiga"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4o68.jpg","external_ids":[]},{"igdb_id":14151,"name":"A320","summary":"A320 Airbus is a flight simulator personal computer game released in 1991 in which the player pilots an Airbus A320. The game was developed over three years, with cooperation from Lufthansa, Deutsche Airbus and Jeppesen. Originally the game was written by Rainer Bopf on Amiga[1] and converted to the Atari ST by Christian Jungen.[2] Last known version of the game is 1.44.[1] \n \nIn 1993 Thalion published two data disks which could be played as a separate game. They were based on the latest version of the game engine. They focused on different flying areas. Europe Edition[3] covered the area of Europe and USA Edition[4] covered the area of USA. In the latter player was able to choose the region of West Coast USA or North East USA. \n \nIn 1995 Games 4 Europe software house published an official sequel called A320 Airbus Vol. 2. It was entirely written by Rainer Bopf with no additional help from third parties.[5]","genres":["Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":631065600,"platforms":["Atari ST/STE"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/acclwap3wvhdcm3fkrnv.jpg","external_ids":[{"category":14,"store":"playstation","uid":"1904907453","url":"https://www.twitch.tv/directory/game/A320"}]},{"igdb_id":14201,"name":"A320 Airbus Vol. 2","summary":"A320 Airbus Vol. 2 is the second main game in the Airbus series following the first two that were split up based on the territory to cover. This flight simulator improves the original game by more authentic navigation systems, improved flight and control. Also, some improvements in usability in preparing a flight are included. Four new areas are added in Europe: Italy, Spain, Portugal and the Canaries. These four areas add 29 new airports and 200 new radio beacons.\n\nThe game includes a duty mode starting as a rookie to become a chief pilot. Evaluation is based on various factors such as the runaway landing angle or the conservation of reserve fuel. In the training mode the weather parameters can be set manually, but in duty mode they are selected randomly and need to be taken into account when setting the flight path. Players also need to tap in the coordinates to set up the navigational system.\n\nThe package includes a pilot's manual and approach charts.","genres":["Simulator"],"developers":[],"publishers":["Games 4 Europe"],"aggregated_rating":null,"release_date":820368000,"platforms":["Amiga"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coa9yl.jpg","external_ids":[{"category":null,"store":"store_None","uid":"582313062","url":"https://www.twitch.tv/directory/game/A320%20Airbus%20Vol.%202"}]},{"igdb_id":14595,"name":"A320 Airbus: Edition USA","summary":"A320 Airbus: Edition USA is the successor to A320 Airbus which focuses on a realistic simulation of flying. The main difference is a new flying area which covers the USA between the Western and Northeastern coasts with about 240 airports. Additionally the flight physics are improved. During gameplay the player has to fly specified routes and navigate himself by using the supplied map. There is also a training mode available.","genres":["Simulator"],"developers":["Thalion Software"],"publishers":["Thalion Software"],"aggregated_rating":null,"release_date":757296000,"platforms":["Atari ST/STE","DOS","Amiga"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co21h9.jpg","external_ids":[]},{"igdb_id":108819,"name":"A3P","summary":"An online, 3rd person shooter, real time strategy, indie game.","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8b98.jpg","external_ids":[]},{"igdb_id":130673,"name":"A3: Still Alive","summary":null,"genres":["Role-playing (RPG)","Strategy"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["Android","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2pd9.jpg","external_ids":[]},{"igdb_id":137535,"name":"A3! Act! Addict! Actors!","summary":"You're a former actress who, in a sudden turn of events, becomes the director of a theater troupe on its last legs! It's up to you to find fresh new faces to bring the Mankai Company back to its original glory, but here’s the catch⁠— you only have 1 year and 4 performances to do so! Will you see your actors shining live on that stage? The fate of this theater is in your hands!\n\nGet a behind the scenes look at the ups and downs of the life of fledgling actors as they work through their own personal drama and forge relationships that shine on and off the stage! Whether you love comedy, drama or action, this story has it all in spades!","genres":["Simulator"],"developers":["Liber Entertainment"],"publishers":["Cybird","Liber Entertainment"],"aggregated_rating":null,"release_date":1485475200,"platforms":["Android","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2x8l.jpg","external_ids":[]},{"igdb_id":138083,"name":"A340-500/600 Expansion pack for FS2004/FSX","summary":"Addon for Flight Simulator 2004.","genres":["Simulator"],"developers":["Just Flight"],"publishers":["Just Flight"],"aggregated_rating":null,"release_date":1194739200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8i5c.jpg","external_ids":[]},{"igdb_id":299477,"name":"A 3ª Jornada","summary":"After the destruction of Earth and Mars caused by the alien invasion, the human beings guided by Sirey are now living inside spaceships. Ten years after A 2ª Jornada, Sirey’s fleet is approaching a new solar system, where they’ll find a new planet... and new adventures.","genres":["Role-playing (RPG)","Adventure"],"developers":["FKM"],"publishers":["FKM"],"aggregated_rating":null,"release_date":1092787200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8504.jpg","external_ids":[{"category":14,"store":"playstation","uid":"1775569105","url":"https://www.twitch.tv/directory/game/A%203%C2%AA%20Jornada"}]}]