[{"igdb_id":37751,"name":"U-jin no Furi-furi Girls","summary":"A Super Famicom multiplayer RPG-board game hybrid featuring the art of Ube \"U-Jin\" Yamaguchi. Four anime ladies compete in mazes full of monsters and loot to find the exit first.\n\nYuujin no Furi-furi Girls (\"U-Jin's Furi-furi Girls\") is a hybrid RPG/board game similar to Dokapon, which was published exclusively in Japan for the Super Famicom in 1994. Like its 1993 contemporary Yuujin: Janjyu Gakuen, it heavily features the artwork of anime artist U-Jin, best known for his eroge manga (though the game itself does not contain any pornographic material).\n\nEvery turn each character rolls a dice that moves them that many spaces around the board. Along the way they will find cash, new weapons, health pick-ups and other items. They will also encounter monsters, and must beat them in janken (rock-scissor-paper) matches to remove them from the board. The goal for every player is to defeat the monster that holds the key to the exit, and then reach the exit with the key. The player can choose between four heroines, each with different starting stats/cash.","genres":["Strategy","Card & Board Game"],"developers":[],"publishers":["Planning Office Wada"],"aggregated_rating":null,"release_date":773020800,"platforms":["Super Famicom"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co49mj.jpg","external_ids":[{"category":3,"store":"store_3","uid":"38053","url":"https://www.giantbomb.com/games/3030-38053/"},{"category":null,"store":"store_None","uid":"34144","url":"https://www.twitch.tv/directory/game/U-jin%20no%20Furi-furi%20Girls"}]},{"igdb_id":37752,"name":"U-jin: Janjuu Gakuen 2","summary":"A Super Famicom mahjong game featuring the artwork of the manga artist Yuujin (U-Jin). It is the sequel to the 1993 game Yuujin: Janjyu Gakuen.\n\nYuujin: Janjyu Gakuen 2 (lit. \"U-Jin: Sparrow Beast School 2\") is a 1994 mahjong game and a continuation of Yuujin: Janjyu Gakuen. The player once again takes to the streets to help out their fellow students at the eponymous school, usually via mahjong matches. The game features the artwork of the mononymed manga artist Yuujin (U-Jin). While U-Jin is best known for his eroge (adult manga) works, the game does not depict any pornographic imagery due to Nintendo's strict content rules.\n\nThe game was not localized into English nor released outside of Japan.","genres":["Sport","Quiz/Trivia"],"developers":["Varie"],"publishers":["Varie"],"aggregated_rating":null,"release_date":785116800,"platforms":["Super Famicom"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4c28.jpg","external_ids":[{"category":null,"store":"store_None","uid":"50468","url":"https://www.giantbomb.com/games/3030-50468/"},{"category":14,"store":"playstation","uid":"506754","url":"https://www.twitch.tv/directory/game/U-jin:%20Janjuu%20Gakuen%202"}]},{"igdb_id":42210,"name":"U-jin: Janjuu Gakuen","summary":"An anime-themed Mahjong game from Varie for the Super Famicom. Features artwork from prominent manga artist U-Jin.\n\nYuujin: Janjyu Gakuen (\"U-Jin: Sparrow Veterinary School\", roughly) is a mahjong game published by Varie. The player can assume the role of any of three heroines, or create their own, as they take on opponents throughout their eponymous school. The game includes a collaboration with manga artist U-Jin (birth name: Ube Yamaguchi), who helped create the various anime characters and is featured in the game's title.\n\nLike many mahjong games, Yuujin: Janjyu Gakuen was never released outside of Japan. It was followed with a sequel: Yuujin: Jankyu Gakuen 2.","genres":["Sport","Card & Board Game"],"developers":["Varie"],"publishers":["Varie"],"aggregated_rating":null,"release_date":753667200,"platforms":["Super Famicom"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4c29.jpg","external_ids":[{"category":3,"store":"store_3","uid":"47470","url":"https://www.giantbomb.com/games/3030-47470/"},{"category":14,"store":"playstation","uid":"461517","url":"https://www.twitch.tv/directory/game/U-jin:%20Janjuu%20Gakuen"}]},{"igdb_id":93589,"name":"Uju Jeonsa Dooly","summary":"The first-ever game based on the Korean manwha character Dooly. This game is a mix of multiple different genres.","genres":["Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":575856000,"platforms":["Apple II"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7kvo.jpg","external_ids":[]}]