[{"igdb_id":9074,"name":"Uuno Turhapuro muuttaa maalle","summary":"Uuno Turhapuro muuttaa maalle is a side-scrolling video game, available for the Commodore 64. It was developed by the Finnish programmer Pasi Hytönen in 1986 and published by Amersoft, one of the first game publishers in Finland.\n\nThe game is based on the popular Finnish comedy character Uuno Turhapuro (Numbskull Emptybrook), created by Spede Pasanen and played by the actor Vesa-Matti Loiri. The game was released in the same year as the movie with the same name. Uuno Turhapuro muuttaa maalle was the first Finnish game based on a movie license.","genres":["Platform","Arcade"],"developers":[],"publishers":["Amersoft"],"aggregated_rating":null,"release_date":536371200,"platforms":["Commodore C64/128/MAX"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/rtnhvahd6677vynh8zaz.jpg","external_ids":[]},{"igdb_id":27402,"name":"Uurnog","summary":"Platformer from the makers of Knytt about saving animals. Has an algorithmic soundtrack.","genres":["Platform"],"developers":["Nifflas Games"],"publishers":["Humble Publishing"],"aggregated_rating":null,"release_date":1488499200,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9ih1.jpg","external_ids":[]},{"igdb_id":55228,"name":"Uurnog Uurnlimited","summary":"Enter the wacky & whimsical world of Uurnog Uurnlimited, where you have only one goal: find your way around the world, and steal all the animals! Why? Because they’re adorable, and because video games.\n\nUurnog Uurnlimited is a delightfully silly 2D platformer inspired by games like Super Mario Bros. 2, Lyle in Cube Sector, and Dyad. Play single-player or co-op, explore the world through its many mysterious doors, solve puzzles and gather the items and animals needed in your Save Room. Careful though — the Save Room also saves your mistakes (urr nurr!)\n\nWhat else does it have, you ask? Chaotic neutral NPCs that can mess with your game! Algorithmic music that adapts to the gameplay! It’s uurnbelievable! It’s uurnexplainable! It’s Uurnog Uurnlimited!\n\nThis version has local co-op support, 5-6 new secret areas, a third ending, a new large area, two new smaller areas, and three boss fights compared to zero in the original Uurnog!","genres":["Platform","Puzzle","Indie"],"developers":["Nifflas Games"],"publishers":["Raw Fury"],"aggregated_rating":80.0,"release_date":1510790400,"platforms":["PC (Microsoft Windows)","Mac","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1p16.jpg","external_ids":[]},{"igdb_id":116096,"name":"Uuu so Smislom","summary":"Uuu so Smislom! is a simple yet challenging and addictive game. It can be played within few seconds anytime to refresh your mind. Create your own block puzzle game with this template within few minutes.","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1553212800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cob69n.jpg","external_ids":[]},{"igdb_id":153662,"name":"Uuultra C","summary":"Taking place in the city of Soshigaya in the 1970s, 13 kaiju monsters suddenly emerge from a tv as Japan is preparing for the next World Expo! Taiyo Kamen Icarus is entrusted to bring down the monsters and restore peace to Japan.","genres":["Adventure","Indie","Visual Novel"],"developers":["ADELTA"],"publishers":["MangaGamer","ADELTA"],"aggregated_rating":null,"release_date":1600387200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5tg9.jpg","external_ids":[]}]