[{"igdb_id":201420,"name":"RMaze","summary":"Survive in a maze and eliminate your opponents with bombs, shurikens and melee weapons in this 2D fast action game.","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5miy.jpg","external_ids":[]},{"igdb_id":147133,"name":"RMX Real Motocross","summary":"Take part in exciting motocross racing - race on different tracks. Upgrade your bike to score higher place. After each race remember to Fix broken parts and upgrade your motorcycle to win! Learn tricks, earn money, and win every championship.","genres":["Racing","Simulator","Sport"],"developers":[],"publishers":["Ultimate Games"],"aggregated_rating":null,"release_date":1586476800,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5aqz.jpg","external_ids":[]},{"igdb_id":54928,"name":"R?MJ: The Mystery Hospital","summary":"R?MJ is an interactive horror game with full voice-acting and movement like Kenji Eno's D, where a video plays to show the player's selected movement. The events of R?MJ take place in the summer of 1999. Hajime and Tomowo rush to the S.T.G. Hospital after hearing their friend Ryo was in a suspicious motorcycle accident, but they're trapped in the hospital after an explosion seals their exit. Together with Aya, a nurse who looks after Ryo, Hajime and friends much find a way out while a deadly virus threatens to end their search for freedom. There's something else amiss about this hospital, however. Strange paintings depicting an ancient civilization decorate the hospital walls. Just what is the Asmos Legend?\n\nIn addition to looking around for items and solving puzzles, the player must utilize the \"5 senses button,\" which acts as an additional way to investigate. Other characters will prompt you for these moments, such as \"what's that smell?\" The Playstation version spans 2 discs, whereas the Saturn version fits all the videos on one.","genres":["Adventure"],"developers":[],"publishers":["Bandai"],"aggregated_rating":null,"release_date":880588800,"platforms":["Sega Saturn","PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5bb9.jpg","external_ids":[]}]