[{"igdb_id":303000,"name":"S4U: Citypunk 2011 and Love Punch","summary":"This is a modern adventure of young adults seeking love and meaning. Return to 2011's Castor Yard, tap on your keyboard, and make those letters dance: Use your online persona to make meaningful decisions for your clients and yourself.","genres":["Simulator","Indie","Visual Novel"],"developers":[],"publishers":["GCORES PUBLISHING"],"aggregated_rating":null,"release_date":1736380800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co89fp.jpg","external_ids":[]},{"igdb_id":116461,"name":"S4ge","summary":null,"genres":[],"developers":["Playtra Games"],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":213463,"name":"S4Game","summary":"S4Game aims to provide health professionals with an innovative approach to acquire soft skills to foster their professional development. Their main learning objective is the acquisition of soft skills required during work in an operating room, such as communication or teamwork.","genres":["Simulator","Strategy"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5itd.jpg","external_ids":[]},{"igdb_id":93213,"name":"S40 Racing","summary":"S40 Racing is a promotional game for the Volvo S40. It lets you drive the S40 over two courses against either the AI opposition or friends over a LAN. Two game modes are available: a standard race where you race against seven opponents, and time attack where you have the race course for yourself. For each race you can set up whether you want manual transmission or not & how many laps the race should have, from one to twenty.","genres":["Racing"],"developers":["Digital Illusions CE"],"publishers":[],"aggregated_rating":null,"release_date":875664000,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]},{"igdb_id":51310,"name":"S4 League","summary":"S4 League is a third-person shooter MMO (Massively Multiplayer Online) game. The four „S” from the title stand for: Style, eSper, Shooting and Sports. The game is a combination between a shooter and a sports simulator, with 3D anime graphics and techno soundtrack.\n\nThe game has no background story. Players just connect to a virtual world where they have to prove their skills while advancing through all the 100 levels (Beginner, Rookie, Super Rookie, Semi Pro, Pro, S1, S2, S3, S4 - Master), based on the amount of experience points they have gathered after each game played. The player can create up to three characters of either gender. Before players can start a game, the character must have equipped at least one weapon and one skill. Players can choose between close-range, mid-range, long-range (sniping), mental, throwing, and support weapons. Players can also choose between active or passive Skills.\n\nCostumes, items, weapons and skills can be bought from the game shop with PEN or AP. PEN is virtual money, earned by playing matches, while AP is earned by paying real money (multiple methods, from credit cards to mobile text messages, specific to each country). Costumes, items, weapons and skills can be permanent or rented (hour-based or day-based). Permanent stuff needs repairs after each use, rented stuff doesn't. Day-based items follow the real life time, while hour-based items count only when playing.\n\nAfter players create and equip their characters with items purchased from the shop, they are ready to join a server based on country/language, and then join a room based on Game Mode. A room can have maximum 12 players connected: 6 players in Alpha Team and 6 players in Beta Team.\n\nThere are various modes in the game:\nIn Touchdown Mode , the most played game mode, players must take a yellow, bouncing ball called \"fumbi\", run with it to the other side of the map and put it in the red goalpost. Fumbi can be carried by multiple teammates along the way.\n\nIn Deathmatch Mode, players must kill each other in order to take their team to victory before the time ends.\n\nIn Chaser, a virus takes control over a player who gets overpowered and who must kill the other players in the time left.\n\nIn Captain Mode, all players have crowns over their heads which gives them a large amount of hit points. Each team must eliminate all the enemies with crowns in order to win or at least have more teammates with crowns alive when the time runs out.\n\nIn Battle Royal, players must kill each other (no teams here). The player with the highest score is marked as a target (targets change all the time in a BR match).\n\nIn Arcade Mode, players follow a story of the game where they must kill the virtual bots and finish all the given missions, structured in chapters.\n\nPlayers can also join Clans and play Clan Matches.","genres":["Shooter"],"developers":["Pentavision Entertainment"],"publishers":["Neowiz Games Corporation"],"aggregated_rating":null,"release_date":1199145600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co48zx.jpg","external_ids":[]}]