[{"igdb_id":21270,"name":"Söldner-X: Himmelsstürmer","summary":"The celestial planet Conceyta orbits with its moon in a dust- and gas-covered solar system. Within lurks an evil unknown to man that bears a danger so much greater than any threat yet witnessed. A dark, mysterious power has manifested itself in the depths of the gas giant, absorbing life and technology, and assimilating all in its wake. Spacecraft, pilots, androids, and computers: Nothing is safe. No one can escape the virus that infects all life forms, turning once brave heroes and peaceful colonists alike into ravaging, chaotic forces, fighting each other and infecting more in the process. Soulless technology and hate-driven humanoids are all that's left of Earth's once-proud fleet. The galaxy as we know it is threatening to fall apart. War, death, and bedlam have taken hold of civilisation. Humankind is at the brink of extinction. Those who aren't yet infected--the resistance, a band of mercenaries, soldiers and civilians--are Earth's final hope, and they have one goal in common: To stop the deadly infection and destroy the core of all evil, hidden in the depths of Conceyta. Scouts have undertaken a merciless mission to bring detailed plans and data on the location of the power and its defence line in a last attempt to save humankind. So it has come to be that the last remaining pilot, a mercenary and bounty hunter, is the only chance of survival, ironically driven by the desire for wealth and fame. Left with little choice, the resistance has developed a star fighter capable of intercepting the evil force, equipped with a deadly weapon system and of utmost agility. With no time to lose, the 10th and final prototype of the ship is handed to the pilot. Its name: \"Sldner-X\". Should the pilot succeed, his name shall live on in the memories of man forever to come. And so the battle begins.","genres":["Shooter","Arcade"],"developers":["SideQuest Studios"],"publishers":["Eastasiasoft"],"aggregated_rating":65.0,"release_date":1197590400,"platforms":["PlayStation 3","PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3bbc.jpg","external_ids":[{"category":null,"store":"store_None","uid":"113","url":"https://www.twitch.tv/directory/game/S%C3%B6ldner-X%3A%20Himmelsst%C3%BCrmer"},{"category":null,"store":"store_None","uid":"119","url":"https://www.giantbomb.com/games/3030-119/"}]},{"igdb_id":26937,"name":"Söldner-X 2: Final Prototype","summary":"In Söldner-X 2: Final Prototype, you will return to Gota IV as part of the Soldner-X defense force. Mankind will once more rely on your battle against new mysterious powers. Staged across seven unique action-loaded levels accompanied with an adrenaline pumping soundtrack, Söldner-X 2: Final Prototype combines traditional 2D gameplay with detailed high definition graphics and a taste of fresh innovations.\n\nTwenty years after the Virus Wars, you return to Gota IV as part of the newly formed Söldner-X defense force. Your mission: to free the galaxy from the D'aarg, a technologically superior race that is threatening mankind. Staged across up to 10 unique action-loaded levels, Söldner-X 2: Final Prototype delivers a must-have, shoot' em up experience, blending classic gameplay with the astonishing audio-visuals.","genres":["Shooter","Arcade"],"developers":["SideQuest Studios"],"publishers":["Eastasiasoft"],"aggregated_rating":null,"release_date":1274745600,"platforms":["PlayStation 3","PlayStation Vita"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3bbd.jpg","external_ids":[]},{"igdb_id":26938,"name":"Söldner-X 2: The Last Chapter","summary":"Maximize your Söldner-X 2: Final Prototype experience with this action-packed expansion.\nThe Last Chapter adds 3 exciting stages, 13 challenges, 11 trophies and more to the original game.\n\n3 additional stages\n13 new challenges, including a secret stage\n11 additional trophies","genres":["Shooter","Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1293753600,"platforms":["PlayStation 3","PlayStation Vita"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9h56.jpg","external_ids":[]},{"igdb_id":78587,"name":"Söldner: Secret Wars","summary":"Soldner: Secret Wars is similar to the recent online FPS combat games involving infantry and vehicular warfare. But it also has a few features that separate it from the rest.\n\nThe Advanced Destruction System means you're no longer restricted to how a map should look. You can knock down trees to block a road or destroy a bridge to prevent armour from crossing. Damage remains until the end of the round instead of being just a decal that does not affect game play.\n\nUnit are able to be customized. You can choose your look, headgear, uniform and add extras like sunglasses and backpacks. Soldner features a large variety of weapons including the basic pistols and rifles but also features specialized items like sniper rifles, explosives and rocket launchers. There is a large variety of vehicles available to the player as well.\n\nThe other major game play feature is the command structure. An elected leader is able to set out objectives and waypoints for team members. As well as allocating funds for weapon and vehicle purchases. Bringing a more cohesive sense of game play to the battlefield.","genres":["Shooter","Strategy","Tactical"],"developers":["Wings Simulation GmbH"],"publishers":["Encore Software Inc.","JoWooD Productions Software"],"aggregated_rating":65.0,"release_date":1080345600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4s24.jpg","external_ids":[]},{"igdb_id":93196,"name":"Söldner: Marine Corps","summary":"Marine Corps is an add-on for the multiplayer warfare game Söldner: Secret Wars. Marine Corps' most prominent feature is the inclusion of combat on water. The expansion adds ships and vessels such as jet skis, patrol boats and amphibious vehicles. There are ten new maps in total with both island and desert scenarios. Various new weapons (including laser-steered rockets), vehicles, tanks (Leopard, Mungo...) and planes such as the Tornado and the Eurofighter are now available. Next to general improvements to the interface and COMM mode, certain weaknesses and strengths have been rebalanced.\n\nOwners of the base game or the re-release Söldner: Secret Wars - Reloaded can still go into battle with players with the add-on, even if they don't own it themselves, if they apply patch 33588 that was provided prior to the release. All the new features of the expansion are then available, but the new weapons, vehicles and vessels are not accessible. However, if a player with the expansion drops a new weapon or leaves a new vehicle, it can be used by all players.\n\nThe game was co-developed by what was left of Wings Simulations, after JoWood had announced to close the studio, and a new development team: Project-Z development.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6hn0.jpg","external_ids":[{"category":null,"store":"store_None","uid":"9363","url":"https://www.giantbomb.com/games/3030-9363/"}]},{"igdb_id":140847,"name":"Söldner-X 2: Final Prototype - Definitive Edition","summary":"In Soldner-X 2: Final Prototype, you will return to Gota IV as part of the Soldner-X defense force. Mankind will once more rely on your battle against new mysterious powers. Staged across seven unique action-loaded levels accompanied with an adrenaline pumping soundtrack, Soldner-X 2: Final Prototype combines traditional 2D gameplay with detailed high definition graphics and a taste of fresh innovations.\n\nTwenty years after the Virus Wars, you return to Gota IV as part of the newly formed Söldner-X defense force. Your mission: to free the galaxy from the D'aarg, a technologically superior race that is threatening mankind. Staged across up to 10 unique action-loaded levels, Söldner-X 2: Final Prototype delivers a must-have, shoot' em up experience, blending classic gameplay with the astonishing audio-visuals.","genres":["Shooter","Arcade"],"developers":["SideQuest Studios"],"publishers":["Eastasiasoft"],"aggregated_rating":85.0,"release_date":1604448000,"platforms":["PlayStation 4"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2t8m.jpg","external_ids":[{"category":null,"store":"store_None","uid":"233124","url":"https://store.playstation.com/en-us/concept/233124"},{"category":14,"store":"playstation","uid":"782980050","url":"https://www.twitch.tv/directory/game/S%C3%B6ldner-X%202:%20Final%20Prototype%20-%20Definitive%20Edition"}]},{"igdb_id":249615,"name":"Söldner: Secret Wars Remastered","summary":"Söldner! Enjoy third-person combat, make use of a fully destructible environment. Customize your character and start combat on the huge worldmap (6500*3500 km), selecting your gear from over 100 firearms. Get into battle the way you want by employing over 120 vehicles. Take your tour now!","genres":["Simulator","Strategy"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6hj7.jpg","external_ids":[{"category":null,"store":"store_None","uid":"847720","url":"https://store.steampowered.com/app/847720"},{"category":null,"store":"store_None","uid":"998838414","url":"https://www.twitch.tv/directory/game/S%C3%B6ldner:%20Secret%20Wars%20Remastered"}]},{"igdb_id":318615,"name":"Söldner-X Complete Collection","summary":"The Söldner-X Complete Collection is a compilation of two critically acclaimed shoot'em up games in one collection.","genres":["Shooter","Arcade"],"developers":["SideQuest Studios"],"publishers":["Eastasiasoft"],"aggregated_rating":null,"release_date":1774915200,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8w0j.jpg","external_ids":[]}]