[{"igdb_id":356937,"name":"4 Elements Double Pack","summary":"In this 2-for-1 4 Elements Double Pack you'll get the classic game 4 Elements and its sequel 4 Elements II. Dive into the miraculous world of enchanting creatures and infinite magic with this mix of addictive match-3 gameplay, hidden object and mini-games.","genres":[],"developers":[],"publishers":["PlayRIX"],"aggregated_rating":null,"release_date":1376784000,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]},{"igdb_id":23505,"name":"4evolve: Deep Stars","summary":"4evolve: Deep Stars is a space sim 4X game set in randomly generated galaxy. DEEP STARS is extraordinary space game beyond the typical simulator. You take the role of spaceship Nomad, for which the player creates a career path. You can grow as a trader, smuggler or captain of the fleet. Buy and sell various goods. Create and develop your space empire! The game is open-ended, and you are free shape your career. You can sign and break alliances with the various races fighting for power, freedom and oxygen sources!","genres":["Simulator"],"developers":["4EVOLVE Games"],"publishers":["4EVOLVE Games"],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3c6m.jpg","external_ids":[]},{"igdb_id":27893,"name":"4 Elements","summary":"The ancient kingdom is in trouble! The magic of the four elements that kept it running for centuries has been corrupted by evil powers and the altars no longer yield the energy of life. It is up to you to unlock the 4 ancient books of magic and collect 16 mysterious cards that will help you restore the kingdom to life. An adorable little fairy will be your aide in this perilous journey as you encounter elementals, dragons, knights, and various magic creatures.","genres":["Puzzle","Adventure"],"developers":["Playrix Entertainment"],"publishers":["Playrix Entertainment"],"aggregated_rating":null,"release_date":1220400000,"platforms":["Linux","Nintendo 3DS","PC (Microsoft Windows)","Nintendo DSi"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2htl.jpg","external_ids":[]},{"igdb_id":106038,"name":"4 Elements II: Special Edition","summary":"Discover the fantastic world of 4 Elements in this Windows exclusive Special Edition of the acclaimed Puzzle and Hidden Object game.\n\nFour fairies representing the elements of earth, air, fire, and water have been deprived of their magic power. Be the hero of the kingdom and restore their magic!\n\nLose yourself in beautiful backgrounds, music and amazing graphics. Explore a world of color, animation, and mystical delight. Discover secrets, solve intriguing puzzles, and decipher the book of magic to unlock powerful spells.\n\n4 Elements™ II: Special Edition is an exciting “match three” game packed with fascinating puzzles and hidden object challenges. This Special Edition includes 48 exclusive levels for Windows, 14 of which you can play for free in the trial version!\n\nThis edition also includes six custom Windows wallpapers and the complete original soundtrack in MP3 format.\n\nCompare your progress with friends via leaderboards, and earn 200 Xbox Gamerscore points, and 20 challenging Achievements.","genres":["Puzzle"],"developers":["Playrix Entertainment"],"publishers":["Microsoft Studios"],"aggregated_rating":null,"release_date":1346544000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3sjm.jpg","external_ids":[]},{"igdb_id":249251,"name":"4 En Raya","summary":"A puzzle game from Spain. Line up your pieces 4 in a row either vertically, horizontally or diagonally. You can also shoot your opponent's piece to cancel their turn. This game is very similar to the popular board game Connect 4. The title translates into English as '4 In A Row'.","genres":["Puzzle"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":662601600,"platforms":["Arcade"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7odn.jpg","external_ids":[]},{"igdb_id":52038,"name":"4 Elements HD","summary":"In 4 Elements HD, the ancient kingdom is in peril!","genres":["Puzzle"],"developers":["Boolat Games"],"publishers":["Playrix Entertainment"],"aggregated_rating":null,"release_date":1314748800,"platforms":["PlayStation 3"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9ekp.jpg","external_ids":[]},{"igdb_id":95773,"name":"4ever Transit Authority","summary":"Explore a procedurally generated city with the help of the 4Ever Transit Authority.","genres":["Simulator","Indie"],"developers":["Turnfollow"],"publishers":["Turnfollow"],"aggregated_rating":null,"release_date":1491091200,"platforms":["Linux","Android","PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co84c4.jpg","external_ids":[]},{"igdb_id":64131,"name":"4 Elements II","summary":"Set the fairies free and restore the book of magic. This is a fantasy-themed match 3 game with many levels and mini games.","genres":["Puzzle"],"developers":["PlayRIX"],"publishers":["Microsoft Studios"],"aggregated_rating":null,"release_date":1317168000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/fob6vomc4l9yggp3i8qu.jpg","external_ids":[]}]