[{"igdb_id":74303,"name":"CC & SH Smash Hits","summary":"Compilation of six previously freeware games.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1156636800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/d1bwtmyl9ywdzpcznv2f.jpg","external_ids":[{"category":3,"store":"store_3","uid":"44183","url":"https://www.giantbomb.com/games/3030-44183/"},{"category":14,"store":"playstation","uid":"458333","url":"https://www.twitch.tv/directory/game/CC%20%26%20SH%20Smash%20Hits"}]},{"igdb_id":100490,"name":"CCCP Calls!","summary":"CCCP CALLS! is classic communist match 3 game with beautiful anime girl! Light casual gameplay in the best traditions of the genre on the map of Europe. It's easy to learn, and hard to 3 stars!","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1526947200,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]},{"igdb_id":122309,"name":"C&C Level-CD: Vol.3","summary":"C&C Level-CD: Vol.3 is an unofficial add-on with 400 extra levels for Command & Conquer. The CD also includes several editors, cheats and hints.","genres":["Strategy"],"developers":[],"publishers":["M-Soft Software Design"],"aggregated_rating":null,"release_date":851990400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8iak.jpg","external_ids":[]},{"igdb_id":232338,"name":"CCG Deck Adventures Wild Arena","summary":"Collect awesome Cards, Build your Battle Deck and enter the Wild Arena for epic card wars! Forget turn-based, go realtime against player constructed decks (PvP simulation)!\nIn this intuitive and beautiful trading card game (TCG), you’ll be unleashing powerful cards with special abilities in minutes. Battle fast & accessible real-time fierce card wars, battle duels on the go with spectacular fantasy magic spells and effects for the cards. Will you win your battles and become one of the deck heroes of the world?\nEnter the exciting card deck adventure journey with awesome graphics and tactical gameplay, find the best tactics and strategies to defeat opponents through multiple arenas in the order and chaos ahead all the way to the top. Whether this is your first card exchange game or you are an experienced pro, join the community and the depth and charm of this Wild Arena adventure will draw you in. The savage animal magic fantasy theme makes is very intuitive right from the start.\nFinally an EASY TO LEARN, HARD TO MASTER Trading Card Game (TCG)! If you never played a TCG/CCG before, you’ll finally understand that collectible card games can be insanely fun! But warning: this will be your #1 game for the upcoming years! Will you become one of the deck heroes, in this order and chaos building the best ccg / tcg deck in the animal kingdom there is?","genres":["Strategy"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":264863,"name":"CCTV","summary":"The game's premise was to have the player be a security guard tasked with monitoring a CCTV. The game was cancelled when the developers could not find a publisher that supported its unique concept.","genres":[],"developers":["Nikitova Games"],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["Wii"],"cover_url":null,"external_ids":[]},{"igdb_id":293662,"name":"CCO Car Crash Online Simulator","summary":"Crash car in super real physicsThe most real car damage and car stunts! Destroy cars with your friends online and become a fierce champion! Do you like driving races, pushing sneakers into the floor and turning on nitrous oxide? Then this game racing sim is just for you!","genres":["Racing","Simulator"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1713052800,"platforms":["Linux","PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7z77.jpg","external_ids":[]},{"igdb_id":330470,"name":"CCSS07: 64 Squares of Purple","summary":"Crispy Chicken Chillzone discord server came together once more for a speedmap event. This time we have purple hue-shifted palette. All 256 lines had to be at 90 degrees to each other, and using 64 grid. The result is 36 maps, split into 4 episodes - castle, space, flesh, jungle.","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1738713600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9d1b.jpg","external_ids":[]}]