[{"igdb_id":27735,"name":"9 Empires","summary":"A unique mix of strategy and role-playing in a fantasy setting - play in your browser without any installation! Create your own empire by building vast cities, researching new technology and laying siege to your enemies. Train your heroes, find, upgrade and use thousands of items, experience hundreds of quests and battle it out with friends and enemies. Delve into the vast world of 9 Empires: travel through continents, explore sinister dungeons and visit great cities. Experience many different landscapes that range from deserts to snow-covered mountains and lava canyons! \n \nCreate up to 5 heroes the way you like them. Make your perfect team of heroes with different skills, weapons, armour and attributes. You can even send your heroes to train while you're away. You're their master, put them to work! \n \nThe world of 9 Empires offers numerous tasks, challenges and opportunities. \n \nThe game was taken offline on March 2012 due to lack of technical support.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[{"category":null,"store":"store_None","uid":"1016098078","url":"https://www.twitch.tv/directory/game/9%20Empires"}]},{"igdb_id":68999,"name":"9 Elefants","summary":"After arriving in Paris to present his latest invention, the Time Camera, at the Universal Science Congress, Professor Weissmann disappeared without a trace. His daughter, Laura, believes he has been kidnapped. Aided by Eustache, the Professor’s cat, Laura sets out on the trail of a mysterious sect, whose symbol is 9 elephants. The intrepid duo is confronted by a series of challenges, and each has to draw on their powers of invention and deduction to unravel the plot at the heart of this extraordinary adventure.","genres":["Puzzle","Adventure"],"developers":["Infernal Brothers"],"publishers":["Microïds","Anuman"],"aggregated_rating":null,"release_date":1398297600,"platforms":["Android","PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1k0f.jpg","external_ids":[{"category":14,"store":"playstation","uid":"499180","url":"https://www.twitch.tv/directory/game/9%20Elefants"},{"category":3,"store":"store_3","uid":"61560","url":"https://www.giantbomb.com/games/3030-61560/"}]},{"igdb_id":257474,"name":"9 Elements","summary":"No common volleyball, it's rather be called a combat. Super combat volleyball!!\nGet ready for the exciting 1 on 1, action sport! Characters of 9 different elements are waiting for your Fight Ball!","genres":["Role-playing (RPG)","Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[{"category":14,"store":"playstation","uid":"1098222557","url":"https://www.twitch.tv/directory/game/9%20Elements"}]}]