[{"igdb_id":60306,"name":"I-Xera","summary":"The player, equipped with the latest military robot suit and weapon, has to collect four pieces of a logo in a soap-bubble factory in this flip-screen platformer written by Jason Kendall.","genres":["Shooter","Platform","Arcade"],"developers":["Alpha Omega Software"],"publishers":[],"aggregated_rating":null,"release_date":567907200,"platforms":["Commodore C64/128/MAX"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/btg2icd492zhncr7hozy.jpg","external_ids":[]},{"igdb_id":152258,"name":"Ixion","summary":"Authorised by DOLOS AEC, you will guide the Tiqqun space station onwards in a perilous journey to find a new home for humanity. Station infrastructure, population management, exploration, survival, these responsibilities fall to you. Will you find hope out there in the dark? Good luck Administrator.","genres":["Simulator","Strategy","Indie"],"developers":["Bulwark Studios"],"publishers":["Kasedo Games"],"aggregated_rating":68.0,"release_date":1670371200,"platforms":["Xbox Series X|S","PC (Microsoft Windows)","PlayStation 5"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co39ra.jpg","external_ids":[]},{"igdb_id":150327,"name":"I x She Tell","summary":"At long last - we, the student council, have won you your freedom to love! The moment I declare these words, my classmates come surging forward, surrounding me in a circle of cheers that echo across the entire campus.","genres":["Simulator"],"developers":["Hooksoft"],"publishers":["NekoNyan Ltd.","ENTERGRAM"],"aggregated_rating":null,"release_date":1580342400,"platforms":["PlayStation 4","PC (Microsoft Windows)","PlayStation Vita","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5hgu.jpg","external_ids":[]},{"igdb_id":152292,"name":"Ixion Saga","summary":"Ixion Saga is a multiplayer online action game for PC, which featured team battles that can be as large as 8 on 8 against different player-controlled unions, it was officially released only in Japan on March 13, 2013, but was discontinued on November 30, 2015.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1363132800,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]},{"igdb_id":40345,"name":"Ixion","summary":"A shooting game where you collect the letters to spell the word IXION to reach the Kailo Round. Shoot enemies and avoid being shot to yourself.","genres":["Shooter","Arcade"],"developers":["Sega Electronics"],"publishers":["Sega"],"aggregated_rating":null,"release_date":null,"platforms":["Arcade"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5vud.jpg","external_ids":[]},{"igdb_id":282777,"name":"Ixion","summary":"Ixion is a port of the unreleased 1983 Sega coin-op of the same name, Ixion is an interesting game that doesn't seem to play like anything else in the 2600 library. Your goal in Ixion is to grab the five white squares scattered across the screen and spell the word Ixion before your time runs out. At the start of each level only certain squares are visible, and to get around more easily you must first reveal the missing squares. To reveal the missing squares, the player must move a brown sphere over an empty square. This sphere is normally stationary, but it can be moved by shooting or ramming into it. This sends the sphere bouncing around the screen, revealing squares and destroying enemies in its travels. After a short time of bouncing around the sphere will stop, requiring the player to move it again to reveal more squares. Learning how to move the sphere where you want is the key to mastering Ixion. Also moving around the game grid are enemy drones, which will attempt to destroy your ship. Unfortunately, their shots destroy tiles, making your path much more difficult to traverse. Enemy drones only take one shot to defeat, but will take out the tile they are on when they explode. It is unknown why Ixion was never released by SEGA, but it was around this time that SEGA Enterprises (the American arm of SEGA) was sold to Bally. After this sale, all of SEGA's 2600 titles were Bally/Midway arcade games (Tapper, Spy Hunter, and Up 'n Down). It may have been felt that only well known arcade game would sell well enough in the overly competitive 2600 market, or perhaps Ixion simply got lost in the transition shuffle.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["Atari 2600"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7mql.jpg","external_ids":[]},{"igdb_id":230975,"name":"Ixion: Deluxe Edition","summary":"Immerse yourself in the world of IXION with this digital deluxe edition. Including the game, its original soundtrack and a bespoke digital artbook.","genres":["Strategy"],"developers":["Bulwark Studios"],"publishers":["Kasedo Games"],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5zpq.jpg","external_ids":[]},{"igdb_id":167022,"name":"I x She Tell: Limited Edition","summary":"This edition includes the following:\n\n- I x She Tell\n- B2 Tapestry\n- Special Illustration Card\n- Original Soundtrack\n- Acrylic Figure","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]}]