[{"igdb_id":159517,"name":"P0","summary":"Enjoy your last 7 days in the hospital, a peaceful and settled place where you can't really kill anyone. Explore with your feeble combat ability and find a way out. End with the truth of P0.","genres":["Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1633305600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3qqz.jpg","external_ids":[]},{"igdb_id":242893,"name":"p0nd","summary":"P0nd is a one-button, flash game by PeanutGallery.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1293753600,"platforms":["Web browser"],"cover_url":null,"external_ids":[{"category":14,"store":"playstation","uid":"174990505","url":"https://www.twitch.tv/directory/game/p0nd"}]},{"igdb_id":383864,"name":"P0: Byte-Sized Brilliance","summary":"P0 is a speedrunning anomaly hunting game within the horror genre.\n\nIn P0, 10 seconds is all you’ll get to decide whether your memorised office environment has an anomaly or not before smashing a button to progress to the next floor. Look fast, decide quickly, and crash through all 30 floors to earn the highest grade possible and ace a rather unusual interview to land your dream job. Red or green. Make your choice.\n\nYou won’t be thrown in at the deep end for your interview. Every candidate starts on the Junior level exam, and once completed, tougher difficulties and sub difficulties will unlock. You’ll be up against a global roster of talent, so to really impress and earn your spot on the board, pick ANY exam and complete it as quickly as possible.\n\nYour office bestie, Buddy, is there to offer you emotional support during your interview. Through every run, you’ll earn credits to spend on kitting them out in the finest or wackiest wares. If you’re more sensible with your credits, you might want to spend them on collectibles. These can help spot tougher anomalies or provide glimpses into the lore.","genres":["Simulator","Indie"],"developers":["Deadbolt Interactive","Perp Games"],"publishers":["Perp Games"],"aggregated_rating":null,"release_date":1768867200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cob6o4.jpg","external_ids":[]}]