[{"igdb_id":46812,"name":"Märchen Maze","summary":"In Märchen Maze (\"Märchen\" is German for \"fairytale\"), the player takes control of a little girl named Alice who has been pulled in to a magical world by a white rabbit. It was originally released to the Arcade before being ported to the PC Engine and Sharp X68000. It would also be added to the Japanese Wii's Virtual Console in 2009.\n\nThe Arcade and Sharp X68000 versions use an isometric view while the PC Engine uses a standard overhead view. The game's platforms are all suspended over a bottomless void. Alice can shoot bubbles, technically termed \"shabon balls\", at the enemy in an effort to knock them off of the floating terrain or destroy them. Holding down the attack button will charge the bubble and make it larger, resulting in greater knockback strength or simply more damage, depending on the enemy.\n\nThe enemies are also trying to knock Alice off, too. In fact, Alice does not take damage in a conventional sense: the only way to lose a life is to fall in to the void. Alice comes equipped with several balloons which can rescue her from a fall should one occur. Alice is capable of jumping to avoid obstacles or shots from enemies, or to jump over gaps in the terrain. At the end of each stage is a boss; Alice has a 180 second time limit to get to the end and defeat the boss or else \"time over\" monsters will appear and attack her. The PC Engine version of the game lacks a time limit.","genres":["Shooter","Platform"],"developers":["N.H. System"],"publishers":["Namco"],"aggregated_rating":null,"release_date":582249600,"platforms":["Arcade","Sharp X68000","Wii"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4ek4.jpg","external_ids":[]},{"igdb_id":99425,"name":"Märchen Forest: Mylne and the Forest Gift","summary":"Freely roam a fully 3D-rendered mystical forest together with Mylne, a young girl employed at a magical apothecary shop!","genres":["Role-playing (RPG)","Adventure","Indie"],"developers":["Primary Orbit"],"publishers":["Primary Orbit"],"aggregated_rating":60.0,"release_date":1526428800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ld1.jpg","external_ids":[]},{"igdb_id":167095,"name":"Märchen Forest: Mylne and the Forest Gift - Limited Edition","summary":"This edition includes the following\nGame: Marchen Forest: Mylne and the Forest Gift\nMylne Deluxe Figurine","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":181313,"name":"Märchen Forest","summary":"Mylne, an apothecary, searches the Mysterious Forest for ingredients so that she can brew her potions. But things soon take a dramatic turn from simple errands—eventually, Mylne finds herself caught up in an unsolved mystery, requiring her to take on what lies in the Underground Ruins, deep beneath the forest...","genres":["Role-playing (RPG)","Adventure","Indie"],"developers":["Primary Orbit"],"publishers":["Clouded Leopard Entertainment Inc."],"aggregated_rating":null,"release_date":1611705600,"platforms":["PlayStation 4","PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5j4k.jpg","external_ids":[]},{"igdb_id":212861,"name":"Märchen Maze","summary":"The PC Engine port of Märchen Maze.","genres":["Shooter","Arcade"],"developers":["N.H. System"],"publishers":["Namco"],"aggregated_rating":null,"release_date":660873600,"platforms":["TurboGrafx-16/PC Engine"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5w8o.jpg","external_ids":[]},{"igdb_id":318499,"name":"Märchen Line","summary":"Embrace the indomitable human spirit by serving in the First Among Father's Voyager Armada- The Bravest of The Brave, who venture out to liberate the Milky Way from the True Enemy.\n\nServing as a Soldier means embracing infinite potential. With the blessing of His Runes, you will grow stronger, smarter, faster and braver in a few weeks than you have in your entire life. All that growth comes with responsibility, and you will be expected to pay your civic dues- but luckily each Soldier is assigned a Valkyrie to help them manage their priorities.\n\nTrain your stats, build your relationships, and be all you can be...or push past the galactic narrative and seek a deeper understanding of humanity's true ranking in the galactic hierarchy.","genres":["Adventure","Indie","Visual Novel"],"developers":["Nth Circle"],"publishers":["Nth Circle"],"aggregated_rating":null,"release_date":1727654400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8vvy.jpg","external_ids":[{"category":null,"store":"store_None","uid":"2959067","url":"https://nthcircle.itch.io/marchenline"},{"category":14,"store":"playstation","uid":"1088078497","url":"https://www.twitch.tv/directory/game/M%C3%A4rchen%20Line"}]},{"igdb_id":353317,"name":"Mär Heaven: Karudea no Akuma","summary":"MÄR Heaven: Karudea no Akuma is a Japan-only action RPG. It features a touch-based, card-style battle system using magical items called ÄRMs. Players can explore in Story Mode, duel others in multiplayer Battle Mode, and trade ÄRMs wirelessly.","genres":["Role-playing (RPG)"],"developers":["Alpha Unit"],"publishers":["Konami"],"aggregated_rating":null,"release_date":1143676800,"platforms":["Nintendo DS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coa354.jpg","external_ids":[{"category":14,"store":"playstation","uid":"1475153530","url":"https://www.twitch.tv/directory/game/M%C3%A4r%20Heaven:%20Karudea%20no%20Akuma"}]}]