[{"igdb_id":39329,"name":"'88 Games","summary":"Konami '88 (also known as '88 Games or Hyper Sports Special) is the third in the Track & Field game series by Konami, where you test your Olympic skills against other world-class athletes. As the name implies, it is loosely based on (and not licensed by) the 1988 Summer Olympics in Seoul, South Korea. Bronze or silver medals are not good enough - you have to go for the gold to get to the next event. However, you must at least qualify in each event in order to compete in the next event.","genres":["Sport"],"developers":["Konami"],"publishers":["Konami"],"aggregated_rating":null,"release_date":599529600,"platforms":["Arcade"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9643.jpg","external_ids":[]},{"igdb_id":352158,"name":"88 Constellations for Wittgenstein","summary":"88 Constellations for Wittgenstein (to be played with the Left Hand) is an interactive, non-linear net.art piece that explores the life and philosophy of Ludwig Wittgenstein through a series of animated vignettes created in Flash. Each of the 88 sections corresponds to one of the 88 constellations in the night sky. Each constellation becomes a navigation device for the viewer to negotiate the associative relationships between these vignettes. As well, viewers can interact with each collaged animation using their left hand to trigger events from the computer keyboard. This work considers questions that Ludwig Wittgenstein pondered in his career as a philosopher: logic, language, the nature of thinking, and the limits of knowledge -- all in relation to our contemporary digital world.","genres":[],"developers":["David Clark"],"publishers":["David Clark"],"aggregated_rating":null,"release_date":1262217600,"platforms":["Web browser"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coa2cf.jpg","external_ids":[]},{"igdb_id":23501,"name":"88 Heroes","summary":"\"88 Heroes is a chaotic 2D platformer where each level completed or untimely death brings a new hero into the action! With just 88 minutes to complete all 88 rooms you'll need every one of the 88 Heroes to stop Dr. H8 destroying the Earth!\"\n\n\"The \"88 Heroes\" - eighty-eight of the strangest and seemingly most pointless superheroes ever to grace the face of the earth.\n\n'They called the best, but the best were busy!'\"","genres":["Platform","Indie"],"developers":["Bitmap Bureau"],"publishers":["Rising Star Games"],"aggregated_rating":76.5,"release_date":1490313600,"platforms":["PlayStation 4","Linux","PC (Microsoft Windows)","Mac","PlayStation Vita","Xbox One","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co22jn.jpg","external_ids":[]},{"igdb_id":377401,"name":"88 at an Exhibition","summary":"★ → ●. (The star whispers.)","genres":["Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1751760000,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coau45.jpg","external_ids":[]},{"igdb_id":377400,"name":"88 Nights in the Forest","summary":"88 Nights in the Forest is an atmospheric survival horror. Build and fortify your base around the campfire — your only safe haven. Gather resources, explore the dark woods full of twisted beasts, and endure wave after wave of danger. Survive all 88 nights in the darkness.","genres":["Simulator","Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coau43.jpg","external_ids":[]},{"igdb_id":199699,"name":"8/8/88 Needle AL","summary":"8/8/88 Needle AL is a realistic visual novel style game that is made from actual 360 degree photographs. You must read through clues to piece together the overall story. The game is dark and very atmospheric.","genres":["Simulator","Adventure","Indie","Arcade"],"developers":["Moolion"],"publishers":["Moolion"],"aggregated_rating":null,"release_date":1684886400,"platforms":["PC (Microsoft Windows)","iOS","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5cwp.jpg","external_ids":[]},{"igdb_id":216774,"name":"8874","summary":"Climatic side scroller where history plot intermingles with Slavic legends, Second World War, and paranormal activity. Solve complex puzzles, do some platforming, interact with various characters, discover their unclear motives, and be a part of the dark and forgotten mystery.","genres":["Adventure","Indie"],"developers":["Art Games Studio"],"publishers":["Art Games Studio"],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co704h.jpg","external_ids":[]},{"igdb_id":74315,"name":"88 Heroes: 98 Heroes Edition","summary":"It's 8:08am on 8th August 1988, and the evil Dr. H8 has brought the world to the brink of total annihilation! His demands are simple: pay $88 octillion within 88 minutes, or Dr. H8's 88 thermo-nuclear warheads will wipe out the Earth! But who will save us in our time of need? The bravest? The boldest? No... the 88 Heroes (plus ten of their friends)!\n\nPrepare to infiltrate Dr. H8's lair with the help of the strangest, dumbest and most pointless superheroes ever! With 88 levels between you and Dr. H8, only 88 seconds to complete each level and the 88-minute Doomsday clock already ticking, lead 98 unique characters – each with their own special abilities – on a platform-hopping, enemy-smashing, danger-dodging mission to save Earth from complete destruction!","genres":["Platform","Indie","Arcade"],"developers":[],"publishers":["Rising Star Games"],"aggregated_rating":70.0,"release_date":1507766400,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1s0x.jpg","external_ids":[]}]