[{"igdb_id":115581,"name":"Jìgěi Míngrì De Xīwàng","summary":"This is a visual novel telling a love story set on a school campus. The story consists of a common route and two individual routes, collectively constructing a backdrop where the school and society intersect. It follows the protagonist as they search for love and overcome their confusion.","genres":["Role-playing (RPG)","Simulator","Indie"],"developers":["Civilization Tónghào Huì"],"publishers":["Civilization Tónghào Huì"],"aggregated_rating":null,"release_date":1552608000,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]},{"igdb_id":373687,"name":"Jìngjiè 2: Qiánkūn Yī Zhì","summary":"Jìngjiè 2: Qiánkūn Yī Zhì is an independent, single-player rogue-like RPG. Its 1v1 turn-based dice-rolling combat is innovative and unique, with victory determined by a point-based competition and every roll of the dice full of uncertainty. The game offers a vast array of skills and artifacts, allowing for a flexible build style. Whether you're a \"Gambler\" relying on extreme strategy or a \"Noble Phantasm\" relying on divine weapons, you'll find a way to victory. The perfect blend of randomness and deep strategy makes every challenge unique. Embark on an adventure, warriors! Use wit and luck to defeat the demons and win your own victory!","genres":["Strategy","Adventure","Indie"],"developers":["QingHe Studio"],"publishers":["QingHe Studio"],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coapeh.jpg","external_ids":[]},{"igdb_id":373705,"name":"Jìn Shì Shū","summary":"As an orphaned courtesan turned rich man's sister, you enter the palace game. Entangle with six soulmates where romance is deadly—and every choice reshapes the dynasty. Pierce three deadlocks (throne, martial world, fate) with your heart. Write your legend in ashes amid bloodshed.","genres":["Role-playing (RPG)","Visual Novel"],"developers":["Diànzǐ Bīngkuài Cybertech"],"publishers":["Diànzǐ Bīngkuài Cybertech"],"aggregated_rating":null,"release_date":null,"platforms":["Linux","PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coapf7.jpg","external_ids":[]},{"igdb_id":373718,"name":"Jìyì de Zhǔrén","summary":"Focusing on story and exploration, the game unfolds a unique system and world-view within a traditional RPG framework. Combat is semi-real-time, eliminating the need for complex and meticulous control. Overwhelming victories offer significant rewards, complemented by a highly flexible equipment enhancement and crafting system. To ensure seamless gameplay, players can monitor their progress and adjust the difficulty of battles. Are you ready to face the secrets of the world?","genres":["Role-playing (RPG)","Adventure","Indie"],"developers":["Yèguāng"],"publishers":["RMAsia"],"aggregated_rating":null,"release_date":1761177600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coapx6.jpg","external_ids":[{"category":null,"store":"store_None","uid":"3822300","url":"https://store.steampowered.com/app/3822300"},{"category":null,"store":"store_None","uid":"985815881","url":"https://www.twitch.tv/directory/game/J%C3%ACy%C3%AC%20de%20Zh%C7%94r%C3%A9n"}]}]