[{"igdb_id":20561,"name":"LMA Manager 2007","summary":"LMA Manager 2007 is a soccer management game in the LMA Manager series. Like its predecessors, the game allows players to manage a soccer team. Included are teams from over 50 different countries and leagues from 8 of those countries. Available are over a 1000 different officially licensed teams. The game features an improved database engine and a transfer system with more depth than its predecessors.\n\nAll matches can be watched in full 3D. The AI plays the matches out, but it is still possible to make adjustments to player positions and the like. It is also possible to see the results of matches and all kinds of player and team statistics in the ingame magazine \"FootballOne\".","genres":["Simulator","Sport"],"developers":[],"publishers":[],"aggregated_rating":60.0,"release_date":1158883200,"platforms":["PC (Microsoft Windows)","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xjz.jpg","external_ids":[]},{"igdb_id":22299,"name":"LMA Manager 2005","summary":"A NEW GAME FOR THE NEW SEASON ...The best selling management game on console is back!\n\nALL STATS UPDATED FOR THE 2004/05 SEASON\nNEW IMPROVED FEATURES\n\nImproved 3D Match Engine\nExciting new improvements to match play and fluidity. New goal celebrations. All new player models.\n\nNOW BIGGER New playable leagues - Holland, Portugal and the English Conference League, plus new trophies to play and win\n\nEven Greater Authenticity\nMore realistic look and feel. Official English Football League license and club badges.\n\nExtra Content With XBOX Live\nDownload new Scenario Challenges and Fantasy Teams. Keep your game up to date, download all January '05 transfers. Make your performance official with online High Score tables\n\nPLUS\nOver 20,000 players 850 clubs and 31 countries\nFantasy team mode\nIn-depth player info\nExpert mode\nUnique interface for fast and easy game play\n\nImproved commentary by Barry Davies and presented by Alan Hansen and Gary Lineker","genres":["Simulator","Sport"],"developers":[],"publishers":[],"aggregated_rating":70.0,"release_date":1101081600,"platforms":["Xbox","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/obgbqrshudpcd6yk7vne.jpg","external_ids":[{"category":3,"store":"store_3","uid":"11938","url":"https://www.giantbomb.com/games/3030-11938/"},{"category":null,"store":"store_None","uid":"10961","url":"https://www.twitch.tv/directory/game/LMA%20Manager%202005"}]},{"igdb_id":22541,"name":"LMA Manager","summary":"LMA Manager is the first game in the LMA Manager franchise. It was released in 1999 on the PlayStation","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":937353600,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3cy8.jpg","external_ids":[]},{"igdb_id":22542,"name":"LMA Manager 2002","summary":"LMA 2002 was the final version in the series to be released on PlayStation, launched in October 2001. Although chiefly just an update from the 2001 version, the game did prove to be quite a stepping stone from the LMA of old and the LMA seen today.\n\nThe first PlayStation 2 incarnation went under the same name when released in April 2002. A significant update from PS1, it allowed players to manage in one of six European leagues, all of which were processed by the game simultaneously (the top two divisions in Italy, Spain, Germany and France were added, in addition to the existing top four divisions in England and Scotland). On the PS2, matches played out in full in a 3D match environment, followed by post-match highlights voiced by famous BBC presenter Gary Lineker alongside the returning Hansen. The game play advanced in this game from the 2001 version, in particular the in-match style. Players tend to shoot early, from around thirty yards, rather than enter into the penalty area.","genres":["Simulator","Sport","Strategy"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1004659200,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7h0u.jpg","external_ids":[]},{"igdb_id":22543,"name":"LMA Manager 2001","summary":"LMA Manager 2001 is the second game in the LMA Manager series. It was released in March 2001.","genres":["Simulator","Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7yec.jpg","external_ids":[]},{"igdb_id":22544,"name":"LMA Manager 2003","summary":"LMA Manager was a football management video game series developed and published by Codemasters. Developed primarily for consoles, the franchise differs from the PC-based Football Manager and Championship Manager series by focusing on visual details such as a fully 3D match engine, although still maintaining the realism and level of detail craved by fans of the genre - a unique combination when the series was first released.\n\nThe series has different titles in different regions: LMA Manager in the UK (named after the League Managers Association), BDFL Manager in Germany (Bund Deutscher Fußball-Lehrer, basically the German equivalent of the LMA), Manager de Liga in Spain, Football Manager Campionato in Italy, and FC Manager - La Passion du Foot in France since the 2006 edition (the French edition of the series was previously named Roger Lemerre - La Sélection des Champions after the former coach of the French national team","genres":["Simulator","Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1037318400,"platforms":["Xbox","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xnh.jpg","external_ids":[]},{"igdb_id":22545,"name":"LMA Manager 2004","summary":"Take the reins and become the professional team manager of one of the real-life football clubs from LMA Manager 2004's playable English, Scottish, French, German, Italian and Spanish leagues. The game has all the 2003/2004 season stats, with updated statistics for every player and all the transfers after the summer break. The 2004 version is a true advancement for the series that's renowned as the most emotive and entertaining football management game designed exclusively for console players. Complete with a whole new look, more flexible management options, and even more player stats, LMA Manager 2004 also introduces an engrossing new Fantasy Team game mode and, for seasoned managers, a challenging Expert setting in the full game.","genres":["Simulator","Sport","Strategy"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1081728000,"platforms":["Xbox","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7xk3.jpg","external_ids":[]},{"igdb_id":22547,"name":"LMA Professional Manager 2005","summary":null,"genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/qwhfynbspzj6b5uut32m.jpg","external_ids":[]},{"igdb_id":22548,"name":"LMA Manager 2006","summary":"All new transfer system, all new look, same brilliant gameplay!\n\nLMA Manager 2006 represents a massive leap forward in the series - now with an even more realistic transfer market - and as challenging and playable as ever!\n\nRealistic Transfer System\nGiving you more complex negotiations and more control than ever before.\n\nStunning 3D Match\nSee your manager take charge from the touch-line!\n\nBrand New Look\nIncredible new visuals and more realistic look.\n\nShare Content & Update Your Stats Online\n\nCommentary from Alan Hansen & Gary Lineker.","genres":["Simulator","Sport"],"developers":[],"publishers":[],"aggregated_rating":40.0,"release_date":1134864000,"platforms":["Xbox","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/adsrj03ia36xflinctd0.jpg","external_ids":[]},{"igdb_id":79788,"name":"LMNO","summary":"A first person parkour game by EA in collaboration with Steven Spielberg that has been cancelled twice.","genres":["Shooter","Platform"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6pjl.jpg","external_ids":[{"category":3,"store":"store_3","uid":"33062","url":"https://www.giantbomb.com/games/3030-33062/"}]},{"igdb_id":97400,"name":"L&M","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[{"category":null,"store":"store_None","uid":"67744","url":"https://www.giantbomb.com/games/3030-67744/"},{"category":null,"store":"store_None","uid":"505275","url":"https://www.twitch.tv/directory/game/L%26M"}]},{"igdb_id":377903,"name":"LM7","summary":"LM7 is a team-based word game that relies on quick thinking and mental connections. Two teams compete to identify their secret words on the board through clues given by the “team leader.” Each clue consists of one word + a number, and players must use their logic to understand the link between the clue and the correct words.","genres":["Card & Board Game"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coauoi.jpg","external_ids":[{"category":null,"store":"store_None","uid":"162852604","url":"https://www.twitch.tv/directory/game/LM7"}]}]