[{"igdb_id":81571,"name":"L@ve Once: Mermaid's Tears","summary":"L@ve Once: Mermaid's Tears is a port from PSP game called L@ve Once which features some changes and additional content in comparison to the original PSP release.\n\nUpdates in the PlayStation 3 port include the following:\nNew opening song, \"一度きりのLove Story\", by Ui Miyazaki (宮崎羽衣)\nNew ending song, \"Last be Love\", by Ui Miyazaki (宮崎羽衣) and Youko Hikasa (日笠陽子)\nOpening video made for the new opening theme\nAdded new heroine, Michiru Tsutsumi (堤 美散) along with new CG events for the character\nExpanded elements of the story focusing on the new heroine\nMotion Portrait technology is included in the gameplay\nBonus content included after clearing the game","genres":["Visual Novel"],"developers":["Maid meets Cat"],"publishers":["Maid meets Cat"],"aggregated_rating":null,"release_date":1298505600,"platforms":["PlayStation 3"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2i4i.jpg","external_ids":[{"category":3,"store":"store_3","uid":"36799","url":"https://www.giantbomb.com/games/3030-36799/"}]},{"igdb_id":105740,"name":"LVN Fake News","summary":"LVN Fake News is an adult orientated visual novel. Nadiya, your main female character, must unravel the mystery of the LVN News program. What deep dark secrets will she discover? Are her fellow reporters all they seem to be? And whatever you do, you must not report fake news.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1534809600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co46of.jpg","external_ids":[]},{"igdb_id":106042,"name":"LVL","summary":"LVL is the new minimalistic puzzle that blends 3D into 2D with a twist! \n \nLVL forces players to think in 3d while solving puzzles in 2d. Most of the puzzles of LVL can not be solved by interacting pieces on a single face. Players have to think possible solutions that involves replacing pieces on current face and opposite face of it.","genres":["Puzzle","Strategy","Indie"],"developers":["SquareCube"],"publishers":[],"aggregated_rating":null,"release_date":1481673600,"platforms":["Android","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1im7.jpg","external_ids":[]},{"igdb_id":125139,"name":"LV-426","summary":"LV-426 is a remake of an old first-person shooter game called 'Aliens'. The original game was developed by Software Studios and published by Electric Dreams in 1987 for the Commodore 64, Amstrad CPC, ZX Spectrum and MSX.\n\nThe game is based on the second movie in the Alien movie series.","genres":["Shooter","Tactical","Indie"],"developers":["Derbian Games"],"publishers":["Derbian Games"],"aggregated_rating":null,"release_date":1183075200,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[{"category":14,"store":"playstation","uid":"1492994625","url":"https://www.twitch.tv/directory/game/LV-426"}]},{"igdb_id":125917,"name":"LVL99: AxeRage","summary":"LVL99: AxeRage is a gratuitously violent 2D action platformer inspired by the iconic pop culture of the 80s and 90s. With brute force, a little supernatural intervention, and a RADioactive dog, players must free Earth from unrelenting hordes of aliens, robots, and zombies, oh my.","genres":["Platform","Indie"],"developers":["Master UOMU"],"publishers":["Master UOMU"],"aggregated_rating":null,"release_date":1517356800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3b3u.jpg","external_ids":[]},{"igdb_id":139450,"name":"L@ve Once","summary":"L@ve Once (read as \"love at once\") is a romance visual novel that tells the story of a boy called Shouji Takanashi (高梨 翔司) whose mother is a mermaid. He met mermaids as a small child but forgot about them. One day, his father passes away and not long after, two sisters, who happen to be mermaids as well, come to his place. Their names are Mei and Meru. Being a son of a mermaid, he can only fall in love once, as broken heart would be the end of him. With the help of Mei and Meru, he will hopefully be able to find his true love.\n\nThe game originated on PSP and is a light visual novel without any adult content. A year later the game was ported to PS3 with some changes and additional content under the title L@ve Once: Mermaid's Tears. Both platforms have limited edition releases which feature bonus content such as audio drama, artbook or soundtrack.","genres":["Visual Novel"],"developers":["Maid meets Cat"],"publishers":["Maid meets Cat"],"aggregated_rating":null,"release_date":1285804800,"platforms":["PlayStation Portable"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2i4j.jpg","external_ids":[]},{"igdb_id":140592,"name":"LV99: Final Fortress","summary":"Maradook and Gorth, evil gods from ancient times, have been sealed away in the Final Fortress. At the eleventh hour before their awakening, three heroines have gathered and arrive at the fortress: Ariel, the chosen one; Billie, a dragon-slaying princess from the north; Celsia, a witch-turned-magician with stellar talent, but no temperament to speak of.\n\nA number of bosses stand in the way before the heroines can take on an ancient god. Strategic combinations of equipment and skills are required to stand a chance. After each battle, a new piece of ultra-legendary equipment is acquired which provides higher stats, a passive effect and a powerful skill. Only the most synergetic combinations may prevail against the power of an ancient god!\n\nFollow delightful conversations, solve puzzles, collect collectibles and listen to some self-written music. Find metroidvania-style items and upgrade your Celestial Tea while you’re at it! Maybe you can even fill that fourth character slot with an unexpected, but powerful ally? There’s a lot to do, all crammed into a 5-hour experience.","genres":["Role-playing (RPG)","Strategy","Adventure","Indie"],"developers":["Great Potion Games"],"publishers":["Great Potion Games"],"aggregated_rating":null,"release_date":1594166400,"platforms":["Linux","PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2jmp.jpg","external_ids":[]},{"igdb_id":299187,"name":"LvL50","summary":"Complete 50 levels. In a row. Without getting hit.","genres":["Shooter","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":["Linux","PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coan09.jpg","external_ids":[{"category":null,"store":"store_None","uid":"458007235","url":"https://www.twitch.tv/directory/game/LvL50"},{"category":null,"store":"store_None","uid":"1633199","url":"https://pg23.itch.io/lvl50"},{"category":null,"store":"store_None","uid":"3810170","url":"https://store.steampowered.com/app/3810170"}]}]