[{"igdb_id":319593,"name":"QS Asteroids","summary":"QS Asteroids is a fairly basic conversion of the original arcade game. The action starts immediately after loading (no title or options screens here) and players finds themselves in a space ship in the middle of the screen with numerous asteroids passing by. To control the ship, two keys are used for rotating it, one for shooting and another for thrusting it forward. Shooting can be done in eight directions. On an unmodified ZX81, the ship is represented by a number which changes with rotation (For example 0 means it's pointing up, while 4 is down) and the asteroids are o's, while users with a QS CHRS board get graphics more similar to the arcade original. The player starts with three ships and after 10,000 points a bonus ship is given. Asteroids appear in waves. The first one has two large ones and the number increases with each new wave.","genres":["Arcade"],"developers":["Quicksilva Ltd."],"publishers":["Quicksilva Ltd."],"aggregated_rating":null,"release_date":378604800,"platforms":["Sinclair ZX81"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8xh6.jpg","external_ids":[]},{"igdb_id":327103,"name":"Q Steps","summary":"An educational games for young children to start learning English, the game has several courses divided up in areas, which themselves are different themes for building word comprehension. The game is based on a book called \"English With A Smile\".\n\nThe different areas are\n- The Gatehouse (numbers)\n- The Q family house (family relationships)\n- The Paint Factory (colors)\n- The Tailor's Shop (clothing)\n- The Gym (parts of the body)\n- The School (classroom)\n- The Grocery Store (food)\n- The Theater (feelings)\n\nThe game came in 2 CDs where CD 1 is the 4 first areas and CD 2 is the latter 4 areas. Later revisions of the game combined both CDs into 1 and as such there was no need to swap CDs while playing.","genres":["Point-and-click"],"developers":["Q Multimedia"],"publishers":["Anaya Interactiva","EMME Interactive SA","Tescom","Gessler Publishing","The Q Group","Bonnier Multimedia"],"aggregated_rating":null,"release_date":820368000,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]},{"igdb_id":327143,"name":"QSteps 2","summary":"This remake is the second CD of the original Q Steps.","genres":["Point-and-click"],"developers":["World Printing & Publishing Services"],"publishers":["World Printing & Publishing Services"],"aggregated_rating":null,"release_date":1601942400,"platforms":["iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co984r.jpg","external_ids":[]},{"igdb_id":327142,"name":"QSteps 1","summary":"This remake is the first CD of the original Q Steps, providing the 4 first areas.","genres":["Point-and-click"],"developers":["World Printing & Publishing Services"],"publishers":["World Printing & Publishing Services"],"aggregated_rating":null,"release_date":1600732800,"platforms":["iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co984q.jpg","external_ids":[]},{"igdb_id":301355,"name":"QS Monkey Land: King of Fruits","summary":"Merge cute fruits to create bigger ones!\nWho can create the giant fruit first?\nChallenge now!","genres":["Arcade"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1697500800,"platforms":["Android","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co87nx.jpg","external_ids":[]},{"igdb_id":152114,"name":"QS Invaders","summary":"A space invaders clone. Plays the same as the original.","genres":["Arcade"],"developers":["Quicksilva Ltd."],"publishers":["Quicksilva Ltd."],"aggregated_rating":null,"release_date":410140800,"platforms":["Sinclair ZX81"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co394e.jpg","external_ids":[]},{"igdb_id":319594,"name":"QS Defender","summary":"QS Defender is a side scrolling shooter that although it is inspired by it, lacks many features of the arcade game Defender. This version is constantly scrolling left to right and there is no option to turn around and move in the opposite direction. The player can move up and down, fire and use thrust to increase the movement speed forward. There is only one enemy type and each one killed is worth 100 points. Enemies appear in waves. At the start there are just a few but as the player progresses it gets more hectic with up to eight enemies on the screen at once. The player has nine ships. When getting hit the screen goes black for a few seconds before it starts again with a clear screen and one ship less. Once all ships are lost the game has to be restarted through basic.","genres":["Shooter","Arcade"],"developers":["Quicksilva Ltd."],"publishers":["Quicksilva Ltd."],"aggregated_rating":null,"release_date":378604800,"platforms":["Sinclair ZX81"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8xh7.jpg","external_ids":[]},{"igdb_id":319595,"name":"QS Scramble","summary":"QS Scramble is a clone of the arcade game Scramble. It's a side-scrolling shooter where the player controls a space craft flying over the surface of an alien planet. Movement is limited to moving up and down and there are two weapons to attack with: forward going missiles and bombs that are dropped onto ground targets. Five missiles can be fired at a time and three bombs can be dropped at a time. Targets include aliens that swoop down from above and rockets that launch from the ground. On the ground there are also fuel dumps. The game goes on until the player has lost all three lives or the fuel runs out.","genres":["Shooter","Arcade"],"developers":["Quicksilva Ltd."],"publishers":["Quicksilva Ltd."],"aggregated_rating":null,"release_date":410140800,"platforms":["Sinclair ZX81"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8xh8.jpg","external_ids":[]}]