[{"igdb_id":76187,"name":"TFX","summary":"TFX (Tactical Fighter eXperiment) is a flight simulation where the player can fly with F-117A, Eurofighter 2000 or F-22 Superstar in various scenarios as a UN fighter pilot. Before the player begins his/her duty, there is a need to complete 10 training missions. Only then will the rest of the possible game modes be available. The game also contains a mission editor where the player can create his/her own missions in any of the chosen scenarios.","genres":["Simulator"],"developers":["Digital Image Design"],"publishers":["Imagineer​","Ocean Software"],"aggregated_rating":null,"release_date":757296000,"platforms":["PC-9800 Series","DOS","Amiga"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coa71o.jpg","external_ids":[]},{"igdb_id":125535,"name":"TFM: The First Men","summary":"TFM: The First Men is a strategy simulation enriched with character-driven base building, party-based exploration, and tactical real-time with pause combat. Inspired by the creation stories, Knights and Merchants, and Rimworld.\n\nBuild your settlement with the help of various paths and crafts. Use countless traits, items, and skills to make the first men in your image. Raise and train children and shape their future into becoming heroes. Gather your party to explore outer regions and exploit your findings. Meet authentic cultures, obtain quests and answer pleas for help. Fight through dungeons, encounter deadly boss fights, and loot hidden treasures.","genres":["Simulator","Strategy","Indie"],"developers":["Gathering Tree"],"publishers":["Gathering Tree"],"aggregated_rating":null,"release_date":1667347200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5hgz.jpg","external_ids":[]},{"igdb_id":126101,"name":"TFC: The Fertile Crescent","summary":"The Fertile Crescent is a Real Time Strategy game set during the Bronze Age in the Ancient Near East.\n\nInspired by the rise and fall of Bronze Age civilizations, you must manage the delicate balance between food surplus and the maintenance of your army.","genres":["Real Time Strategy (RTS)","Strategy"],"developers":[],"publishers":["The Knights of Unity"],"aggregated_rating":null,"release_date":1718236800,"platforms":["Linux","PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4m3o.jpg","external_ids":[]},{"igdb_id":44874,"name":"TFX","summary":"TFX - Tactical Fighter Experiment (aka TFX) was one of the precursor combat flight simulators that helped to define the standards of modern combat flight simulators, together with Tornado, F14 Fleet Defender and the Falcon series. TFX was programmed by the British company Digital Image Design and published by Ocean Software in 1993.","genres":["Simulator"],"developers":["Digital Image Design"],"publishers":["Ocean Software","Imagineer"],"aggregated_rating":null,"release_date":851817600,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co737d.jpg","external_ids":[]}]