[{"igdb_id":23710,"name":"K-1 World Grand Prix","summary":"The new breed of sport fighting games has entered the ring. K-1 World Grand Prix combines the tactical barrage of boxing with the powerful ferocity of no-holds-barred fighting to deliver the ultimate sport fighting experience. With greater depth, more strategy and the fiercest knockouts around, K-1 World Grand Prix puts all other sport fighting games on the canvas! .Over 20 real K-1 fighters, each with signature moves & combos. Body-region-specific damage allows for tactical weakening the opponent. Endless offensive and defensive moves to employ. 7 game modes including Grand Prix, Trial, Revival & Head-to-head.","genres":["Fighting","Racing","Simulator","Sport"],"developers":[],"publishers":[],"aggregated_rating":75.5,"release_date":1060387200,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/o27orljxtw6yjrh1l6f7.jpg","external_ids":[]},{"igdb_id":43723,"name":"K-1 The Arena Fighters","summary":"All of the punches, kicks, knockouts, and general brutality of kickboxing have come to the PlayStation with K-1 THE ARENA FIGHTERS. You can choose from eight fighters based on real-world kickboxers, and then experience the brutal nature of the sport in a Single-Player match, or try to become champion in a Tournament. If you're looking for a different kind of challenge, pick a team of boxers, and beat up the opposition in the Team Challenge mode. If your friends challenge your dominance of the ring, put them in their place with a match in the Versus mode. No matter what mode you play, motion-captured animation makes all the characters move realistically. If you are good enough, you can unlock a video that shows how the motion-capture work was done. Do you have the stamina to become the best of the best in K-1 THE ARENA FIGHTERS?","genres":["Fighting"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":882316800,"platforms":["PlayStation"],"cover_url":null,"external_ids":[]},{"igdb_id":43722,"name":"K-1 Grand Prix","summary":"The rough and tumble world of professional kickboxing comes to the PlayStation with K-1 Grand Prix. Choose from 16 professional kickboxers including Andy Hug, Musashi, and Ernesto Hoost, and if you don't like any of the professional contenders, create your own. After choosing the right avatar, jump into the ring for some training. Once you are ready for some competition, you can try to win a Tournament, but those players looking for a real challenge should play the Career mode. This is where you try to work your way from the bottom of the rankings to the championship. Between each bout, spend time training; how well you perform each training task will reward you with points that can be spent on new moves and combinations. Do you have the grit and determination to become the best in K-1 Grand Prix?","genres":["Fighting"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":951436800,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/hlsabtpq8jyfwd4vwwhw.jpg","external_ids":[]},{"igdb_id":49655,"name":"K-1 Pocket Grand Prix 2","summary":"K-1 Pocket Grand Prix 2 is a Kickboxing game, published by Konami, it was released only in Japan in 2002.\n\nK-1 Pocket Grand Prix 2 is a Japan only sequel in which you can select from a roster of 17 famous K-1 fighters from different regions and compete to win the grand prix tournament. You can also create a fighter and select a region and selection of punches and kicks for him. The game represents the fighters as over top cartoony sprites in the same style as puzzle fighter does for street fighter characters. The game plays out in sped up 3 minute rounds and does not represent accurate K-1 fighting as fighters can utilize special moves such as flaming kicks. The game borrows features from other 2D fighters such as street fighter allowing you to do charge attacks, parries, super moves and you win the game by depleting your opponents health bar. The game is a little tongue in cheek, when cro-cop wins a fight he does his winning pose in his famous cop uniform.","genres":["Fighting","Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1041033600,"platforms":["Game Boy Advance"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/lewob38ncesgriwoyqk0.jpg","external_ids":[]},{"igdb_id":85678,"name":"K-1 World GP","summary":null,"genres":[],"developers":[],"publishers":["D3 Publisher"],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":66883,"name":"K-1 World Grand Prix 2001 Kaimakuden","summary":"K-1 World Grand Prix 2001 Kaimakuden is a Kickboxing game, developed by Xing Entertainment and published by Konami, which was released in Japan in 2001.","genres":["Fighting"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/sri8blsx3bo8xh5e6ocd.jpg","external_ids":[]},{"igdb_id":23469,"name":"K-1 World Grand Prix 2001","summary":"K-1 World Grand Prix 2001 is a Kickboxing game, developed by KCEJ and published by Konami, which was released in Japan in 2001.","genres":["Fighting"],"developers":[],"publishers":[],"aggregated_rating":80.0,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/vjos7zqnsoblb1qxipmd.jpg","external_ids":[]},{"igdb_id":45075,"name":"K-1 Revenge","summary":"Kickboxing, Karate, Kenpo, Kung-Fu, and Tae-Kwondo are among the various martial arts disciplines making up the \"K\" in K-1 Revenge, the unofficial sequel to 1997's K-1: The Arena Fighters. The K-1 is a real event held annually to determine the best fighter in the world, and it is unique in that it embraces all forms of fighting styles. \n \nNow you can decide if you have what it takes to become a world-class fighter by selecting one of fourteen authentic K-1 participants in your choice of five game modes including One Player, Tournament, Team Battle, Training and AI Setup. The One Player contest has you fighting against eleven computer opponents, while Tournament has up to eight human players competing in a series of matches for the right to be called champion.","genres":["Fighting"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":922579200,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cve6vodbuynldvhbv4nr.jpg","external_ids":[]},{"igdb_id":67047,"name":"K-1 Premium 2004 Dynamite!!","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":66875,"name":"K-1 World Grand Prix: The Beast Attack!","summary":"K-1 World Grand Prix: The Beast Attack! is a Kickboxing game, published by Konami, which was released in Japan in 2003.","genres":["Fighting"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/rcnpxr01a44uxd9oqfrx.jpg","external_ids":[]},{"igdb_id":66879,"name":"K-1 World GP 2005","summary":"K-1 World GP 2005 is a Kickboxing game, developed and published by D3, which was released in Japan in 2005.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/tdqu0vld7fsefwf9llvh.jpg","external_ids":[]},{"igdb_id":66878,"name":"K-1 World GP 2006","summary":"K-1 World GP 2006 is a Kickboxing game, developed and published by D3, which was released in Japan in 2006.","genres":["Fighting"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/z7abmncpf4jat67czgvz.jpg","external_ids":[]},{"igdb_id":66876,"name":"K-1 World Grand Prix 2003","summary":"K-1 World Grand Prix 2003 is a Kickboxing game, published by Konami, which was released in Japan in 2003.","genres":["Fighting"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/vv2zumukviyibgsupjc6.jpg","external_ids":[]},{"igdb_id":44646,"name":"K-1 Premium Dynamite!!","summary":null,"genres":["Fighting"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1103673600,"platforms":["PlayStation 2"],"cover_url":null,"external_ids":[]},{"igdb_id":268183,"name":"K11: Kommissare im Einsatz","summary":"Slip into the role of a young inspector who is new to the K11 team and solve five exciting and tricky cases under the guidance of inspectors Rietz and Naseband. Experience the thrill of a real investigator in a world full of intrigue and lies and try to uncover the truth against all odds. Investigate crime scenes with the typical technical tools of a modern investigator. Rely on your judgment as you sit in the interrogation room with both yourselves and suspects and only through skillful interrogation can you get them to reveal their most secret thoughts.","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1271203200,"platforms":["Wii"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co74my.jpg","external_ids":[]},{"igdb_id":49656,"name":"K-1 Pocket Grand Prix","summary":"K-1 Pocket Grand Prix is a kickboxing game, published by Konami, which was released in Japan in 2002.\n\nK-1 Pocket Grand Prix is a fighting game developed by Daft Co. and published by Konami Corporation for Game Boy Advance.\n\nK-1 Pocket Grand Prix is a kickboxing game that uses the K-1 brand and real fighters.\n\nPlayers can choose from one of fourteen different fighters. Players can kick, punch, and use special moves.","genres":["Fighting"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1018742400,"platforms":["Game Boy Advance"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/sdjn9luhuxbawwmxfef9.jpg","external_ids":[]},{"igdb_id":260837,"name":"K-16: Story of Steel","summary":"The sequel to 2013's Sicari!","genres":["Platform"],"developers":["eevee"],"publishers":[],"aggregated_rating":null,"release_date":1420588800,"platforms":["Super Nintendo Entertainment System"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6wuu.jpg","external_ids":[]},{"igdb_id":66880,"name":"K-1 Oujya ni Narou!","summary":"K-1 Oujya ni Narou! is a Kickboxing game, developed and published by Xing Entertainment, which was released in Japan in 2000.","genres":["Fighting"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cophfpwqyokmxgf110ku.jpg","external_ids":[]}]