[{"igdb_id":12650,"name":"K240","summary":"A space-based resource management game, loosely a sequel to the earlier Utopia.\n\nYou start building your community on an asteroid, whose natural resources must be mined and put to use. You must use generators to power the mines and their auxilliary buildings such as storage facilities, which must be maintained. All of this costs money, but the mined resources can be sold or used.\n\nProblems you face include pollution, collisions with other asteroids, worker discontent and alien unrest. Battles against the aliens indigenous to the area must be fought, making building and maintaining a space fleet a priority.","genres":["Strategy"],"developers":["Gremlin Graphics"],"publishers":["Gremlin Graphics"],"aggregated_rating":null,"release_date":788832000,"platforms":["Amiga"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/kd9c70uvgyoqedws9dqm.jpg","external_ids":[]},{"igdb_id":245800,"name":"K2 Story","summary":"Can you get your team to the top of the worlds most dangerous mountain? This amazing K2 mountain climbing simulation game dares you! Battle the cold, the thin atmosphere, the wind and the snow! Do your best to avoid debilitating medical conditions! React to dramatic and dynamic weather conditions! Stay alive in the death zone! The higher you climb, the more points you will score! But keep your team rested and in good health. There are severe penalties for injuries.","genres":["Simulator","Strategy","Adventure"],"developers":["Jabatoba"],"publishers":["Jabatoba"],"aggregated_rating":null,"release_date":1589587200,"platforms":["Android","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6g5f.jpg","external_ids":[{"category":14,"store":"playstation","uid":"459457274","url":"https://www.twitch.tv/directory/game/K2%20Story"}]},{"igdb_id":274560,"name":"K2: Digital Edition","summary":"Easy to play, hard to survive. Rush to the summit before weather breaks or set up camps and prepare to push later. Choose the right cards for the right moment. Play turn based strategy with friends, AI or in single player mode. Popular board game adaptation consulted with real K2 climbers.","genres":["Strategy","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1745884800,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co97s6.jpg","external_ids":[{"category":null,"store":"store_None","uid":"2561310","url":"https://store.steampowered.com/app/2561310"},{"category":null,"store":"store_None","uid":"2136998647","url":"https://www.twitch.tv/directory/game/K2:%20Digital%20Edition"}]}]