[{"igdb_id":8748,"name":"N","summary":"N is an award-winning 2D action/puzzle platformer reminiscent of Lode Runner: you're a tiny stick figure running around in a puzzle-y world inhabited by enemies. But in N, there's a twist: the ninja is driven not only by a thirst for gold, but also by a physics simulation. Expect to encounter death frequently, animated with hilarious ragdoll physics.\n\nN includes a built-in editor, called Ned. You can make your own levels to share with the community or hoard for yourself. Infinite levels, woo!","genres":["Platform","Puzzle","Indie"],"developers":["Metanet Software"],"publishers":["Metanet Software"],"aggregated_rating":null,"release_date":1078099200,"platforms":["Web browser","Linux","PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8pns.jpg","external_ids":[]},{"igdb_id":8749,"name":"N+","summary":"N+ is a port of the original Adobe Flash based PC game, N, to console and handheld systems with new features.\n\n\"N+ is a peerless action-puzzle platformer with more than 300 levels in which to hone your ninja reflexes, plus a built-in level editor for when you're hungry for more. N+ also features unique, physics-based controls, stylish graphics, unlimited lives, competitive and cooperative multiplayer, plenty of gold, and several flavors of sweet, sweet action.\"\n\n\"N+ features N doesn't have:\n-Redesigned graphics and visual effects: a more detailed version of N's in-your-face minimalist style\n-New objects and enemies: Pulse Drone, Laser Turret and Zap Doors\n-Background music and next-gen 5.1 surround sound\n-Way over 400 all-new levels\n-3 pants-wettingly good modes of multiplayer: Co-op, Race and Survival\"","genres":["Platform","Puzzle","Indie"],"developers":["SilverBirch Studios","Slick Entertainment","Metanet Software"],"publishers":["Atari, Inc.","Metanet Software"],"aggregated_rating":80.0,"release_date":1203465600,"platforms":["PlayStation Portable","Xbox 360","Nintendo DS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ejo.jpg","external_ids":[]},{"igdb_id":8750,"name":"N++","summary":"N++ is a fast-paced, action-packed platformer set in the distant future. You play as a ninja, darting through obstacles, narrowly evading a slew of inadvertently homicidal enemy robots and collecting gold in a minimalist, sci-fi world. N++ is all about smooth physics, deftly controlling the speed and inertia of the character, and the awesome feeling of fluidly moving through each level.","genres":["Platform","Puzzle","Indie","Arcade"],"developers":["Metanet Software"],"publishers":["Metanet Software"],"aggregated_rating":82.8,"release_date":1438041600,"platforms":["PlayStation 4","Linux","PC (Microsoft Windows)","Mac","Xbox One","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2535.jpg","external_ids":[]}]