[{"igdb_id":4038,"name":"NCAA College Basketball 2K3","summary":"NCAA College Basketball 2K3 is an American college basketball video game which was initially released on December 2, 2002 for the Xbox, PS2 and GameCube. It is to this day the only title in the series that uses the \"College Basketball\" designation rather than \"College Hoops\". It is also the only title for the series to appear on the GameCube and the GameCube's only college basketball game. It features former Duke Blue Devils guard Jay Williams on the cover. This game was released in very limited quantities and is one of the more difficult GameCube titles to find.","genres":["Sport"],"developers":["Kush Games","Visual Concepts"],"publishers":["Sega"],"aggregated_rating":null,"release_date":1038873600,"platforms":["Xbox","Nintendo GameCube","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6ue1.jpg","external_ids":[]},{"igdb_id":4039,"name":"NCAA College Football 2K3","summary":"It's time to hit the turf and get ready for another round of NCAA football action. NCAA College Football 2k3 is here and it's full of updated rosters, teams and stadiums to fulfill all of your college football needs. Play as your favourite up-and-comers with a friend to see who's the best. NCAA College Football 2k3 is here for the Microsoft Xbox and it's go time. Hut, hut!","genres":["Sport"],"developers":["Visual Concepts"],"publishers":["Sega Sports R&D"],"aggregated_rating":null,"release_date":1028678400,"platforms":["Xbox","Nintendo GameCube","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6udq.jpg","external_ids":[]},{"igdb_id":4385,"name":"NCAA Final Four Basketball","summary":"NCAA Final Four Basketball is a standard basketball-sim with a full NCAA license with 64 of the top Division 1-A teams including North Carolina, Florida State, Boston College, and Maryland to name a few.\n\nThere are three modes of play to choose from: two Practice modes, one which shows the player the basic in's and outs of the game and another for free throw shooting, Exhibition and Tournament. Along with these modes are the ability to change around options to play a game to the player's liking including changing the length of the game. A battery-backup lets the player save their games, stats and rosters.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":788832000,"platforms":["Super Nintendo Entertainment System","Sega Mega Drive/Genesis"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5oyj.jpg","external_ids":[{"category":14,"store":"playstation","uid":"491780","url":"https://www.twitch.tv/directory/game/NCAA%20Final%20Four%20Basketball"},{"category":null,"store":"store_None","uid":"52965","url":"https://www.giantbomb.com/games/3030-52965/"}]},{"igdb_id":5065,"name":"NCAA Football 09","summary":"NCAA Football 09 is a college football video game created by EA Sports, a subsidiary of Electronic Arts. It is the successor to NCAA Football 08 in the NCAA Football series. The game was announced on February 14, 2008 and was released on July 15, 2008.[1][2] The Wii version of the game is titled NCAA Football 09 All-Play and launched under EA Sports' new All-Play brand exclusive to the platform.[3]","genres":["Simulator","Sport"],"developers":["EA Canada","EA Orlando"],"publishers":["EA Sports"],"aggregated_rating":86.0,"release_date":1216080000,"platforms":["PlayStation 3","PlayStation Portable","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7274.jpg","external_ids":[]},{"igdb_id":5952,"name":"NCAA Football 06","summary":"NCAA Football '06, known colloquially as College Football 2006, is a collegiate American football video game which was released on July 11, 2005. It is the successor to NCAA Football 2005 in the NCAA Football series. The product features former Michigan Wolverines standout and Heisman Trophy winner Desmond Howard on the cover. He is the only cover athlete not to have played the year before their respective game; Howard last played at Michigan in 1991. It is the only game in the series as of 2013 to have a music soundtrack, as the other games play school fight songs and general band pieces, and the last game in the series to feature FCS (Division 1-AA) teams.","genres":["Sport"],"developers":["EA Orlando"],"publishers":["EA Sports"],"aggregated_rating":85.0,"release_date":1121040000,"platforms":["Xbox","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8rnb.jpg","external_ids":[]},{"igdb_id":5953,"name":"NCAA Football 07","summary":"NCAA Football 07 is the successor to NCAA Football 06 in the NCAA Football series. The product features former USC player Reggie Bush on the cover.","genres":["Simulator","Sport"],"developers":["EA Orlando"],"publishers":["EA Sports"],"aggregated_rating":85.25,"release_date":1153180800,"platforms":["Xbox","PlayStation Portable","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7273.jpg","external_ids":[]},{"igdb_id":5954,"name":"NCAA Football 08","summary":"NCAA Football 08 is a college football video game created by EA Sports, the sports video gaming subsidiary of Electronic Arts. It is the successor to NCAA Football 07 in the NCAA Football series. It was officially announced with the launch of the NCAA 08 page on the EA Sports website on February 20, 2007.[1] EA Sports had opened up a ballot on their NCAA Football 07 site in which fans can vote on a feature to be implemented into the PlayStation 2 version, making it the first console announced for the game and announcing at least one of its features.[2] Fans could vote for either in-game saves, medical red shirts, summer workouts or a lead blocker feature. The option of medical red shirts was voted on and won, and this option is on the Dynasty Mode on all versions of NCAA Football 08. This allows for players that are injured in the middle of the year to apply to gain another year of eligibility. The game was released on July 17, 2007, and the first time release on PlayStation 3, marking the eleventh installment of the NCAA Football series bearing the title \"NCAA Football\". As with NCAA Football 07, 08 features limited ESPN integration.","genres":["Sport"],"developers":["EA Orlando"],"publishers":["EA Sports"],"aggregated_rating":87.5,"release_date":1184630400,"platforms":["Xbox","PlayStation 3","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/ffzbrfji6lvrgnkyphqq.jpg","external_ids":[]},{"igdb_id":5955,"name":"NCAA Football 2003","summary":"NCAA Football 2003, released for the PlayStation 2, Nintendo GameCube, and Xbox, featured University of Oregon quarterback Joey Harrington on the cover.\n\nNew features in this version included over 200 licensed fight songs, 3D cheerleaders and 144 different schools.\n\nDynasty mode was enhanced with the ability to redshirt a player and schedule non-conference games before each season. Trophies and awards, modeled after real-life college football awards, was another feature new to this version. Players could win trophies by playing games and could add them to a personal collection which is shown off in a trophy room. These awards include the Heisman, Coach of the Year and Bowl-specific trophies. The game featured 23 different rivalry trophies that were created to represent their real-life counterparts.\n\nCreate-A-School mode returned in this edition of the game after being absent from the previous year. The game also featured a customizable interface for the first time. A player could choose his or her favorite team and the game interface would be based around that team's fight song, mascot, logos and school colors.","genres":["Sport"],"developers":["EA Orlando"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":1027123200,"platforms":["Xbox","Nintendo GameCube","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6ueb.jpg","external_ids":[]},{"igdb_id":5956,"name":"NCAA Football 2004","summary":"NCAA Football 2004 is an American football video game released in 2003 by Tiburon. It is the successor to NCAA Football 2003 in the NCAA Football series. The player on the cover is former USC quarterback Carson Palmer. The game is available for play with the N-Gage. Commentators are Brad Nessler, Kirk Herbstreit and Lee Corso. The game is an EA Sports Bio game, and is compatible with other games with the feature (Madden NFL 2004 and NASCAR Thunder 2004, for example).\n\nThe game's gameplay similar to NCAA Football 2003, but with updated player stats and rosters. Players can rename players or create their own college team. If the player named the school after one of the schools in the game, the announcers use its name and fight song in the game. The game features new on-field presentation features such as players walking out of their locker room area and then onto the field behind a group of flag bearers. It also features player touchdown celebrations which can result in a penalty for unsportsmanlike conduct.","genres":["Sport"],"developers":["EA Orlando"],"publishers":["EA Sports"],"aggregated_rating":84.66666666666667,"release_date":1058313600,"platforms":["Xbox","Nintendo GameCube","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6uea.jpg","external_ids":[]},{"igdb_id":5957,"name":"NCAA Football 2005","summary":"NCAA Football 2005 is an American college football video game which was released on July 15, 2004. It is the successor to NCAA Football 2004 in the NCAA Football series. The product features former Pittsburgh Panthers and current Arizona Cardinals standout wide receiver Larry Fitzgerald on the cover. The game is the NCAA Football series released by EA Sports. This would be the final game in the NCAA Football series to be released on the Nintendo Gamecube.","genres":["Sport"],"developers":["EA Orlando"],"publishers":["EA Sports"],"aggregated_rating":81.75,"release_date":1089849600,"platforms":["Xbox","Nintendo GameCube","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7l5q.jpg","external_ids":[]},{"igdb_id":5958,"name":"NCAA March Madness 06","summary":"Electronic Art's NCAA Basketball franchise returns with new and improved features for the 2005 season. The new lockdown stick allows you to force opponent's to make easier turnovers and make smoother passes to teammates. You can have your senior captain get your team into the game and get your crowd fired up to rattle your rivals into mistakes. With an much more updated dynasty mode you can now recruit Junior College players with updated stats to keep you ahead of your rivals and relive some of the greatest moments with College Classics and play up to 20 great games, repeating history or completely changing it.","genres":["Sport"],"developers":["EA Orlando"],"publishers":["EA Sports"],"aggregated_rating":80.5,"release_date":1128988800,"platforms":["Xbox","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/hhq3iolojzuqnkqdpnpw.jpg","external_ids":[]},{"igdb_id":5959,"name":"NCAA March Madness 2004","summary":"Choose from one of 320 Division I schools and enter the 30 year dynasty mode.","genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":1069027200,"platforms":["Xbox","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/gn28yqugiu8ipd63tmmp.jpg","external_ids":[]},{"igdb_id":5960,"name":"NCAA March Madness 2005","summary":"NCAA March Madness 2005 is the 2004 installment in the NCAA March Madness series. Former Connecticut, Charlotte Bobcats, New Orleans Hornets, Washington Wizards, and New Orleans Pelicans player, and current NBA free agent player Emeka Okafor is featured on the cover.","genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":1100563200,"platforms":["Xbox","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/suayly6sp2xzlb0vvmsq.jpg","external_ids":[]},{"igdb_id":7109,"name":"NCAA Basketball 09","summary":"NCAA Basketball 09 was the 2008 installment in the NCAA Basketball series. It was released on November 17, 2008 for the PlayStation 3, PlayStation 2, and Xbox 360.[1] Former UCLA forward Kevin Love was featured on the cover.","genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":60.0,"release_date":1226880000,"platforms":["PlayStation 3","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/vc6z7iqqfum7g4z5tedm.jpg","external_ids":[]},{"igdb_id":7110,"name":"NCAA Basketball 10","summary":null,"genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":77.0,"release_date":1258502400,"platforms":["PlayStation 3","Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/fwnldshtkvrvvbxbhh2g.jpg","external_ids":[]},{"igdb_id":7111,"name":"NCAA Football 10","summary":"NCAA Football 10 is a college football video game created by EA Sports. It is the successor to NCAA Football 09 in the NCAA Football series. It was released on July 14, 2009 for the Xbox 360, PS3, PSP, and PlayStation 2 consoles. Brian Johnson, Brian Orakpo, Mark Sanchez, and Michael Crabtree were the cover athletes for the game.","genres":["Simulator","Sport"],"developers":["EA Canada","EA Orlando"],"publishers":["EA Sports"],"aggregated_rating":90.0,"release_date":1247529600,"platforms":["PlayStation 3","PlayStation Portable","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2xf1.jpg","external_ids":[]},{"igdb_id":7112,"name":"NCAA Football 11","summary":"NCAA Football 11 is a college football video game created by EA Sports and developed by EA Tiburon. It is the successor to NCAA Football 10 in the NCAA Football series. It was released on July 13, 2010 for the PlayStation 2, PlayStation 3, Xbox 360. A handheld version was released for iOS on June 24, 2010.","genres":["Simulator","Sport"],"developers":["EA Canada","EA Orlando"],"publishers":["EA Sports"],"aggregated_rating":86.25,"release_date":1278979200,"platforms":["PlayStation 3","iOS","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4x3v.jpg","external_ids":[]},{"igdb_id":7113,"name":"NCAA Football 12","summary":"NCAA Football 12 is a college football video game created by EA Sports and developed by EA Tiburon. It is the successor to NCAA Football 11 in the NCAA Football series. It was released on July 12, 2011 for the PlayStation 3 and Xbox 360.","genres":["Simulator","Sport"],"developers":["EA Orlando"],"publishers":["EA Sports"],"aggregated_rating":88.25,"release_date":1310428800,"platforms":["PlayStation 3","Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4x4n.jpg","external_ids":[]},{"igdb_id":7114,"name":"NCAA Football 13","summary":"NCAA Football 13 is an American college football game in which players are given the ongoing opportunity to enjoy the collegiate game in multiple ways. Experience the rise to dominance of a young, up-and-coming gridiron star hoping to make his way to a college superpower of choice and eventually a national championship. Experience the pride and pageantry of gameday Saturday like never before as you go from high school superstar, to top college player, to head coach in Road to Glory and Dynasty modes. With a new passing system, new team-specific traditions, and the Heisman Challenge, make an impact by leading your team to the National Championship with NCAA Football 13.\n\nSights and Sounds\n\nRevel in the pageantry of college football game days with NCAA Football 13. Featuring new team run-outs, mascots and pre-game traditions along with significantly enhanced audio and new trophy presentations, NCAA Football 13 delivers the passion and excitement of college football to fans across the nation.\n\nGameplay\n\nWith a new passing system that changes the way quarterbacks and receivers play and respond, combined with a new read and react defensive AI system, NCAA Football 13 delivers greater realism on the virtual gridiron.\n\nDynasty\n\nGame days come to life with mid-game updates featuring a new studio analyst, plus enhanced commentary from NCAA Football veterans Kirk Herbstreit and Brad Nessler. Recruiting now goes deeper than ever with the addition of dynamic grades and the ability to scout players. Plus, there are even more ways to interact with your Dynasty from the web.\n\nHeisman Challenge\n\nThere are familiar faces on the field in NCAA Football 13, which now features a selection of former Heisman Trophy winners. With the new Heisman Challenge mode, fans have the ability to utilize the skill set of a legendary Heisman Trophy winner in a quest to match his award-winning historical performances and win the Heisman trophy once again.\n\nRoad to Glory\n\nThe experience of being a college football superstar is now even more exciting with a new feature in Road to Glory that allows players to see and feel the game differently during key moments, increasing on-field awareness and creating amazing opportunities.\n\nMultiplayer Support\n\nPrepare yourself to match your collegiate gridiron skills against friends. NCAA Football 13 supports 1 - 4 players locally, and up to 2 players in online play.","genres":["Sport"],"developers":["EA Orlando"],"publishers":["EA Sports"],"aggregated_rating":82.4,"release_date":1341878400,"platforms":["PlayStation 3","Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2cop.jpg","external_ids":[]},{"igdb_id":7384,"name":"NCAA March Madness 08","summary":null,"genres":["Sport"],"developers":["EA Canada"],"publishers":["EA Sports"],"aggregated_rating":60.0,"release_date":1197331200,"platforms":["PlayStation 3","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/ekm6amg2ja7li3hyvbfu.jpg","external_ids":[]},{"igdb_id":15505,"name":"NCAA: Road to the Final Four - 1991-92 Edition","summary":"NCAA Basketball: Road To The Final Four is your opportunity to prove history doesn't have to repeat itself.\n\nRoad To The Final Four is your court-side ticket to the most anticipated sporting event of the year. With Road To The Final Four you take control of the entire tournament! Whether you choose to go up against the best college athletes in the country, coach your own all-star team, or cheer on as your favorite team battles its way to the National Championship, Road To The Final Four will put you right into the middle of all the NCAA tournament action.\n\nRoad To The Final Four is a joint effort by the creators of Wayne Gretzky Hockey and Earl Weaver Baseball, two of the most critically acclaimed sports programs of all time. This team effort has yielded an unprecedented level of excellence that brings all the heart-pounding excitement of NCAA Basketball action to your PC.\n\nBecome this year's MVP. Road To The Final Four will let you make your place in NCAA history!","genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/gdxrwnkkk2gvpapp9wkn.jpg","external_ids":[]},{"igdb_id":15506,"name":"NCAA: Road to the Final Four 2","summary":"Remake tourney history with NCAA Road To The Final Four 2! Bring \"March Madness\" to your PC again and again! NCAA2 is the first PC basketball simulation to use sophisticated 3-D graphics technology that follows the action like a flight simulator, with a constantly changing viewing angle. Featuring: Real five-on-five action; Digitized player realism; Individual player intelligence based on actual NCAA stats!; Intuitive user interface. Play NCAA in minutes; School colors and jersey numbers; Real-time play or fast simulation modes; Variable zoom brings you as close to the action as you want; Modify names and stats. The VoxFX multi-layer sound engine throws you right into the action with all the on-court squeaks, thumps, grunts and banter of real college games! Put yourself in the shoes of Coach, Player, or Spectator and listen as the crowd goes wild.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":19673,"name":"NCAA Football 14","summary":"NCAA Football 14 is an American football video game published by EA Sports and developed by EA Tiburon. It is the successor to NCAA Football 13.","genres":["Simulator","Sport"],"developers":["EA Orlando"],"publishers":["EA Sports"],"aggregated_rating":74.875,"release_date":1373328000,"platforms":["PlayStation 3","Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co25ar.jpg","external_ids":[]},{"igdb_id":20297,"name":"NCAA Gamebreaker","summary":null,"genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":68.0,"release_date":867369600,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/f1gf9bqkrqklr3eqtnvb.jpg","external_ids":[]},{"igdb_id":21392,"name":"NCAA March Madness 07","summary":"The NCAA Basketball (formerly NCAA March Madness) series was a College basketball game which was published by EA Sports from 1998 until 2009. After EA Sports' rival publisher 2K Sports cancelled its own college basketball game, College Hoops, in 2008, EA changed the name of the series from NCAA March Madness to NCAA College Basketball. The series was discontinued on February 10, 2010.[1]\n\nLike other games based on NCAA sports, it could not feature the players' names (as that is against NCAA policy/rules), so only the players' numbers were used in the rosters. Users were able to edit the rosters, putting in the correct names for each team if they wished to do so. Many player last names were built into the in-game commentary, like in the NBA Live series.\n\nVerne Lundquist, Brad Nessler, and Gus Johnson lent their voices for play-by-play in the games at various times. Lundquist was the original announcer, with Nessler taking over in the mid-2000s and Johnson joining him for the most recent game in the series. Bill Raftery and Dick Vitale were analysts. Raftery originally worked with Lundquist on their games and returned to work alongside Johnson for CBS-branded games in NCAA Basketball 10, while Vitale and Nessler joined the series at the same time","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":67.0,"release_date":1168992000,"platforms":["Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co4onf.jpg","external_ids":[]},{"igdb_id":21726,"name":"NCIS","summary":"For the first time ever, the world of the NCIS TV show comes to your living room in an all-new NCIS story arc written with the writers of the show. Work as the NCIS team to solve complex murder, espionage and terrorist cases. Discover exciting connections between the four original cases as you crack each one, and work towards solving the overall investigation. Bond with your favorite NCIS characters and get first-hand experience with the group’s humor, personality quirks, and defining characteristics. Interact with the characters through layers of storyline and dialogue designed to make you an integral part of the cast’s compelling dynamic. Through a variety of mini-games: search crime scenes for clues and collect evidence; use the latest forensic tools and perform autopsies; conduct dramatic suspect interrogations; put your reflexes to the tests in tense action sequences. Finally piece the clues together using your wits to deduct the truth.","genres":["Point-and-click","Platform","Puzzle","Adventure"],"developers":["Ubisoft Shanghai"],"publishers":["Ubisoft Entertainment"],"aggregated_rating":56.5,"release_date":1319760000,"platforms":["PlayStation 3","Nintendo 3DS","Wii","PC (Microsoft Windows)","Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2d0i.jpg","external_ids":[{"category":null,"store":"store_None","uid":"66acd000-77fe-1000-9115-d80255530881","url":"https://marketplace.xbox.com//en-US/Product/NCIS-Game/66acd000-77fe-1000-9115-d80255530881"},{"category":null,"store":"store_None","uid":"36434","url":"https://www.giantbomb.com/games/3030-36434/"},{"category":null,"store":"store_None","uid":"32683","url":"https://www.twitch.tv/directory/game/NCIS"},{"category":null,"store":"store_None","uid":"xbox36066acd000-77fe-1000-9115-d80255530881","url":"http://marketplace.xbox.com/en-US/Product/NCIS-Game/66acd000-77fe-1000-9115-d80255530881"}]},{"igdb_id":23154,"name":"NCAA Final Four 99","summary":"NCAA FINAL FOUR '99 offers three gameplay modes: Exhibition, Tournament, and a 30-game Season. The rules can be configured to your preferences, whether it's arcade or simulation. This affects which fouls get called and determines whether or not your players feel the effects of fatigue. You can also choose from a variety of controller configurations, difficulty settings, game lengths, and camera angles to alter the game. And of course, everything is rendered in 3D, which creates the feeling that you're right in the middle of the action. There are 250 Division I teams available, making it easy to find your favorite squad on the roster. The sound, which includes play-by-play commentary, ball thumps, and sneaker squeaks, works well to get you pumped up and involved in the game. You can also play with up to eight friends (with a multitap) in the multiplayer game.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":63.0,"release_date":918864000,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/rhvt8yfbbyu8dzygwena.jpg","external_ids":[]},{"igdb_id":37014,"name":"NC Tower Defense 2","summary":"A fun and innovation Tower Defense Game!","genres":["Strategy","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1496016000,"platforms":["PC (Microsoft Windows)","Mac"],"cover_url":null,"external_ids":[]},{"igdb_id":42480,"name":"NCAA Basketball","summary":"NCCAA Basketball has unique over-the-shoulder perspective that puts you in the game like never before!\n\nChoose your team from five of the top NCAA basketball conferences and lead it through the grueling tournament to a berth in the Final Four and a national championship! Or, challenge a friend to a head-to-head exhibition game. NCAA Basketball offers more than just a super realistic viewpoint on the action. Call the play, sub in your best players and give it your best shot! Hear the crowd go wild with every shot you hit. All the ecstasy of victory and agony of defeat unique to college hoops is here in NCAA Basketball.","genres":["Sport"],"developers":["Sculptured Software"],"publishers":["Playtronic","Nintendo"],"aggregated_rating":null,"release_date":725760000,"platforms":["Arcade","Super Nintendo Entertainment System"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5z3k.jpg","external_ids":[]},{"igdb_id":43271,"name":"NCAA March Madness 2003","summary":"Do you dream of cutting down the net in New Orleans? Now you can experience the thrill of being the National Champ with NCAA? March Madness? 2003 -- the ultimate college basketball experience. From the crazed fans in the stands, to the mascots on the court and the fight songs played in the arenas, NCAA March Madness 2003 captures the spirit, excitement and rivalry that is college basketball.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1040428800,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/whicpuaz0gdidcyxl9cj.jpg","external_ids":[{"category":3,"store":"store_3","uid":"34852","url":"https://www.giantbomb.com/games/3030-34852/"},{"category":14,"store":"playstation","uid":"31296","url":"https://www.twitch.tv/directory/game/NCAA%20March%20Madness%202003"}]},{"igdb_id":43552,"name":"NCAA College Hoops 2K8","summary":"College Hoops 2K8 is a video game by Visual Concepts and 2K Sports. It was released on November 19, 2007 for the Xbox 360, PlayStation 2 and PlayStation 3.\n\nThe cover features Greg Oden, formerly of the Ohio State Buckeyes.\n\nAlmost every school competing in Division I NCAA college basketball at the time was included in 2K8, including recent additions South Carolina-Upstate, Cal State-Bakersfield and Florida Gulf Coast. Not included were Presbyterian College and North Carolina Central, D-1 independents. Also, Centenary College of the Summit League was unlicensed and instead named UL-Calcutta. The game also featured the ability to change and modify rosters and share them online via the newly introduced 2K Share feature. The real coaches feature was dropped from this game, possibly because the coaches chose not to renew their contracts and all of the coaches are unnamed.\n\nThe announcers/commentators featured in the game were Verne Lundquist and Bill Raftery. The College Hoops series was put on hiatus in 2008 as 2K Sports declined to seek the college license for a 2K9 release. EA Sports got the contract before 2K did, so EA will continue to make college basketball games. EA discontinued their college basketball game series in 2010. It is currently unknown if 2K Sports will continue to make their College Hoops 2K series.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1195430400,"platforms":["PlayStation 3","Xbox 360","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8nkv.jpg","external_ids":[]},{"igdb_id":43638,"name":"NCAA Gamebreaker 2004","summary":"For the first time ever, NCAA GameBreaker 2004 will allow gamers to take their skills online and compete against other college football fans anytime, anywhere. NCAA GameBreaker 2004 further illustrates the realism of college football this year by using the new Practice Mode that gives players the option to sharpen their skills before playing an exhibition or entering season mode. Bringing back the true-to-life college football experience that gamers crave, legendary announcers Keith Jackson and Tim Brandt return to the microphone. With more than 50 new animated mascots, cheerleaders, and sideline personnel, gamers everywhere will feel the spirit and emotion of college football.","genres":["Sport"],"developers":["RedZone Interactive"],"publishers":["Sony Computer Entertainment"],"aggregated_rating":null,"release_date":1061856000,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coaz25.jpg","external_ids":[]},{"igdb_id":43639,"name":"NCAA Gamebreaker 2003","summary":"Football.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1031788800,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/mlycz4pcdcxkbqgtkeqs.jpg","external_ids":[]},{"igdb_id":43640,"name":"NCAA Gamebreaker 2001","summary":"Like previous games in 989 Studios' GameBreaker series, NCAA GameBreaker 2001 is a counterpart to their NFL GameDay series. You start out as a bottom-rung coach at one of the 115 division 1-A college teams and as your performance increases, you obtain promotions and offers from other schools. At the end of the season, you're able to export your players to NFL GameDay. As with the previous games, broadcaster Keith Jackson returns to provide voice commentary.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":966902400,"platforms":["PlayStation","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/pj35udoc0yqlrmjztfxk.jpg","external_ids":[{"category":null,"store":"store_None","uid":"6902","url":"https://www.twitch.tv/directory/game/NCAA%20GameBreaker%202001"},{"category":null,"store":"store_None","uid":"7543","url":"https://www.giantbomb.com/games/3030-7543/"}]},{"igdb_id":43691,"name":"NCAA GameBreaker 2000","summary":"Loaded with a huge number of gameplay modes and extras, GAMEBREAKER 2000 is the ultimate college football simulation. In terms of gameplay you have Scrimmage, Fantasy League, Tournament Season, Bowl Season, and the new Career Mode. In Career Mode, you can take on the role of either the head coach or the offensive or defensive coordinators for any of the Division I-A teams. You start at a small school, but as you accumulate victories you can earn promotions into the bigger and more lucrative programs, where you can ultimately make a run for the National Championship. You can choose from 114 NCAA Division I-A teams, as well as 50 classic teams from the past. The game features a TV-style presentation, with Keith Jackson handling the play-by-play. You also get a Play Editor, where you can customize and create your own plays, and you can also draft players into NFL GAMEDAY 2000.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":937353600,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/q0zrid7vhqt7xryepvff.jpg","external_ids":[{"category":14,"store":"playstation","uid":"611","url":"https://www.twitch.tv/directory/game/NCAA%20GameBreaker%202000"},{"category":3,"store":"store_3","uid":"663","url":"https://www.giantbomb.com/games/3030-663/"}]},{"igdb_id":43709,"name":"NCAA March Madness 2001","summary":"Playstation?s reigning champion of NCAA Men?s basketball is back and hungry for a repeat. This year?s version is boasting promising new features.\n\nCoach Mode is the newest addition to the March Madness stable of gameplay modes. This feature allows masters of the \"X's and O's\" to work their way up from a small college to \"shoecontract-U\" where they vie for the NCAA title. In addition, Dynasty Mode and the playbooks have been expanded, for those gamers who want to dabble in the behind the scenes action of college basketball.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":978739200,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/n1qljk4vqwgutggi6vbt.jpg","external_ids":[{"category":3,"store":"store_3","uid":"27624","url":"https://www.giantbomb.com/games/3030-27624/"},{"category":null,"store":"store_None","uid":"24912","url":"https://www.twitch.tv/directory/game/NCAA%20March%20Madness%202001"}]},{"igdb_id":43710,"name":"NCAA March Madness '98","summary":"March Madness '98 is a college basketball game. Its features include the NCAA Tournament, 107 division 1A teams, 9 women's teams, team specific fight songs and chants, plus authentic college uniforms and logos. The game also gives you the opportunity to win preseason and conference tournaments. Create your own player from scratch, or customize your own NCAA Tournament with up to 64 teams. The game also has a momentum meter which can go up when a team is doing well temporarily increasing the ability ratings of its players.","genres":["Sport"],"developers":["Electronic Arts"],"publishers":["Electronic Arts"],"aggregated_rating":null,"release_date":890784000,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/rznocztg3lgvx59jbo88.jpg","external_ids":[{"category":3,"store":"store_3","uid":"11172","url":"https://www.giantbomb.com/games/3030-11172/"},{"category":null,"store":"store_None","uid":"10248","url":"https://www.twitch.tv/directory/game/March%20Madness%20'98"}]},{"igdb_id":43711,"name":"NCAA GameBreaker 99","summary":"NCAA GAMEBREAKER '99 continues this series' tradition of realistic college football simulations. You'll get features like the Customize Play option, which lets you design your own plays and really makes the possibilities almost endless. While many other football games neglect the running game, NCAA GAMEBREAKER '99 embraces it with open arms. Don't be surprised to find yourself on a 60-yard sprint to the endzone! As the running game is essential to any successful college program, the emphasis on it in GAMEBREAKER truly makes this the most realistic football sim you're likely to find. Of course, you also get all the standard gameplay modes, fully polygonal and texture-mapped players, and all of the college stadiums and team logos. NCAA GAMEBREAKER '99 can be enjoyed by up to eight players through the use of the Multi-tap.If you're ready to make a run at greatness, then get your hands on NCAA GAMEBREAKER '99.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":912211200,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/lhk5ikaglue5tqwlaqv4.jpg","external_ids":[{"category":null,"store":"store_None","uid":"5833","url":"https://www.twitch.tv/directory/game/NCAA%20GameBreaker%2099"},{"category":null,"store":"store_None","uid":"6365","url":"https://www.giantbomb.com/games/3030-6365/"}]},{"igdb_id":43712,"name":"NCAA Football 2000","summary":"NCAA FOOTBALL 2000 has all the gameplay options you expect from a college football sim: Exhibition, Tournament, Great Games, Season, Practice, and Dynasty. You also get 114 division I-A and 26 new division I-AA teams, meaning you're likely to find your favorite squad on the roster. If you're feeling creative, you can also take advantage of the game's Create-A-Player and Create-A-Play features, as well as the new Create-A-School feature. This new mode lets you create a school, and then take its team through multiple seasons in Dynasty mode. You can also scout players and get them interested in playing football for your school by sending different members of the coaching staff to their hometowns. If you're looking for a college football game that has it all, NCAA FOOTBALL 2000 might just be what you need.","genres":["Simulator","Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":964915200,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/zt3bpedob8tbrsrsc0ms.jpg","external_ids":[{"category":3,"store":"store_3","uid":"25459","url":"https://www.giantbomb.com/games/3030-25459/"},{"category":null,"store":"store_None","uid":"23022","url":"https://www.twitch.tv/directory/game/NCAA%20Football%202000"}]},{"igdb_id":43713,"name":"NCAA Football '99","summary":"NCAA FOOTBALL '99 gives those of us who never attended Nebraska or Notre Dame the complete college football experience. Play modes include Exhibition, Tournament, Great Games, Season, Practice, and Dynasty. You get 112 Division I-A teams and their stadiums, so you'll likely find your favorite major college team on the roster. One of the coolest features is the Dynasty mode, in which you try to build a winning program from scratch. While it may be tough to recruit blue-chip prospects in the beginning, as you start winning big games and making a name for your team, getting good players gets easier. But if you can't recruit them, create them with the Create-A-Player mode. This year's version also has improved AI, so you can expect some serious competition from some of the better schools. If you've always wanted to be the Big Man On Campus, now's your chance with NCAA FOOTBALL '99.","genres":["Simulator","Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":904608000,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/ugeu7gzchjff0s7fbct1.jpg","external_ids":[{"category":14,"store":"playstation","uid":"2997","url":"https://www.twitch.tv/directory/game/NCAA%20Football%2099"},{"category":3,"store":"store_3","uid":"3259","url":"https://www.giantbomb.com/games/3030-3259/"}]},{"igdb_id":43714,"name":"NCAA Football '98","summary":"NCAA FOOTBALL '98 gives those of us who never attended Florida State or Michigan the complete college football experience. Play modes include Exhibition, Tournament, Great Games, Season, Practice, and Dynasty. You get 112 Division I-A teams and their stadiums, so you'll likely find your favorite major college team on the roster. The most exciting feature is a Dynasty mode that allows you to take a college team through multiple seasons. While the game does your recruiting for you, you can specify what types of players you need to bolster your team. If you're having a hard time finding a specific type of player, play, or team, you can take advantage of the Create-A-Player, Create-A-Play, or Create-A-School features. Now you can know the feeling of being in a bowl game playing in front of 10,000 fans, thanks to NCAA FOOTBALL '98.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":877392000,"platforms":["PC (Microsoft Windows)","PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8lez.jpg","external_ids":[{"category":null,"store":"store_None","uid":"8569","url":"https://www.twitch.tv/directory/game/NCAA%20Football%2098"},{"category":null,"store":"store_None","uid":"9347","url":"https://www.giantbomb.com/games/3030-9347/"}]},{"igdb_id":43715,"name":"NCAA Final Four 2001","summary":"NCAA FINAL FOUR 2001 has all the standard game modes including Exhibition, Season and Tournament modes, and it also tracks season stats for both players and teams. The game has almost every Division I men's college teams and sports a fair amount of women's squads as well. The game also features the Touch Shooting Meter, so players will have even more control over their jump shots. Quinn Buckner handles the announcing duties and the sound really manages to capture that college game feel. If you get tired of playing the computer you can always take on a friend in the versus mode and take him to school.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":975715200,"platforms":["PlayStation","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/nsgz03k9pxzkng8oqhjd.jpg","external_ids":[{"category":null,"store":"store_None","uid":"23927","url":"https://www.twitch.tv/directory/game/NCAA%20Final%20Four%202001"},{"category":3,"store":"store_3","uid":"26484","url":"https://www.giantbomb.com/games/3030-26484/"}]},{"igdb_id":43716,"name":"NCAA Final Four 2000","summary":"Improving from last year?s mark NCAA? Final Four? 2000, once again, is the most complete NCAA basketball game of the year. With virtually every Division I team represented, you?ll be sure not to miss any of the big games. Pick your team and track their progress. You can also check your school?s status all the way down to the Final Four with the All-New Bubble Watch. Now you?ll know exactly who?s in, who?s out and who is \"on the bubble\". With Exhibition, Season, Tournament and Arcade modes, you decide your level of dedication. Looking to improve your school?s roster? We?ve also included a new Recruit Player feature. Put yourself in the game and take your school to the big dance. Work your way up from Freshman to Senior difficulty levels as you build confidence and gain experience. The whole year, you are immersed in collegiate basketball intensity with authentic fight songs, crowd chants and last minute buzzer beaters. From Top 10 match-ups to cross-town rivalries, 989 Sports delivers the most intense collegiate basketball experience of the year.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":944006400,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/deapunpj4r22qai3whmz.jpg","external_ids":[{"category":3,"store":"store_3","uid":"12173","url":"https://www.giantbomb.com/games/3030-12173/"},{"category":14,"store":"playstation","uid":"11182","url":"https://www.twitch.tv/directory/game/NCAA%20Final%20Four%202000"}]},{"igdb_id":43717,"name":"NCAA Basketball Final Four 97","summary":"Mindscape's 1997 installment in the NCAA basketball series, developed by High Voltage. The game features run-n-gun multiplayer gameplay. Play with up to eight other human players for the ultimate basketball experience. Get the best seat in the house by viewing the action from more than 10 different camera angles. NCAA Final Four 97 stars 64 of the hottest collegiate teams, with more than 50 different motion-captured dunks. In addition to challenging your buddies to courtside action, a special Coach's Mode allows you to make your own playbook. You can also assign up to four offensive plays and four defensive sets, and even call the plays on the fly so you don't have to stop the action to set up your players.","genres":["Sport"],"developers":["High Voltage Software"],"publishers":["Mindscape"],"aggregated_rating":null,"release_date":866505600,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5zg7.jpg","external_ids":[{"category":null,"store":"store_None","uid":"19182","url":"https://www.giantbomb.com/games/3030-19182/"},{"category":14,"store":"playstation","uid":"17568","url":"https://www.twitch.tv/directory/game/NCAA%20Basketball%20Final%20Four%20'97"}]},{"igdb_id":43822,"name":"NCAA March Madness 2000","summary":"NCAA March Madness 2000 was the 1999 installment in the NCAA March Madness series. It was released on November 30, 1999 for the PlayStation. Former Maryland player Steve Francis is featured on the cover.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":946512000,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/cjgcxtltqn1c0mnffyut.jpg","external_ids":[{"category":14,"store":"playstation","uid":"31298","url":"https://www.twitch.tv/directory/game/NCAA%20March%20Madness%202000"},{"category":3,"store":"store_3","uid":"34851","url":"https://www.giantbomb.com/games/3030-34851/"}]},{"igdb_id":43823,"name":"NCAA Football 2001","summary":"The crowd sings a roaring fight song, a sophomore in an animal costume jumps around the sidelines, and players fight for their school and a chance at the pros. What are we talking about? College football, of course, and only NCAA Football 2001 can take you all the way to the Orange Bowl. You'll call the plays and control the moves specific to each position on your team. The running game has been improved from the previous year's release and now includes new defensive player logic, pursuit angles, and receiver routes. In dynasty mode, you can build your team from the ground up, even adding junior-college prospects to your roster. If you're more interested in quick-and-dirty action, play in situation mode where you create the scenario--even putting two minutes on the clock and your team within field-goal range. And to amp up the rah-rah college atmosphere of your games, NCAA Football 2001 lets you customize the setting with frat logos and uniforms and even lets you name your players.","genres":["Simulator","Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":967161600,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/qckbbqn6jbk3bhl3bwwi.jpg","external_ids":[{"category":null,"store":"store_None","uid":"24913","url":"https://www.twitch.tv/directory/game/NCAA%20Football%202001"},{"category":3,"store":"store_3","uid":"27623","url":"https://www.giantbomb.com/games/3030-27623/"}]},{"igdb_id":43824,"name":"NCAA March Madness 99","summary":"In March Madness 99 you can take total control of the future of your team with new Dynasty Mode with Recruiting but that's not all. Improved gameplay lets you control leaners fadeaways crossovers dribbles and dunks. You've got total control.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":914976000,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/c1tz4jykl5jebpex0lnr.jpg","external_ids":[{"category":14,"store":"playstation","uid":"31966","url":"https://www.twitch.tv/directory/game/NCAA%20March%20Madness%2099"},{"category":3,"store":"store_3","uid":"35645","url":"https://www.giantbomb.com/games/3030-35645/"}]},{"igdb_id":43825,"name":"NCAA Gamebreaker 98","summary":"NCAA GameBreaker 98 is a Sports game, published by SCEA, which was released in 1997.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":873072000,"platforms":["PlayStation"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/jhygzvos57xn7azctrxs.jpg","external_ids":[{"category":3,"store":"store_3","uid":"22884","url":"https://www.giantbomb.com/games/3030-22884/"},{"category":14,"store":"playstation","uid":"20753","url":"https://www.twitch.tv/directory/game/NCAA%20GameBreaker%20'98"}]},{"igdb_id":44644,"name":"NCAA Football 2002","summary":"NCAA Football was an American football video game series developed by EA Sports in which players control and compete against current Division I FBS college teams. The series is a younger brother to the Madden NFL series.\n\nIn July 2013, the NCAA announced that it would not renew its licensing contract with Electronic Arts because of an ongoing legal dispute regarding the use of player likenesses in the games. However, this contract only covers the use of the NCAA name and related logos, not those of individual schools and conferences, which are negotiated individually or through the Collegiate Licensing Company. The CLC concurrently announced that it would extend its existing licensing deal with EA through 2017, ensuring that EA Sports could continue the series without the NCAA branding.[1] However, the series was placed on hiatus in September 2013, following three major conferences pulling their trademark licenses from EA, and uncertainties surrounding the results of lawsuits involving the use of player likenesses in-game. However, EA Sports is still making an attempt to get the series back going.[2]","genres":["Simulator","Sport"],"developers":["EA Orlando"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":998611200,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/k1paxkmdsbh6n9wgt2gt.jpg","external_ids":[]},{"igdb_id":46380,"name":"NCAA College Football 2K2","summary":"NCAA College Football 2K2: Road to the Rose Bowl is an American football video game developed by Visual Concepts in association with 2K Sports. It was released in 2001 for only the Sega Dreamcast. The cover athlete is former Purdue standout quarterback Drew Brees.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1001721600,"platforms":["Dreamcast"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co40rc.jpg","external_ids":[]},{"igdb_id":46680,"name":"NCAA Football","summary":"NCAA Football is an American football game for the Sega Mega Drive. It was only released in North America.","genres":["Sport"],"developers":["The Software Toolworks"],"publishers":["Mindscape"],"aggregated_rating":null,"release_date":778377600,"platforms":["Super Nintendo Entertainment System","Sega Mega Drive/Genesis"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5oyk.jpg","external_ids":[{"category":null,"store":"store_None","uid":"14641","url":"https://www.twitch.tv/directory/game/NCAA%20Football"},{"category":3,"store":"store_3","uid":"15972","url":"https://www.giantbomb.com/games/3030-15972/"}]},{"igdb_id":47378,"name":"NCAA March Madness 04","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":47427,"name":"NCAA Basketball 09: March Madness Edition","summary":"An Xbox Live Arcade exclusive that allows those who have not experianced NCAA Basketball 09 to relive the 2009 NCAA Tournament for fee of 1200 Microsoft Points ($15)","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1239408000,"platforms":["Xbox 360"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/q7haqhjemswg4wyr8asm.jpg","external_ids":[]},{"igdb_id":56921,"name":"NCIS: Hidden Crimes","summary":"A hidden object game based on the NCIS TV show.","genres":["Puzzle","Adventure"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1473897600,"platforms":["Android","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/xkuuuantontlsl3r1ajc.jpg","external_ids":[]},{"igdb_id":62496,"name":"NCAA March Madness 2002","summary":"The 2002 entry in the college basketball franchise.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1010534400,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/o5wbibwlbgp867xo5spz.jpg","external_ids":[]},{"igdb_id":63243,"name":"N-Cube","summary":"N-Cube is a first-person action/racing game created by Aaron Gaudette, a 16 year-old developer.","genres":["Racing"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/u5ki8tnydheffwxptofq.jpg","external_ids":[]},{"igdb_id":68261,"name":"NCAA Final Four 2003","summary":"NCAA Final Four 2003","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1038355200,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/iakfdwso5yae1hams64n.jpg","external_ids":[]},{"igdb_id":68262,"name":"NCAA Final Four 2002","summary":"The follow-up to Final Four 2001 features the obligatory roster updates with over 300 real NCAA teams and 31 conferences with authentic fight songs and 70 new player models to give the game a feel of realism. The standard modes apply such as Exhibition that supports both one-player or two-player and a Dynasty mode that lets the player compete in a full-season in order to secure a place in the 64-team tournament known as \"March Madness\". It also features the voice talents of Eddie Doucette and Billy Packer who provide play-by-play commentary.","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1005523200,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/knlme7je7bvkgx1yigwf.jpg","external_ids":[]},{"igdb_id":68304,"name":"NCAA Final Four 2004","summary":"NCAA Final Four 2004","genres":["Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1068508800,"platforms":["PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/dsmnvpklwlnymjn4xtoo.jpg","external_ids":[]},{"igdb_id":69580,"name":"NCAA Championship Basketball","summary":null,"genres":["Simulator","Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[{"category":3,"store":"store_3","uid":"11904","url":"https://www.giantbomb.com/games/3030-11904/"},{"category":14,"store":"playstation","uid":"10928","url":"https://www.twitch.tv/directory/game/NCAA%20Championship%20Basketball"}]},{"igdb_id":83522,"name":"NCradle","summary":"Hack into Newton Corporation, evade their firewalls, discover their research, and escape with your prize!","genres":["Puzzle","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1519862400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coac93.jpg","external_ids":[{"category":null,"store":"store_None","uid":"2102870140","url":"https://www.twitch.tv/directory/game/NCradle"},{"category":null,"store":"store_None","uid":"789210","url":"https://store.steampowered.com/app/789210"}]},{"igdb_id":93022,"name":"NCAA: Road to the Final Four","summary":null,"genres":[],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":null,"external_ids":[]},{"igdb_id":137060,"name":"NCAA Football 09: All-Play","summary":"NCAA Football 09: All-Play debuts on the Wii with stylized gameplay that is quick and easy for fans to jump in and out of great head-to-head action. The game features All-Play controls, a multiplayer social experience that allows novice users to compete against advanced players and still enjoy success. All-Play controls are designed for the more novice fans, but also feature a traditional default setting for the more seasoned veterans. NCAA Football 09: All-Play features nearly 200 schools.","genres":["Sport"],"developers":["Team Fusion"],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":1216080000,"platforms":["Wii"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2j6c.jpg","external_ids":[{"category":null,"store":"store_None","uid":"20810","url":"https://www.giantbomb.com/games/3030-20810/"}]},{"igdb_id":175918,"name":"NCAA Football 2004","summary":"This is an N-Gage version of the game. In general it follows the same rules as a console release: it's an American football \"simulator\" where you can choose a team from a vast roster corresponding with 2003 season, pick strategies from a number of offensive and defensive plays and then command your players on the field. Also you can take a look at some of the historical teams and games. But there are a few differences.\n\nThe first and most obvious one is graphics - the N-Gage game has a totally different graphical engine: instead of a fully 3D world, only the field is polygonal and sprites are used for the players models, thus making it more close to the sports games of the 90s. Secondly, Dynasty mode that lets you customize the team, build programs and recruit new members is absent, instead there are only quick play and season modes. Also, there's a one-on-one Bluetooth multiplayer and a bowl game called Nokia Sugar Bowl National Championship.","genres":["Sport"],"developers":[],"publishers":["EA Sports"],"aggregated_rating":null,"release_date":1071014400,"platforms":["N-Gage"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3z7k.jpg","external_ids":[]},{"igdb_id":237298,"name":"NCL: USA Bowl","summary":"Become a champion of your own tournament in NCL: USA Bowl. Race your friends and experience the thrill of American football.","genres":["Racing","Sport"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1675382400,"platforms":["Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co65u5.jpg","external_ids":[{"category":14,"store":"playstation","uid":"1462465691","url":"https://www.twitch.tv/directory/game/NCL:%20USA%20Bowl"}]},{"igdb_id":281904,"name":"NCAA Football 2005 / Top Spin","summary":"This is a physical bundle containing both NCAA Football 2005 and Top Spin.","genres":["Sport"],"developers":["EA Sports","Microsoft Game Studios"],"publishers":["EA Sports","Microsoft Game Studios"],"aggregated_rating":null,"release_date":1104451200,"platforms":["Xbox"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7ldb.jpg","external_ids":[]},{"igdb_id":330133,"name":"NCORE","summary":"This is a free PvPvE multi-arena shooter in the format of an entertainment show.\n\nFight alongside your teammates in a virtual multi-arena for the right to become NCORE champions! Your task is to eliminate opponents and collect as many coins as possible or prevent other teams from doing so. You can move between hexes, raid bosses, ambush other players, or charge straight into battle. Plan your strategy carefully and do whatever it takes to win in NCORE!","genres":["Shooter"],"developers":["Astrum Entertainment"],"publishers":[],"aggregated_rating":null,"release_date":null,"platforms":[],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/coamop.jpg","external_ids":[{"category":null,"store":"store_None","uid":"419359710","url":"https://www.twitch.tv/directory/game/NCORE"}]}]