[{"igdb_id":251263,"name":"7 Card Studs","summary":"7 Card Studs is a free solitaire and multiplayer strategic board game using poker hands. Challenge yourself or a friend to a free poker based board game!\nThe board is 7x7 and has 49 squares. 13 cards start face down on the board and are not revealed until all the other cards are placed.\n\nThe goal of the game is to make the best 5 card poker hands in each row and column. Every row and column has 7 cards, but only the best 5 will be used.\n\nWhen playing solitaire the player scores the points in both the rows and the columns.\nIn multiplayer head to head mode, player 1 plays the rows and player 2 plays the columns in a head to head show down on the same board.","genres":["Card & Board Game"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1376092800,"platforms":["iOS"],"cover_url":null,"external_ids":[]},{"igdb_id":84685,"name":"7 Card Games","summary":"Who has the best hand?","genres":[],"developers":[],"publishers":["cerasus.media"],"aggregated_rating":null,"release_date":1271030400,"platforms":["Nintendo DSi"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co9qha.jpg","external_ids":[]},{"igdb_id":11878,"name":"7 Colors","summary":"Seven Colors is an simple game of colors and strategy. It's a 2 player game, but you can also play against the computer. As an added bonus for human vs human, you can connect to each other through a network. Unfortunately you can't set the difficulty and the AI is surprisingly good. So you can expect to constantly get beaten until you really get a handle on the advanced strategy of the game. The goal of this game is quite simple, you need to cover 50% of the board with your captured colors. The board consists of small squares of 7 different colors.\n\nYou can capture more color pieces by selecting a new color on each turn, then all neighbouring pieces of the new color immediately change color to the new one and become yours. Your field then changes color every turn and consumes more and more color pieces until one player get 50%.","genres":["Puzzle","Simulator"],"developers":["Gamos"],"publishers":["Infogrames"],"aggregated_rating":null,"release_date":694137600,"platforms":["PC-9800 Series","DOS","Amiga"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/utymg2o7etu0u0ypbtzy.jpg","external_ids":[]}]