[{"igdb_id":41974,"name":"7 Pillars","summary":"Short (~ 3 hrs of gameplay in one play through) single player RPG with turn based combat. Easy to pick up for first time RPG players. Accumulating enough XP will automatically level up your character. All you have to worry about from a customization standpoint is different weapons if you find them that are specific to each character. Higher level bosses will most likely require items (such as healing potions and revival stimulants), so exploration and random encounter battles are crucial for end game success.","genres":["Role-playing (RPG)"],"developers":["Mark Hagan"],"publishers":["Mark Hagan"],"aggregated_rating":null,"release_date":1497916800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co29dp.jpg","external_ids":[]},{"igdb_id":175396,"name":"7 Planets","summary":"7 Planets is logic board game of rolling and matching wooden balls. It is based on Ziv Zav board game made in 1985.\nYou get old wooden box with 28 balls in 7 colors which you must place in correct rows. But be aware, balls are every time randomly placed and when one ball moves in a raw all others also move.","genres":["Puzzle"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1323043200,"platforms":["iOS"],"cover_url":null,"external_ids":[{"category":null,"store":"store_None","uid":"481389880","url":"https://www.twitch.tv/directory/game/7%20Planets"}]},{"igdb_id":233154,"name":"7 Pips","summary":"7Pips is a little less casual than those games, this game may need a little simple math (actually there is a in-game help to smooth things out), and plenty of strategic placement planning! Place dice on board, same color adds, different colors subtract, form dice faces with 7Pips to score. Fill up the board and it's game over, last long and score high!","genres":["Puzzle"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1410307200,"platforms":["Android","iOS"],"cover_url":null,"external_ids":[{"category":14,"store":"playstation","uid":"152646111","url":"https://www.twitch.tv/directory/game/7%20Pips"}]}]