[{"igdb_id":113865,"name":"7th Sea: A Pirate's Pact","summary":"Fight for what's right—as an up and coming pirate! Battle slavers, sea monsters, and your own corrupt government to become a hero of the high seas. But will you betray your own crew for wealth and power? \n \n7th Sea: A Pirate's Pact is a 200,000-word interactive adventure novel by Danielle Lauzon, set in the world of the table-top role playing game 7th Sea. It's entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination. \n \nLooking for adventure at sea? You’ll get more than you bargained for when you end up joining a pirate crew. These pirates are known among sailors for having their own moral code, one that is now yours. You'll have the chance to rescue prisoners, uncover a secret plot, and even build a navy to liberate an island fort full of slaves. \n \nBut you'll also be tempted to break your pirate bonds to seek your own gain. Would you still free the slaves if you could take out your own rivals instead? How far will you go to save your friends? And when you uncover corruption in your homeland, will you choose villainy or vengeance? \n \nEarn your crew's loyalty and they might make you their captain, but get careless and you might have to walk the plank!","genres":["Role-playing (RPG)","Adventure","Indie"],"developers":["Choice of Games"],"publishers":["Choice of Games"],"aggregated_rating":null,"release_date":1544745600,"platforms":["Linux","PC (Microsoft Windows)","Mac"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co28ri.jpg","external_ids":[]},{"igdb_id":11817,"name":"7th Dragon","summary":"7th Dragon is a Japanese role-playing video game and the first game in the 7th Dragon series. 7th Dragon takes place in the world of Eden of which 80% is ruled by dragons, so the premise of the game is simple: Kill all the dragons, or the human race is going to be wiped out of existence. When players start their journey, they can create their own characters from the following classes: Mage, Princess, Rogue, Knight, Samurai, Fighter, or Healer. Outside of battle the characters will be viewed traveling the overworld from an overhead perspective, while the battles are viewed from a side perspective showing each character as they attack their foes.","genres":["Role-playing (RPG)","Adventure"],"developers":["Imageepoch"],"publishers":["Sega"],"aggregated_rating":80.0,"release_date":1236211200,"platforms":["Nintendo DS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3vmp.jpg","external_ids":[]},{"igdb_id":115336,"name":"7th Sector","summary":"7th Sector invites you to immerse into the mysterious world of cyberpunk and overcome a difficult path by solving various technical puzzles, facing dangers and collecting information about the world and the events happening in it.","genres":["Shooter","Platform","Puzzle","Adventure","Indie"],"developers":["Noskov Sergey","Sometimes You"],"publishers":["Sometimes You"],"aggregated_rating":76.25,"release_date":1551744000,"platforms":["PlayStation 4","PC (Microsoft Windows)","Xbox One","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co1zxw.jpg","external_ids":[]},{"igdb_id":214930,"name":"7th Serpent: Crossfire","summary":"7th Serpent is a third-person shooter modification for the Max Payne 2 game engine thrusting players into a world of corruption, secrecy and vengeance as they control Damon Pryce - the main character - who has been subjected to experimental testing and is left to his own devices in order to extract the truth from those who keep it from him.","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1143590400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5c1b.jpg","external_ids":[]},{"igdb_id":308917,"name":"7th Domain","summary":"\"7th Domain\" is a horizontal version action game derived from Roguelike Metroidvania combined with treasure grinding gameplay. You will play a child of destiny who repairs the world and finds the truth of the broken world. You will grow in battle and challenge the unknown and hidden forces.","genres":["Platform","Role-playing (RPG)","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1723766400,"platforms":["PC (Microsoft Windows)","Nintendo Switch"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co8j24.jpg","external_ids":[]},{"igdb_id":88084,"name":"7th Deep","summary":"The 7th Deep Beckons... \n \nThe mysterious Kaia has found seven powerful individuals, one of whom is capable of reaching the bottom of the 7th Deep, an ancient dungeon filled with countless treasure and hordes of monsters, to claim the powerful God-Asper. This Relic is said to give the wielder the power to make dreams come true and you can bet that everyone wants a piece of the action! \n \nMake your choices: Will you be an evil alien who uses hi-tech weapons to obliterate his foes, a vampire that uses the lifeblood of others to revitalise herself, or maybe a powerful acolyte with potent, innate healing abilities? \n \nYour character choice will decide which options you have when you must make difficult decisions while exploring the Deep. A man is hanging on for his life. What will you do? As a Good character you may get help or put yourself at risk to save him. As an Evil character you might taunt him, rob him, or hasten his demise. The choice is yours. \n \nYou must use all of your cunning and resourcefulness if you wish to reach the bottom of the 7th Deep where an incredible object of power and an even greater, ancient evil awaits. The God-Asper silently awaits its new owner. Anticipation races through your soul; what would you do with such power?","genres":["Role-playing (RPG)"],"developers":["G. A. Williams"],"publishers":["G. A. Williams"],"aggregated_rating":null,"release_date":1520467200,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co297g.jpg","external_ids":[]},{"igdb_id":11828,"name":"7th Dragon III Code: VFD","summary":"7th Dragon III Code: VFD is an upcoming game in the 7th Dragon series of Japanese role-playing games. It will allow players to choose from eight jobs and 32 appearances for their party members, and 40 battle voices. 7th Dragon III Code: VFD is set in three time periods: the past, the present, and the future.","genres":["Role-playing (RPG)","Adventure"],"developers":["Sega Games"],"publishers":["Sega of America","Sega Games"],"aggregated_rating":79.0,"release_date":1444867200,"platforms":["Nintendo 3DS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2zhr.jpg","external_ids":[]},{"igdb_id":172115,"name":"7th Sector: Museum","summary":"You have the opportunity to wander through the gloomy halls of the 7th Sector museum.","genres":["Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1564617600,"platforms":["PC (Microsoft Windows)"],"cover_url":null,"external_ids":[]},{"igdb_id":11826,"name":"7th Dragon 2020-II","summary":"7th Dragon 2020-II is a Japanese role-playing game and the sequel to 7th Dragon 2020. Set a year after the events of the first game, Murakumo has moved its main base from the Metropolitan Government Building and is focusing on rebuilding. Squad 13 is called to the Tokyo Sky Tower to rid of some monsters to help the rebuilding process in the tower. However, a portal appears at the top of the Sky Tower and Dragons appear once more to strike down humanity.","genres":["Role-playing (RPG)"],"developers":["Imageepoch"],"publishers":["Sega"],"aggregated_rating":null,"release_date":1366243200,"platforms":["PlayStation Portable"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2nh8.jpg","external_ids":[{"category":null,"store":null,"uid":"B00ABA7OIA","url":null},{"category":null,"store":null,"uid":"85865","url":"https://www.twitch.tv/directory/game/7th Dragon 2020-II"},{"category":null,"store":null,"uid":"40618","url":"https://www.giantbomb.com/games/3030-40618/"}]},{"igdb_id":152897,"name":"7th Chance","summary":"7th Chance is a short story-based exploration adventure game where you make choices that determine the fate of your character.","genres":["Puzzle","Adventure"],"developers":["drewidgames"],"publishers":["drewidgames"],"aggregated_rating":null,"release_date":1624492800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co3ao6.jpg","external_ids":[]},{"igdb_id":253471,"name":"7th Domain","summary":"\"7th Domain\" is a horizontal version action game derived from Roguelike Metroidvania combined with treasure grinding gameplay. You will play a child of destiny who repairs the world and finds the truth of the broken world. You will grow in battle and challenge the unknown and hidden forces.","genres":["Role-playing (RPG)","Adventure","Indie"],"developers":["Lightimpact"],"publishers":["BD Games"],"aggregated_rating":null,"release_date":1700092800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7749.jpg","external_ids":[]},{"igdb_id":214932,"name":"7th Serpent: Genesis","summary":"7th Serpent: Genesis is a Max Payne 2 modification and the sequel to the acclaimed 7th Serpent: Crossfire.","genres":["Shooter"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1228521600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co5c1c.jpg","external_ids":[]},{"igdb_id":255428,"name":"7th Memory","summary":"Otome visual novel for PC.","genres":["Visual Novel"],"developers":["Mix Factor"],"publishers":["Mix Factor"],"aggregated_rating":null,"release_date":1186617600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6pb2.jpg","external_ids":[]},{"igdb_id":11823,"name":"7th Dragon 2020","summary":"7th Dragon 2020 is a Japanese role-playing game and a spin-off sequel to the original 7th Dragon. It changes the setting from 7th Dragon's generic fantasy world to post-apocalyptic Tokyo, and ditches the 2D sprites for an entirely 3D graphics. Despite the change in setting, the basic story is largely identical - the world has been invaded by dragons, bringing with them a brand of poisonous flowers. As a group of survivors known as Murakamo 13, you must search through the wreckage of the various districts of Tokyo to find other refugees, kill lots of dragons, and contend with a rival group of humans known as SKY.","genres":["Role-playing (RPG)"],"developers":["Imageepoch"],"publishers":["Sega"],"aggregated_rating":null,"release_date":1322006400,"platforms":["PlayStation Portable"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2fcm.jpg","external_ids":[]},{"igdb_id":305696,"name":"7th Floor","summary":"Find your missing daughter in the Hospital of Madness. Collect items, fight enemies, and do whatever it takes to reach her!","genres":["Shooter","Adventure","Indie"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1761868800,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co99kl.jpg","external_ids":[]},{"igdb_id":44019,"name":"7th Dragon III Code: VFD - Launch Edition","summary":"In the year 2100, dragons have descended upon earth and humanity is at the mercy of these terrifying beasts. However, not all is lost. As the protagonist, the player will team up with Nodens Enterprises-a video game company dedicated to stopping the dragon menace-to become a dragon hunter and eventual savior of the universe. Although times are bleak, Nodens Enterprises has found a way to tip the scales in favor of mankind: By traveling through time to three different eras, the protagonist can upset the balance of the dragons' power. This will give them the edge to defeat the True Dragons, and stand a chance against the most powerful one of them all... the 7th Dragon: VFD.\n\nThe Launch Edition includes a 28 page art book.","genres":["Role-playing (RPG)"],"developers":[],"publishers":[],"aggregated_rating":null,"release_date":1470960000,"platforms":["Nintendo 3DS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co6c45.jpg","external_ids":[]},{"igdb_id":9895,"name":"7th Legion","summary":"There's no Salvation from this army!\nCan you survive this furiously fast, kill-for-money, real-time blood-fest? There's nowhere to hide as you smash your opponent in 'to-the-limit' conflict. And, while you've got a few nanoseconds to spare, you've got to build to survive, mechs, tanks, troops, mounted slavens - a host of murderous military units who will hone their killing skills with experience.\n\nJust what devastating effect does a 7th legion priest have in battle? what happens when you summon the dark legion?\n\nThe landscape is isometric and you've got to be ice-cool to survive in the blazing heat of combat. And there's more! Random power ups and a massive selection of battle cards that can turn the tides of war in a flash. But be careful: you don't know what cards your opponent is holding and even when you've got his last trooper cornered he might play the battle card that wipes away your entire force!\n\nSalvation? They'll be lucky to find a stone to crawl under!","genres":["Real Time Strategy (RTS)","Strategy","Turn-based strategy (TBS)","Adventure"],"developers":["Vision Software","Epic Games","GT Interactive Software","MicroProse"],"publishers":["MicroProse Software, Inc.","Nightdive Studios","Retroism","Ingram Entertainment"],"aggregated_rating":null,"release_date":875577600,"platforms":["PC (Microsoft Windows)","64DD"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2zpg.jpg","external_ids":[]}]