[{"igdb_id":4629,"name":"7 Wonders of the Ancient World","summary":"Players take the task of reconstructing the 7 Wonders of the Ancient World. In each wonder, there are 5 to 7 sub-levels of runes that players switch to form a row of 3 or more runes.\nThere are two modes of play: Free Play and Quest Modes. In Free Play, players can choose to play any level they have completed in Quest Mode.","genres":["Puzzle","Strategy"],"developers":["Hot Lava Games","MumboJumbo"],"publishers":["MumboJumbo"],"aggregated_rating":null,"release_date":1140048000,"platforms":["PC (Microsoft Windows)","PlayStation Portable","Nintendo DS","PlayStation 2"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co21ud.jpg","external_ids":[]},{"igdb_id":4634,"name":"7 Wonders II","summary":"Journey back in time with the 7 Wonders series to when magnificent structures were being built in far away lands. Enjoy challenging match-3 game play in a newly enhanced interactive environment where you not only learn about marvelous new wonders such as Stonehenge and Taj Mahal, but also watch them come to life piece by piece before your very eyes.","genres":["Puzzle","Adventure"],"developers":["Hot Lava Games"],"publishers":["Mumbo Jumbo","Eidos Interactive","rondomedia Marketing & Vertriebs GmbH"],"aggregated_rating":null,"release_date":1177027200,"platforms":["PC (Microsoft Windows)","Nintendo DSi","Nintendo DS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co21ue.jpg","external_ids":[]},{"igdb_id":4635,"name":"7 Wonders: Treasures of Seven","summary":"Match runes and break blocks as you build the world`s most wondrous structures in this ground-breaking Match 3 game! Rotate the game cubes to unlock each level with your keystone. Challenge your mind with intense, multi-layered puzzle cubes. Fill your life with wonder; buy 7 Wonders: Treasures of the Seven!","genres":["Puzzle"],"developers":["MumboJumbo"],"publishers":["Accelerate Games"],"aggregated_rating":null,"release_date":1226620800,"platforms":["PC (Microsoft Windows)","Nintendo DS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co21uf.jpg","external_ids":[]},{"igdb_id":4637,"name":"7 Wonders: Magical Mystery Tour","summary":"See the 7 Wonders and go on a Magical Mystery Tour in this incredible Match 3 game! Go on a sensational journey to enchanting sites and match the magical runes to restore legendary locations. Repair El Dorado, Atlantis, Shangri-La, and others with help from your crew of Guild Workers. Can you gather the resources needed to repair the 7 Wonders? Take on this challenging Match 3 game and find out!","genres":["Puzzle","Strategy"],"developers":["MumboJumbo"],"publishers":["MumboJumbo"],"aggregated_rating":null,"release_date":1317686400,"platforms":["PC (Microsoft Windows)","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co21ug.jpg","external_ids":[]},{"igdb_id":4638,"name":"7 Wonders: Ancient Alien Makeover","summary":"Construct exciting new wonders with the help of advanced alien technology in 7 Wonders: Ancient Alien Makeover! Match 3 your way to success as you build-up your arsenal of power-ups and gain the resources to construct the wonders of the world and even your very own village. A new experience awaits you in this fantastic Match 3 game!","genres":["Puzzle","Strategy"],"developers":["MumboJumbo"],"publishers":["Accelerate Games"],"aggregated_rating":null,"release_date":1351036800,"platforms":["PC (Microsoft Windows)","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co21uh.jpg","external_ids":[]},{"igdb_id":89128,"name":"7 Wonders","summary":"Strategy card game. Compete against players from all around the world in the digital adaptation of this multi-award winning tabletop game.\n\nPlayable offline against the Artificial Intelligence. Internet connection required for online functionalities.\n\nRecommended devices: Iphone 6, iPad Air, and more recent devices.\n\nFast-paced, well-balanced and accessible strategy card game.\n\nDevelop your military, scientific, commercial or civil domains… Choose your strategy and place your cards to develop your civilization and construct one the seven wonders of the world.\nThe simple rules and the convenient tutorial will help you master the interface and the different game concepts to guarantee an incredible gaming experience.\n\nCOMPETE ON EQUAL TERMS: There are no cards to collect, the drafting mechanism guarantees that players are on an equal footing each game. Your strategy will make the difference, not the size of your card collection.\n\nDON’T WAIT, JUST PLAY: All players act simultaneously, as such you do not wait for each other player to finish their turn.\n\nPRACTICE MAKES PERFECT: Sharpen your skills by playing against the A.I.\n\nMULTIPLAYER: Up to 7 players per game.\n\nGAME LENGTH: 5–8 Minutes\n\nLanguages available:\n\nEnglish\nFrench\nSpanish\nGerman\nPolish\nDutch\nItalian","genres":["Strategy","Tactical","Card & Board Game"],"developers":["Repos Production"],"publishers":["Repos Production"],"aggregated_rating":null,"release_date":1510531200,"platforms":["Android","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co21ub.jpg","external_ids":[]},{"igdb_id":129012,"name":"7Worlds: The Dreaming Dale","summary":"This game is a 2D Pixel Adventure Platformer where you need some running and jumping skills to get through an amazing story shown nicely in a form of comic book pages! Don't hesitate to long! The Dreaming Dale is in danger and only Ronnie led by your decisions can save his beloved village!","genres":["Adventure","Indie"],"developers":["Green Dragon Art"],"publishers":["Green Dragon Art"],"aggregated_rating":null,"release_date":1580601600,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co2lji.jpg","external_ids":[{"category":null,"store":"store_None","uid":"1447575327","url":"https://www.twitch.tv/directory/game/7WORLDS%3A%20The%20Dreaming%20Dale"},{"category":null,"store":"store_None","uid":"1222220","url":"https://store.steampowered.com/app/1222220"}]},{"igdb_id":214649,"name":"7 Wonders Duel","summary":"7 Wonders Duel is solely for two players, with the players not drafting cards simultaneously from hands of cards, but from a display of face-down and face-up cards arranged at the start of a round. A player can take a card only if it's not covered by any others, so timing comes into play as well as bonus moves that allow you to take a second card immediately. As in the original game, each card that you acquire can be built, discarded for coins, or used to construct a wonder.","genres":["Strategy","Card & Board Game"],"developers":[],"publishers":["Repos Production"],"aggregated_rating":null,"release_date":1571788800,"platforms":["Android","iOS"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co54pu.jpg","external_ids":[]},{"igdb_id":281805,"name":"7 Wonders Trilogy","summary":"This is a trilogy of three games in the 7 Wonders series on one disc: 7 Wonders of the Ancient World, 7 Wonders II, and 7 Wonders: Treasures of Seven.","genres":["Puzzle"],"developers":["MumboJumbo"],"publishers":["MumboJumbo"],"aggregated_rating":null,"release_date":1276646400,"platforms":["PC (Microsoft Windows)"],"cover_url":"//images.igdb.com/igdb/image/upload/t_thumb/co7l94.jpg","external_ids":[]}]